{"id":10154,"date":"2018-11-29T08:16:00","date_gmt":"2018-11-29T16:16:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10154"},"modified":"2019-03-29T09:05:14","modified_gmt":"2019-03-29T16:05:14","slug":"a-view-into-the-future-with-ilpas-scott-stewart","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/a-view-into-the-future-with-ilpas-scott-stewart\/","title":{"rendered":"A View into the Future with ILPA&#8217;s Scott Stewart"},"content":{"rendered":"<h2>Q&amp;A with Scott Stewart, Chief Executive Officer of the ILPA<\/h2>\n<p>As an executive and leader, Scott Stewart has spent over 20 years working to connect, educate, and mobilize diverse teams to achieve meaningful public policy goals. Previously, he designed, developed and ran the first FinTech Ideas Festival, which featured the world’s leaders at the confluence of finance, innovation and technology was livestreamed by CNBC, and hosted 110 CEOs from the financial services and technology industries.<\/p>\n<p>Today, Scott serves as the Chief Executive Officer of the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/innovativelending.org\/\">Innovative Lending Platform Association<\/a><\/span>. The ILPA is a trade association representing online business lending and financial firms.<\/p>\n<p>Fundbox <a href=\"https:\/\/www.prnewswire.com\/news-releases\/6th-avenue-capital-bluevine-and-fundbox-join-ilpa-300713436.html\">recently<\/a> became a proud member of the ILPA. To mark this milestone, we connected with Scott to chat about the role of the ILPA, and to learn from his industry insights and unique vantage point.<\/p>\n<figure style=\"width: 300px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/11\/7a616ddd-80eb-4344-8f4b-b5bbdfc706fe_pasted20image200.png\" alt=\"Headshot of Scott Stewart, CEO of the Innovative Platform Lending Association\" width=\"300\" height=\"300\" \/><figcaption class=\"wp-caption-text\"><em>Scott Stewart, CEO of the Innovative Platform Lending Association<\/em><\/figcaption><\/figure>\n<p>&#8212;<\/p>\n<p><strong><span style=\"font-style: italic;\">Fundbox<\/span><\/strong><span style=\"font-weight: bold; font-style: italic;\">:<\/span><span style=\"font-style: italic;\"> C<\/span><span style=\"font-style: italic;\">an you start by <\/span><span style=\"font-style: italic;\">explaining<\/span><span style=\"font-style: italic;\"> what the Innovative Lending Platform Association is and what the key functions of the organization are?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">Scott Stewart:<\/span> Absolutely. The Innovative Lending Platform Association is a 501(c)(6) trade association that represents online small business lenders. We represent the largest and most recognizable brands in the industry including Kabbage, OnDeck, BlueVine, Fundbox, Lendio, The Business Backer, Breakout Capital Finance, Headway Capital and 6th Avenue Capital.<\/p>\n<p style=\"padding-left: 30px;\">Some of the key functions of the organization are working with and providing resources to small business lending companies.<\/p>\n<p style=\"padding-left: 30px;\">A lot of companies don’t have the resources to invest in government and external affairs, but they face public policy challenges. As an organization, one of our primary functions is to bring together all of the resources we can to educate and influence public policy at the state and the federal government level.<\/p>\n<p style=\"padding-left: 30px;\">We also do cybersecurity, privacy, and fraud prevention work.<\/p>\n<p style=\"padding-left: 30px;\">Finally, we offer our members a view to the future. Our members want to know what is coming next in terms of emerging technologies, and find a way to invest them in globally significant opportunities.<\/p>\n<p><span style=\"font-style: italic;\">The ILPA has developed a tool called SMART Box. What is that and how does it help small businesses?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS:<\/span> SMART Box stands for “Straightforward Metrics Around Rate and Total cost.”<\/p>\n<p style=\"padding-left: 30px;\">We were founded as organization to house this tool for online small business lenders to disclose the cost of capital to their small business borrowers.<\/p>\n<p style=\"padding-left: 30px;\">There are four metrics in the box. It’s a disclosure that shows total cost of capital, what you’re going to pay for your credit, the APR, the monthly total cost, and cents on a dollar. We also showcase a couple questions about any pre-payment issues you should know about.<\/p>\n<p style=\"padding-left: 30px;\">We feel like it’s an important way to show our small business borrowers exactly what they’re getting when they’re taking out capital from our companies and to provide them an opportunity to compare various products in an apples-to-apples fashion.<\/p>\n<p><span style=\"font-style: italic;\">Who’s using SMART Box now? How is adoption going?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS<\/span><span style=\"font-weight: bold;\">:<\/span> Adoption is just beginning. Our initial lending members have adopted it. I would expect that within the next six months or so, our three new members that just joined ILPA [including Fundbox] will implement SMART Box as well.<\/p>\n<p style=\"padding-left: 30px;\">The SMART Box is an important tool for the small business borrower. The goal is to help them understand and compare various capital options.<\/p>\n<p><span style=\"font-style: italic;\">APR is often not the most helpful metric for our industry. Why do so many financial professionals see it as an imperfect metric? On the other hand, why do so many small business borrowers really want to know that number?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS:<\/span> APR is in some ways a relic of the 1960s mortgage market, but it is something that small business borrowers recognize and want to see. Let me give you a quick example of why it doesn’t make a lot of sense in certain circumstances.<\/p>\n<p style=\"padding-left: 30px;\">Imagine I am a small business owner, I own a hair salon for example, with two chairs in my shop, and I’m looking for additional $20,000 to add two more chairs to the shop. I’ve got great revenues, I’ve been in business for a couple of years, things are going fine, but I launched my business using funds from my credit cards and it blew up my personal credit score. Let’s say my personal credit score is 640.<\/p>\n<p style=\"padding-left: 30px;\">I go to a bank, and the bank says, “Are you kidding me? There is no chance you’re going to have any access to credit from us, because based on our risk and regulatory requirements we can’t serve you.”<\/p>\n<p style=\"padding-left: 30px;\">That business owner can come to us and we say, “Great. We are happy to provide you access to capital. We see you’ve got a great business going. You have a lot of things that are going just well for you, and we don’t really care about the FICO score, so here’s $20,000. You’re going to pay us $2,000 over the course of six months.”<\/p>\n<p style=\"padding-left: 30px;\">So, two gets you 20. That’s an easy number to understand: that’s the total cost of the capital. When you do the math on APR, that’s a 40% APR.<\/p>\n<p style=\"padding-left: 30px;\">That can sound high. But typically, the small business borrower doesn’t care about that metric, but they want to see it.<\/p>\n<p style=\"padding-left: 30px;\">As we’ve gone through our research, we’ve found that when our member companies launched SMART Box, they had no slowdown in originations for their small business borrowers due to that top line number. The first number a business borrower looks at is the total cost of capital.<\/p>\n<p style=\"padding-left: 30px;\">They might say, “Okay, 2,000 gets me 20,000. I get that. I’m going to pay 2,000 over the course of six months. I don’t care that the APR is 40% because it doesn’t matter in my world of trying to build revenues for my business. I’m going to turn that into $50,000 or $60,000 a year in new revenue. It makes all the sense in the world.”<\/p>\n<p><span style=\"font-style: italic;\">You recently participated in the <\/span><span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.itu.int\/en\/ITU-T\/AI\/2018\/Pages\/default.aspx\">AI for Global Good Summit<\/a><\/span><span style=\"font-style: italic;\">. <\/span><span style=\"font-style: italic;\">What was that event and what is the value to your members in engaging with events like this?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS:<\/span> The AI for Global Good Summit is hosted by the United Nations. I ended up with a lot of interesting globally-significant contacts when I started the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.fintechideasfestival.com\/\">FinTech Ideas Festival<\/a><\/span> and built that out.<\/p>\n<p style=\"padding-left: 30px;\">To take a step back, I think it’s important for us (and for our CEOs and companies) to be thinking about the future at the confluence of finance innovation and technology.<\/p>\n<p style=\"padding-left: 30px;\">I think that one of the things that’s important for our members to understand is what is going to be reshaping our civilization in the next 10 years. Here we are, at a moment in time, where technology is accelerating so rapidly. Pick up a copy of <span style=\"font-style: italic;\">The Fourth Industrial Revolution<\/span>, a very interesting book by Klaus Schwab that really talks about how rapidly the change is happening.<\/p>\n<p style=\"padding-left: 30px;\">I’ll just give you a quick example:<\/p>\n<p style=\"padding-left: 30px;\">If you look at the first industrial revolution, the spindle is the symbol of it, where you can rapidly turned wool into a thread. It took about 150 years for that innovation, the spindle, to transverse the globe so that everyone had access to it.<\/p>\n<p style=\"padding-left: 30px;\">What you’re talking on right now is probably a smartphone, a hand-held device that people in Kenya are using to make micropayments. It appeared in the marketplace about ten years ago. Technology is accelerating at a pace that is unprecedented in human history, and that’s reshaping our civilization.<\/p>\n<p style=\"padding-left: 30px;\">What we should be understanding and thinking about is a series of forces that are coming together to make that change happen.<\/p>\n<p style=\"padding-left: 30px;\">I think Internet of things by itself is sort of interesting. You can connect your stove, and your refrigerator, and your car, and your house, and everything else to the Internet gradually. It gets a little bit more interesting when you can capture all of that with big data. What brings it all together and makes it the most interesting is this advent of artificial intelligence and machine learning.<\/p>\n<p style=\"padding-left: 30px;\">When you can act on that data in real time with human-like responses, that’s going to be completely transformative for how we live, how we work, how we take out capital. I think that that’s something I want our members to really be thinking about, and to be working on, and certainly to be considering for their small business borrowers.<\/p>\n<p><span style=\"font-style: italic;\">As you know well, that concept is really core to what Fundbox does and what makes us unique is how we action all that data that’s out there. <\/span><span style=\"font-style: italic;\">I think<\/span><span style=\"font-style: italic;\"> the ethical concerns around <\/span><span style=\"font-style: italic;\">all this data are interesting, too, since<\/span><span style=\"font-style: italic;\"> we <\/span><span style=\"font-style: italic;\">want to <\/span><span style=\"font-style: italic;\">use this technology to build a better worl<\/span><span style=\"font-style: italic;\">d.<\/span><span style=\"font-weight: bold; font-style: italic;\"> <\/span><span style=\"font-style: italic;\">Do you have any thoughts to share about how we can create this technologically<\/span><span style=\"font-style: italic;\">&#8211;<\/span><span style=\"font-style: italic;\">fueled innovation while keeping those concerns in mind?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS<\/span><span style=\"font-weight: bold;\">:<\/span> Absolutely. We’re already there. Our member companies are at the forefront of providing financial services products to small businesses that are underserved.<\/p>\n<p style=\"padding-left: 30px;\">You look at what happened after the financial crisis, and you can see that banks withdrew from their branches in rural areas and in inner cities based on risk. They really pulled back on their lending and tightened credit. We were there in the gap to fill that credit gap for those that might not have the most pristine credit, and to offer them access to capital. That is borne out in the research data.<\/p>\n<p style=\"padding-left: 30px;\">We released our NDP analytics report not that long ago, and it shows that about a quarter of all the dollars that we lend as an industry between 2015 and 2017, which was $10 billion, went to micro-businesses, with less than $100,000 revenue. A full third of those dollars went to low and moderate-income borrowers in low and moderate income ZIP codes. That’s an incredible piece of financial inclusion.<\/p>\n<p><span style=\"font-style: italic;\">That is an impressive amount. Could you comment on the larger impact this has, on our economy as a whole?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><strong>SS:<\/strong> There are a lot of people who are concerned that we may end up in a world where this is shutting down access to capital for individuals. Our feeling is just the opposite. Our experience is just the opposite. Women-owned businesses, minority-owned businesses&#8230;we are absolutely there for them.<\/p>\n<p style=\"padding-left: 30px;\">One of the things that distinguishes us in this industry from others is that we do small business rather than consumer lending. There’s a critical distinction there. The small business lenders, we’re lending dollars for hiring people, for increasing your revenue streams, for buying inventory that you are going to sell. Borrowing from our members is intended to show return on investment, that’s why they’re borrowing. This is not to refinance credit card debt. This is not to buy that big flat-screen TV as consumers would tend to do, this is return on investment for the economy, for the American economy.<\/p>\n<p style=\"padding-left: 30px;\">Our research showed that out of that $10 billion that we’d lent between 2015 and 2017, we created about 358,911 jobs nationwide based on those dollars lent. That’s a pretty significant impact. Every dollar that we lent on average produced $2.31 worth of increased sales revenue for our small business borrowers. That’s an incredible value to them, and is improving their lives every day.<\/p>\n<p><span style=\"font-style: italic;\">What do you think that small business owners should understand or know about the regulations that govern this industry?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS<\/span><span style=\"font-weight: bold;\">:<\/span> Small business owners are protected by lending laws, and we are subject to them. Anyone operating with a bank partnership of any kind is also subject to all of the regulations of those financial institutions.<\/p>\n<p style=\"padding-left: 30px;\">There is a significant level of protection here for the small business borrower. There is a difference in sophistication, inclination, desire, and results for small business borrowers versus consumers. The vast majority of consumer online lending is to refinance credit card debts.<\/p>\n<p style=\"padding-left: 30px;\">That makes sense, but it’s consumptive lending. For us, the vast majority of the lending we’re doing like all the lending is to increase the business, solve the problem, increase the revenues, hire people. We’re providing an opportunity to increase growth.<\/p>\n<p style=\"padding-left: 30px;\">That’s an important distinction for us to understand.<\/p>\n<p><span style=\"font-style: italic;\">Turning to the future, <\/span><span style=\"font-style: italic;\">do you have any<\/span><span style=\"font-style: italic;\"> predictions to share about what we’re going to see in this industry in the future<\/span><span style=\"font-style: italic;\">?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS<\/span><span style=\"font-weight: bold;\">:<\/span> I think there’ll be some consolidation in the industry. Some of the experimental algorithms that are not working, or models that don’t make sense, will go away, which will improve the overall marketplace.<\/p>\n<p style=\"padding-left: 30px;\">I think that there’ll also be an increase in automation. You’re going to see more ability to price risk without human engagement of any kind based on all of the data sources available. Those rapid advances in machine learning and artificial intelligence are going to accelerate and continue.<\/p>\n<p style=\"padding-left: 30px;\">Finally, I think you’ll see some of our member companies find a way to either apply for a FinTech charter, apply for an industrial loan charter, or even a full bank charter. I would expect that some companies out there are likely to look a lot more like banks that are technology-driven in the future.<\/p>\n<p style=\"padding-left: 30px;\">I believe banks should be partnering with FinTech firms to capture their agility, their technology, their view to the future, their ability to price risk rapidly. Banks have the same incentive to underwrite a $10,000 that they do $1 million loan. It’s the same process, and it’s manual. There’s a lot of paper passing back and forth, and it goes on for 60 to 90 days.<\/p>\n<p style=\"padding-left: 30px;\">For a small business borrower, that doesn’t make any sense. That cannot work and it cannot operate. They need access to capital in real time. We can function as the technology partner for banks to get access to and serve that marketplace. I expect that we will.<\/p>\n<p><span style=\"font-style: italic;\">Thank you Scott. This has been a really enlightening conversation and we appreciate all the work that you do. This is a really exciting time for our industry.<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">SS<\/span><span style=\"font-weight: bold;\">:<\/span> Yes, thank you. This is an exciting time for small business borrowers. They’re getting the chance to build their businesses at speed and scale that they could not have dreamed of a mere 10 years ago before the ascent of this online lending industry. That is going to accelerate.<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-style: italic;\"><small>This interview has been edited for clarity and length. Header photo by Andrew Haimerl on Unsplash.<\/small><\/span><\/p>\n<p>&nbsp;<\/p>\n<div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Q&amp;A with Scott Stewart, Chief Executive Officer of the ILPA As an executive and leader, Scott Stewart has spent over &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10157,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,10147],"yst_prominent_words":[2488,723,9840,9830,9835,9841,9836,9831,9829,9842,9832,9837,712,9834,5062,9497,9833,9839,9838],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"A View into the Future with ILPA&#039;s Scott Stewart | Fundbox Blog","yoast_meta":[{"name":"description","content":"Scott Stewart serves as the CEO of the Innovative Lending Platform Association, representing online business lending and financial firms. Fundbox recently became a proud member. To mark this milestone, we chatted with Scott about the role of the ILPA, and to learn from his industry insights and unique vantage point."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"A View into the Future with ILPA&#039;s Scott Stewart | Fundbox Blog"},{"property":"og:description","content":"Scott Stewart serves as the CEO of the Innovative Lending Platform Association, representing online business lending and financial firms. Fundbox recently became a proud member. To mark this milestone, we chatted with Scott about the role of the ILPA, and to learn from his industry insights and unique vantage point."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/a-view-into-the-future-with-ilpas-scott-stewart\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/11\/andrew-haimerl-597716-unsplash.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/11\/andrew-haimerl-597716-unsplash.jpg"},{"property":"og:image:width","content":"1200"},{"property":"og:image:height","content":"675"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Scott Stewart serves as the CEO of the Innovative Lending Platform Association, representing online business lending and financial firms. Fundbox recently became a proud member. To mark this milestone, we chatted with Scott about the role of the ILPA, and to learn from his industry insights and unique vantage point."},{"name":"twitter:title","content":"A View into the Future with ILPA&#039;s Scott Stewart | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/11\/andrew-haimerl-597716-unsplash.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/a-view-into-the-future-with-ilpas-scott-stewart\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10154"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10154"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10154\/revisions"}],"predecessor-version":[{"id":10201,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10154\/revisions\/10201"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10157"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10154"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}