{"id":10214,"date":"2018-12-19T08:20:00","date_gmt":"2018-12-19T16:20:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10214"},"modified":"2022-06-24T08:03:30","modified_gmt":"2022-06-24T15:03:30","slug":"humans-fundbox-gibson-holland","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/","title":{"rendered":"Humans of Fundbox: Gibson Holland"},"content":{"rendered":"<p>In our new series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company.<\/p>\n<p>This month, we sat down with Gibson Holland, Sync Support Manager in the San Francisco office. Since joining the company in February 2018, Gibson has taken on a number of different roles, in a relentless quest to help improve the Fundbox customer experience by any means available, and some he had to invent.<\/p>\n<p>In a candid conversation with our head of internal communications, Tim Donovan, Gibson shares his enthusiasm for his unique role, for helping small business customers, and for bringing his authentic self to work.<\/p>\n<figure style=\"width: 500px\" class=\"wp-caption aligncenter\"><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/12\/5ed62644-036b-4720-9d1a-0a50a4cd38dc_Gibson.png\" alt=\"Gibson Holland, Sync Support lead at Fundbox\" width=\"500\" \/><figcaption class=\"wp-caption-text\"><em>Gibson Holland, Sync Support Manager at Fundbox<\/em><\/figcaption><\/figure>\n<h3>Tim Donovan: Hi Gibson! Tell us a bit about yourself and your background.<\/h3>\n<p><span style=\"font-weight: bold;\">Gibson Holland:<\/span> I took a little bit of a roundabout way, getting here. In college, I majored in history and French. To my chagrin, I didn&#8217;t end up using either of those afterward. I went into brewing after college, which was a lot of fun, but I definitely needed a change of pace after doing that for about three years.<\/p>\n<h3>What’s your role at Fundbox?<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>At Fundbox, I’m in charge of troubleshooting our connections to customer data sources. Fundbox gets data for conducting risk assessments by either connecting to an accounting software or to a business checking account. It&#8217;s my job to make sure that those connections are as reliable and smooth as possible.<\/p>\n<p>If any errors do occur, I&#8217;m there to diagnose the issues, work with the customers, and work with our engineering team to try to implement an immediate fix while we solve these issues going forward, so that less of them are causing friction for our customers in the future.<\/p>\n<blockquote><p>I get to wear a lot of hats. I think one of my favorite aspects of the role is that no one day is really ever the same for me.<\/p><\/blockquote>\n<h3>That&#8217;s an interesting role. It sounds like a hybrid role, between sales support, engineering, product management.<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>Yes, I get to wear a lot of hats. I think one of my favorite aspects of the role is that no one day is really ever the same for me. There&#8217;s no telling what fun new bug or issue is going to pop up that day.<\/p>\n<p>Because I work with so many teams, it’s a lot of work to prioritize everyone&#8217;s different needs and be attentive to what everyone else needs (meaning our engineers, our sales reps, our collection agents, and our customers). I need to think about what all of their priorities are and keep in mind the different projects that everyone is working on internally.<\/p>\n<p>It is a lot of fun and I definitely have to keep myself very organized in order to make progress. It’s a really cool role.<\/p>\n<h3>There are a lot of organizations where employees try but never really feel they are able to significantly affect the way the company does business. In your case, that&#8217;s not true! Are you surprised that you can have the kind of impact that you do?<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>That’s a really great question. I think that really touches on one of the reasons that I love Fundbox. One of my biggest complaints about past workplaces was they were stagnant. There was very little desire to try to find a better way forward.<\/p>\n<p>I joined Fundbox as part of Customer Support. Occasionally, I noticed a bug here or something that was causing friction there. Thankfully, I also found some good mentors at the company and their initial response was, &#8220;Okay, you found something that may be an issue. Build a case, and let’s see where that goes.&#8221;<\/p>\n<p>This reaction felt novel and refreshing to me.<\/p>\n<p>While I was in Customer Support, I had the opportunity to teach myself SQL, which is a query language, and start diving into more technical aspects of our products while I was building these cases for particular product changes. That was really rejuvenating, I think, being in Customer Support. I’m not at the top of the company, but my ideas, if I could articulate them well, were always heard.<\/p>\n<p>That is really, in my work experience, unique to Fundbox. That keeps me engaged and wanting to look for better ways of working.<\/p>\n<p>I think that’s really important for companies in general: don’t stymie those who were trying to better themselves and the company, fuel that instead! I do feel supported and encouraged to keep trying to identify issues and make things better.<\/p>\n<blockquote><p>My ideas, if I could articulate them well, were always heard. That is really, in my work experience, unique to Fundbox. That keeps me engaged and wanting to look for better ways of working.<\/p><\/blockquote>\n<h3>We’re excited that you&#8217;re excited! It&#8217;s always great to join a company and get pleasantly surprised by the fact that you can do more than what was originally in your job description.<\/h3>\n<h3>You mentioned your time in customer support. Can you talk a little bit about the customers you serve?<\/h3>\n<h3><span style=\"font-weight: bold;\">GH<\/span><span style=\"font-weight: bold;\">:<\/span> The customers are all small to medium-sized business owners. We&#8217;re not dealing with Fortune 500 companies. For the most part, it&#8217;s people who have invested their whole working lives into their business. I&#8217;ve had the pleasure of talking on the phone with our customers on a daily basis, and occasionally meeting them face to face in the office.<\/h3>\n<p>I&#8217;m always impressed by how much our customers are juggling at any one point in time. Our small business owners are relying on us to make their lives and business operations easier. We work with everyone from a trucking company to a bakery or an IT startup or a marketing firm. Everyone across America, across all industries, has the same need for what Fundbox is offering.<\/p>\n<h3>You are really empathetic to the needs of small business owners. In your opinion, do your colleagues share that empathy? How important do you think empathy is in today&#8217;s business world, in general?<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>In my experience, I really think empathy is one of the most important qualities that anyone should try to develop. It&#8217;s not something that you either have or you don&#8217;t—you can develop it. I think you should always try to see someone else&#8217;s experience.<\/p>\n<p>I know how large of an impact small business owners have on their community. That&#8217;s why I came here, not only because I wanted to further my career and get into tech, but because I wanted to do something worthwhile that I knew had a big positive impact.<\/p>\n<p>My best friends are small business owners and I think about them on a day-to-day basis when I&#8217;m doing my job.<\/p>\n<p>So, do I think others at the company share that empathy? I think yes, they do. In my job interview, I asked the head of Sales what some of his most proud moments had been at Fundbox. He told me about a customer who suffered heavy losses during the 2008 financial downturn, and how Fundbox really helped him get his business back up to the level of production that he wanted to be operating at. The capital this customer accessed through Fundbox helped save his business.<\/p>\n<p>Stories like that drew me to this place and are what make it all worthwhile. I think there are a lot of people here who are in this for the right reason which is empowering our small business owner customers.<\/p>\n<blockquote><p>I think there are a lot of people here who are in this for the right reason: empowering our small business owner customers.<\/p><\/blockquote>\n<h3>Let&#8217;s switch gears a little bit and talk about culture. This company was founded in Tel Aviv, and we’re bi-cultural with offices there and in San Francisco. Do you have any thoughts about what it’s like to be bi-cultural?<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>In my previous work environment, there was not a whole lot of diversity. I love working in a multicultural environment simply because you have more fun conversations with people. Not everyone thinks or works the same way or prioritizes different work topics the same way. That really pushes us to communicate more effectively, because our way of doing things or thinking or working is not always the right way, it&#8217;s just the one that we’re used to.<\/p>\n<p>A lot of my colleagues are from the Tel Aviv office. They are often very direct in how they express themselves, which I honestly love. It&#8217;s little difference like that that keep you learning and make you realize that your previous way of doing things is not the only way.<\/p>\n<h3>How important is it that a company have a social mission?<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>I think it&#8217;s very important because while companies should be productive and make money, I think that if you&#8217;re not doing all of that for a reason that is bigger than yourself, then work feels really hollow. That&#8217;s not what I&#8217;d like to wake up and feel every day. I think you have to be growing for a purpose.<\/p>\n<p>It goes both ways. That social mission is motivating you to show up to work and to put in your best each day, but it also guides you in the right direction and make sure that you&#8217;re growing ethically and for the right reasons so that you&#8217;re not just going to say, &#8220;Okay, this is going to expand our customer base if we do this.&#8221; Instead, you ask, &#8220;Okay, is this potential decision smart and harmonious with our values?&#8221;<\/p>\n<p>Being authentic and questioning yourself, both as an individual worker and as a business, is important. Just make sure that you&#8217;re honest and you don&#8217;t lose sight of why you started something in the first place.<\/p>\n<h3>For people that are considering joining Fundbox, is there any advice you want to share with them?<\/h3>\n<p><span style=\"font-weight: bold;\">GH: <\/span>Yes! My advice is to come in wanting to learn and get better. This isn&#8217;t a place where you&#8217;re just going to be a cog and come in to fill the role you applied for. It&#8217;s a company that wants you to come in and really be a part of the larger mission. Whether you&#8217;re hired for a marketing role or a sales position or business development, engineering, customer support, whatever it might be, you have a lot more to offer. This company wants you to know that about yourself.<\/p>\n<p>Fundbox has also been supportive for me to do online coding courses and further my career interests that don&#8217;t necessarily have any impact on my role right now, but are preparing me for something else in a few months. I know Fundbox wants me to grow and keep trying to bring my best every day. That&#8217;s the best I could ask for from an employer.<\/p>\n<p>&nbsp;<\/p>\n<div>\n<h3><em>Want to work with Gibson and Tim at Fundbox? <a href=\"https:\/\/fundbox.com\/careers\/?utm_source=fundbox&amp;utm_medium=blog&amp;utm_campaign=humans\">Check out our Careers page<\/a>.<\/em><\/h3>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>In our new series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10220,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,326],"yst_prominent_words":[723,9944,719,5666,9942,9936,9937,838,11448,11446,11445,11449,11447,712,9943,709,11450,9934,9938,9935],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Humans of Fundbox: Gibson Holland | Fundbox Blog","yoast_meta":[{"name":"description","content":"In our new series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. This month, we sat down with Gibson Holland, Sync Support Manager in the San Francisco office. Since joining the company in February 2018, Gibson has taken on a number of different roles, in"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Humans of Fundbox: Gibson Holland | Fundbox Blog"},{"property":"og:description","content":"In our new series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. This month, we sat down with Gibson Holland, Sync Support Manager in the San Francisco office. Since joining the company in February 2018, Gibson has taken on a number of different roles, in"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/12\/shutterstock_653330692.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/12\/shutterstock_653330692.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In our new series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. This month, we sat down with Gibson Holland, Sync Support Manager in the San Francisco office. Since joining the company in February 2018, Gibson has taken on a number of different roles, in"},{"name":"twitter:title","content":"Humans of Fundbox: Gibson Holland | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/12\/shutterstock_653330692.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10214"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10214"}],"version-history":[{"count":11,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10214\/revisions"}],"predecessor-version":[{"id":16261,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10214\/revisions\/16261"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10220"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10214"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10214"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10214"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10214"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}