{"id":10256,"date":"2019-01-03T07:54:00","date_gmt":"2019-01-03T15:54:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10256"},"modified":"2020-11-03T15:17:34","modified_gmt":"2020-11-03T23:17:34","slug":"ex-army-ceo-radically-expanded-business-3-years-fundbox","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/ex-army-ceo-radically-expanded-business-3-years-fundbox\/","title":{"rendered":"This Ex-Army CEO Radically Expanded His Business in 3 Years With Fundbox"},"content":{"rendered":"<p>J. Alan Fagan is well-acquainted with finding success in tough situations. A former Arabic linguist and United States Army veteran, Fagan is now a small business owner, the founder and Chief Executive Officer of the Mattox Group. His California-based consulting firm is focused on business development, tax, accounting, human resources, and staffing solutions for small and medium-sized businesses and nonprofits.<\/p>\n<p>Fagan says their mission is to use his experience to empower those businesses and, in so doing, better the world. He keeps that mission in his mind every day, as he hires and trains new employees, and brainstorms ways to continually grow his business and improve as a leader.<\/p>\n<figure id=\"attachment_10260\" aria-describedby=\"caption-attachment-10260\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10260\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/J-Fagen-headshot.jpg\" alt=\"J. Alan Fagan, founder and Chief Executive Officer of the Mattox Group. Photo: Michael Troutman\" width=\"500\" height=\"333\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/J-Fagen-headshot.jpg 800w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/J-Fagen-headshot-768x511.jpg 768w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><figcaption id=\"caption-attachment-10260\" class=\"wp-caption-text\"><em>J. Alan Fagan, founder and Chief Executive Officer of the Mattox Group. Photo: Michael Troutman<\/em><\/figcaption><\/figure>\n<h2>Rough beginnings during the Great Recession<\/h2>\n<p>Not everyone is able to keep such soaring goals top of mind every day, but for Fagan, having a grand mission seems to have helped him stay focused and confident, even during the toughest moments for his family and his business.<\/p>\n<p>“We got through the recession—barely,” he recalls. “We started our business in January, then my wife and I closed on our first home in September of 2008, which we still thankfully have. Two weeks later, the banks collapsed. A month after that, our largest clients went bankrupt. 2009 was an interesting year. 2010 was a year to rebuild.”<\/p>\n<p>Since then, the Mattox Group has grown steadily. Business really picked up after a turning point three years ago, when Fagan decided, in his words, to “get serious about turning it from a job into a business.”<\/p>\n<p>After his years in the army, he wasn’t interested in a typical job working for someone else: “The normal nine-to-five routine wasn’t appealing to me. Now, 10 years later, I still don’t like it! I started my business to have control over what I wanted to do in the world.”<\/p>\n<blockquote><p>&#8220;The normal nine-to-five routine wasn’t appealing to me. &#8230;I started my business to have control over what I wanted to do in the world.”<\/p><\/blockquote>\n<p>His vision and hard work have begun to pay off in the form of steady clients and financial success. “This year,” he says, “we’re looking at close out the year with about half a million in gross revenue, and next year we have recurrent contracts already signed for close to three-quarters before we even start the year.”<\/p>\n<h2>Key post-recession lessons<\/h2>\n<p>Coming out of a major recession successfully taught Fagan a few important things about growing a business, as well as surviving economic downturns.<\/p>\n<p>One of the biggest takeaways, he says, is that business is not always as expensive as he once thought, especially when it comes to hiring help.<\/p>\n<p>“Certainly, business is costly,” Fagan clarifies, “but I’d had an irrational fear that employees would be a drain rather than a value-add. Changing that [mindset] was a big shift. My second daily concern was that my employees wouldn’t do things the way I had built my reputation to do them, they wouldn’t be a part of our culture and the way we work with our clients.”<\/p>\n<p>He overcame these fears with the help of his business mentors, and his study of servant-based leadership. “Servant leadership” is a concept coined by the businessman and author <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.greenleaf.org\/\">Robert K. Greenleaf<\/a><\/span>, built on the idea that a leader’s most important job is to serve others. Considering this concept led Fagan to start developing a more mission-driven culture at work, and changed his attitudes about recruiting.<\/p>\n<figure id=\"attachment_10259\" aria-describedby=\"caption-attachment-10259\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10259\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/TMG-Fagen-team-photo.jpg\" alt=\"J. Alan Fagan, founder and CEO of The Mattox Group, with his team members.\" width=\"500\" height=\"333\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/TMG-Fagen-team-photo.jpg 800w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/TMG-Fagen-team-photo-768x512.jpg 768w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><figcaption id=\"caption-attachment-10259\" class=\"wp-caption-text\"><em>J. Alan Fagan, founder and CEO of The Mattox Group, with his team members.<\/em><\/figcaption><\/figure>\n<p>“I learned about developing that culture beyond just yourself,” he explains. “I started recruiting talent to fill, not just job requirements, but to fill roles and skills that we needed but didn’t have in the company yet. With that came more than enough revenue to cover them.”<\/p>\n<p>The second big takeaway that Fagan got from his early years in business was the need to be “recession proof.”<\/p>\n<p>“Because of the lessons we learned during the recession,” he says, “we now try to be recession-proof and not box ourselves into a niche that won’t survive the next economic downturn. To do that, we expanded our services and established a staffing division, two years ago.”<\/p>\n<p>Since the Mattox Group was already serving small business clients with tax and accounting services, they had an insider’s perspective on the additional needs of those businesses. Fagan was able to see firsthand how often his clients struggled with recruiting for both temporary and permanent positions. Often, these clients lacked recruiting and staffing expertise, but also lacked the funds to hire executive headhunters to provide assistance.<\/p>\n<p>After studying enough of his small business and nonprofit customers, Fagan saw a market need and a growth opportunity.<\/p>\n<p>“We already had an engagement with [these clients], and this was a nice opportunity to add value,” he says. “We’re also involved in the veteran community. We recognized there was a need for veterans and military spouses to find gainful employment. We connected these needs.”<\/p>\n<h2>Funding a new expansion with Fundbox<\/h2>\n<p>When it came to funding the expansion, Fagan called on Fundbox.<\/p>\n<p>“This is one reason I fell in love with Fundbox,” he says. “Fundbox has have been a lifesaver because they understood a temporary staffing agency. The banks don’t really want to come out and take a risk on that.”<\/p>\n<p>While major banks typically require a lengthy process and years of business paperwork and proof of revenue or collateral in order to extend a business loan or <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/resources\/guides\/lines-credit\/\">business line of credit<\/a><\/span>, Fundbox users can be approved without paperwork, on the basis of business data such as QuickBooks records or a business checking account. The Fundbox integration with QuickBooks was initially what got Fagan’s attention.<\/p>\n<p>Though he wasn’t ready for funding yet, he says, he was thinking about what he’d need in the future.<\/p>\n<p>“I found out about Fundbox at <span style=\"text-decoration: underline;\"><a href=\"https:\/\/quickbooksconnect.com\/\">QuickBooks Connect<\/a><\/span> three years ago,” he remembers. “At the time, I was looking for a traditional bank line of credit, because of [my plan for] the new staffing division. I knew I would have to have the cash to make that happen. There was a greater return on investment to start the division rather than wait until we could self-finance it. I think that’s why anybody looks for a traditional line of credit.”<\/p>\n<p>Fundbox was exhibiting at the event, and after meeting the Fundbox team in person, Fagan decided to apply. He was quickly approved for a credit line and started using the funds.<\/p>\n<blockquote><p>“Our partnership with Fundbox has allowed us to start and grow this division. It went from an idea two years ago, to hundreds of thousands of dollars in revenue in these first four years. I’m really pleased.”<\/p><\/blockquote>\n<p>“That little seed was huge. It got us started,” he says. “Our partnership with Fundbox has allowed us to start and grow this division. It went from an idea two years ago, to hundreds of thousands of dollars in revenue in these first four years. I’m really pleased.”<\/p>\n<p>In the years he has worked with Fundbox, his credit line has increased as he built a track record of business success and paying on time. Currently, his line of credit is more than five times what it was when he was first approved. “I could always use more,” he chuckles, “but it’s growing at just about the right pace.”<\/p>\n<p>Looking ahead, he is optimistic about the potential for his business to keep growing: “Now we’ve grown a bit with Fundbox, and it’s allowed us to grow the number of staffing associates that we manage. We’re looking forward to exciting things in 2019.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>J. Alan Fagan is well-acquainted with finding success in tough situations. A former Arabic linguist and United States Army veteran, &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10262,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504],"yst_prominent_words":[9999,10005,723,9843,9992,9985,9996,9994,9991,838,10003,1529,9986,10035,9995,9993,10001,10002,10000,10036],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"This Ex-Army CEO Radically Expanded His Business in 3 Years With Fundbox | Fundbox Blog","yoast_meta":[{"name":"description","content":"J. Alan Fagan is well-acquainted with finding success in tough situations. A former Arabic linguist and United States Army veteran, Fagan is now a small business owner, the founder and Chief Executive Officer of the Mattox Group. His California-based consulting firm is focused on business development, tax,"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"This Ex-Army CEO Radically Expanded His Business in 3 Years With Fundbox | Fundbox Blog"},{"property":"og:description","content":"J. Alan Fagan is well-acquainted with finding success in tough situations. A former Arabic linguist and United States Army veteran, Fagan is now a small business owner, the founder and Chief Executive Officer of the Mattox Group. His California-based consulting firm is focused on business development, tax,"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/ex-army-ceo-radically-expanded-business-3-years-fundbox\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/shutterstock_1141112222.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/shutterstock_1141112222.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"J. Alan Fagan is well-acquainted with finding success in tough situations. A former Arabic linguist and United States Army veteran, Fagan is now a small business owner, the founder and Chief Executive Officer of the Mattox Group. His California-based consulting firm is focused on business development, tax,"},{"name":"twitter:title","content":"This Ex-Army CEO Radically Expanded His Business in 3 Years With Fundbox | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/shutterstock_1141112222.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/ex-army-ceo-radically-expanded-business-3-years-fundbox\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10256"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10256"}],"version-history":[{"count":7,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10256\/revisions"}],"predecessor-version":[{"id":13901,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10256\/revisions\/13901"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10262"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10256"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10256"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10256"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10256"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}