{"id":10320,"date":"2019-01-15T08:18:00","date_gmt":"2019-01-15T16:18:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10320"},"modified":"2020-11-10T11:54:15","modified_gmt":"2020-11-10T19:54:15","slug":"humans-fundbox-emad-elshawa","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/","title":{"rendered":"Humans of Fundbox: Emad ElShawa"},"content":{"rendered":"<p>In our Q&amp;A series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company.<\/p>\n<p>This month, we’re shining the spotlight on Emad ElShawa, Business Operations Manager at Fundbox. Based in Fundbox’s San Francisco office, Emad works cross-functionally to help improve risk and sales processes, while staying close to customer feedback and needs.<\/p>\n<p>One way he stays so close to the daily concerns of today’s small business owners is that he is one, too. In addition to his full-time job at Fundbox, he also helps manage his family business, the famous Sam’s Burgers in San Francisco’s North Beach neighborhood. In this Q&amp;A, he looks back at his lifelong fascination with money and finance, and reflects on valuable small business lessons from a lifetime in the restaurant business.<\/p>\n<figure id=\"attachment_10324\" aria-describedby=\"caption-attachment-10324\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10324\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/Tampa-Bay-Buc-QB-Jameis-Winston-and-Emad.jpg\" alt=\"Emad ElShawa and Former Heisman Trophy Winner and current Tampa Bay Bucs QB, Jameis Winston at Sam's in 2018.\" width=\"500\" height=\"433\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/Tampa-Bay-Buc-QB-Jameis-Winston-and-Emad.jpg 1080w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/Tampa-Bay-Buc-QB-Jameis-Winston-and-Emad-768x665.jpg 768w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><figcaption id=\"caption-attachment-10324\" class=\"wp-caption-text\"><em>Emad ElShawa and Former Heisman Trophy Winner and Tampa Bay Bucs Quarterback, Jameis Winston at Sam&#8217;s restaurant in 2018.<\/em><\/figcaption><\/figure>\n<h3>Fundbox: Tell me about your background and role at Fundbox.<\/h3>\n<p><span style=\"font-weight: bold;\">Emad ElShawa<\/span><span style=\"font-weight: bold;\">:<\/span> I am a Business Operations Manager at Fundbox. I view my position at Fundbox as that of a generalist: I get to work with almost everyone at our company to accomplish broad strategic goals. That can mean working with our Risk team to improve our policy, informing our sales processes, or analyzing how valuable particular initiatives are for our customers.<\/p>\n<p>I also currently manage both our Collections and Account Management teams. I have my hands in a lot of different things!<\/p>\n<p>Prior to joining Fundbox, I spent almost 11 years working directly with small businesses in a variety of leadership positions at large traditional financial services organizations. Think of the banks where you might have your personal checking account.<\/p>\n<h3>Where did you grow up? Did you always know you wanted to work in finance or technology, or did you discover that along the way?<\/h3>\n<p><span style=\"font-weight: bold;\">EE:<\/span> I am a native San Franciscan, born and raised&#8230;pretty rare! My parents originally migrated from Palestine in 1964. I got my Bachelors degree in Business Administration  from San Francisco State University, with a concentration in Marketing and Finance.<\/p>\n<p>Money has always been an interesting concept to me. I enjoy learning about the financial markets and the effect they can have on everyday consumers and small businesses.<\/p>\n<p>When I was younger, I was also shocked at how little people tend to educate themselves about financial topics. I thought about the easiest way I could contribute to expanding financial literacy among regular people and small business owners. During and after college, I worked for two of the largest financial services companies in the world, during the worst of the financial crises in history. I loved working with people to provide financial solutions to everyday issues and goals, but the solutions were often “one-size-fits-all” and only served a very small part of the market.<\/p>\n<p>Big banks tend to lend to the most qualified customers only, leaving a significant portion of the community underserved, especially after the financial crises. That’s when I began learning about fintech (financial technology).<\/p>\n<p>The more I learned about how companies like Fundbox leverage data and technology to serve a traditionally underserved segment of the population, the more it became clear to me, the impact Fundbox could have on a huge portion of the business community. I feel very fortunate to have the opportunity to contribute, in my own little way, on making things just a bit easier for everyday people.<\/p>\n<blockquote><p>I feel very fortunate to have the opportunity to contribute, in my own little way, on making things just a bit easier for everyday people.<\/p><\/blockquote>\n<h3>What do you find most interesting about your job? How does your work help small business owners?<\/h3>\n<p><span style=\"font-weight: bold;\">EE:<\/span> Fundbox is a uniquely positioned company in a uniquely positioned industry. I truly believe our work here makes a difference. I’ve spoken to thousands of business owners throughout my career, and nowhere else have I seen the direct, measurable, impact that Fundbox has on small businesses.<\/p>\n<p>The basic difference I have always seen between Fundbox and traditional lenders is our core focus. Our goal has never been to sell a product, but rather to provide a solution to a specific problem. Everything our team talks about on a daily basis revolves around improving the process of how small business owners pay and get paid. That aligns our success with that of our customers.<\/p>\n<p>My job allows me the unique privilege of both providing a voice and having a voice. Through our interactions with customers, whether that’s through my team’s conversations or my own, I get direct feedback on where we are getting it right and where we can improve. Unlike at other companies, I get to act on that feedback directly. That’s pretty cool.<\/p>\n<h3>You have some direct small business experience. Can you talk about how that informs your work at Fundbox?<\/h3>\n<p><span style=\"font-weight: bold;\">EE:<\/span> My family owns <span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.samsonbroadway.com\">Sam’s Burgers<\/a><\/span> in the North Beach of San Francisco. My father opened Sam’s almost 53 years ago, in 1966, and ran it until his passing in 2016. Our father poured his heart and soul into building this business. He worked 7 days a week, 365 days a year.<\/p>\n<p>His work ethic rubbed off on us, which I think was his plan. Since the beginning, my family and I have tried to honor what he has built in the best way we know how, by trying to carry on his legacy and maintaining the business over the past 50 years. All of us had the privilege of working in the store at some point or another, even as we all pursued different career paths.<\/p>\n<p>My father thought it was important for us to understand the entire business, so we did it all: waited tables, cooked, and helped manage the business side. No job is embarrassing when running a small business, as long as you do it honorably every time. We were lucky, imagine being able to learn any skill from someone who’s done it successfully for 50 years.<\/p>\n<p>As someone who manages a small business on a daily basis, my work at Fundbox has a special significance for me. It’s easy for a company like Fundbox to define what SMBs are struggling with based on data and numbers, but there are so many factors that can’t be measured that way. In order for Fundbox to truly make it easier for SMBs to do business, we need to put ourselves in small business owners’ shoes. It’s important for us to consider everything we do from the customer point of view.<\/p>\n<p>Restaurants like Sam’s are the businesses that Fundbox aims to help. Having that context allows me to view everything—from features of a certain product, to how we communicate with customers—through a different lens, and I get to share that perspective with my colleagues.<\/p>\n<figure id=\"attachment_10325\" aria-describedby=\"caption-attachment-10325\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10325\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/Sam-ElShawa.jpg\" alt=\"Mike &quot;Sam&quot; ElShawa (restaurant owner and Emad's dad) at Sam's in 1985.\" width=\"500\" height=\"392\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/Sam-ElShawa.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/Sam-ElShawa-768x602.jpg 768w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><figcaption id=\"caption-attachment-10325\" class=\"wp-caption-text\"><em>Mike &#8220;Sam&#8221; ElShawa (restaurant owner and Emad&#8217;s dad) at Sam&#8217;s in 1985. This snapshot was taken by a customer.<\/em><\/figcaption><\/figure>\n<h3>Why do you believe it’s so hard to be a small business owner?<\/h3>\n<p><span style=\"font-weight: bold;\">EE:<\/span> Running a successful small business has nothing to do with what you actually <span style=\"font-style: italic;\">do<\/span>! I’ll explain what I mean by that. Just because you make a great burger, doesn’t mean you will run a successful burger restaurant.<\/p>\n<p>Often times, your great execution is hindered by variables that are completely out of your control, and there’s a lot of them. Things like the economy, supply chain logistics, the weather, your competitors, your employees, your customers, and laws and regulations will all have a direct daily impact on your performance.<\/p>\n<p>The difference between SMBs and larger businesses is that, for an SMB, the margin for  error is so small, it’s almost non-existent. In other words, you can’t afford to make a mistake. Unfortunate events can severely injure a business and be extremely hard to recover from. When things that are out of your control carry so much weight, you need to work ten times harder to prepare for those events, placing you at a constant disadvantage and shifting focus away from your core competency and why you actually started the business in the first place.<\/p>\n<p>My advice to business owners is to look for small wins. That, in turn, will inform your understanding of your overall business health.<\/p>\n<h3>From your experience doing all those jobs to operate your family business, what’s your best advice to other small business owners?<\/h3>\n<p><span style=\"font-weight: bold;\">EE:<\/span> My father always stressed three core principles. These principles were crucial to his 50 years of business success. They are:<\/p>\n<p><span style=\"font-weight: bold;\">First: <\/span><span style=\"font-weight: bold;\">Be Kind.<\/span> This may not be a mind-blowing concept, but it is severely underrated. You&#8217;re sure to spend a large amount of time dealing with customers, vendors, and yes, even lenders. How you treat people will vastly affect how easy, or hard, you make things on yourself and on your business.<\/p>\n<p><span style=\"font-weight: bold;\">Second: <\/span><span style=\"font-weight: bold;\">Keep it simple and focus on your core competency.<\/span> It’s important to keep innovating and evolving as a business, but never shift focus from what you’re great at and keep that at the center of everything you do. If you’re great at making burgers, make sure every last burger is the best burger you can make. Everything else should come second.<\/p>\n<p><span style=\"font-weight: bold;\">Third: Right-size your definition of success.<\/span> Success is the sum of small efforts every day. SMBs tend to tie success to a binary concept: “I will either succeed or I won’t.” They often define “success” by X amount of money, or X number of employees.<\/p>\n<p>That isn’t how I look at success. Instead, my advice is to look for small wins. That, in turn, will inform your understanding of your overall business health.<\/p>\n<p>Remember that small businesses inherently have the chips stacked against them. Whether you’re a new business or you’ve been in business for 50 years, you’re constantly working from behind.<\/p>\n<p>With all that said, you should view your success as a simple equation, that is, you should break it down into problems and solutions. Solve the problem that will have the biggest impact on your business first, and then the next, and then the next, and if you solve enough problems, you will, by default put yourself in a position to succeed.<\/p>\n<p>If ever your confidence starts to falter and you feel trapped or exhausted, you are likely to need something larger than you or your business to give you the confidence you need to take that final step. Look back at your passion—the underlying reason you started your business in the first place. That will help you keep going.<\/p>\n<p>For me, that passion has always been to maintain what my father worked so hard to build, so whenever I’m wavering, I think of what my father had to go through to succeed and that pushes me forward.<\/p>\n<p>&nbsp;<\/p>\n<h3><span style=\"font-style: italic;\">Want to work with Emad at Fundbox? <\/span><span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/fundbox.com\/careers\/?utm_source=fundbox&amp;utm_medium=blog&amp;utm_campaign=humans\">Check out our Careers page<\/a><\/span><span style=\"font-style: italic;\">.<\/span><\/h3>\n","protected":false},"excerpt":{"rendered":"<p>In our Q&amp;A series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10322,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,326],"yst_prominent_words":[723,10090,10085,10083,719,11444,10086,10094,978,838,10092,10088,10084,10095,2355,712,709,1126,3090,10089],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"Humans of Fundbox: Emad ElShawa | Fundbox Blog","yoast_meta":[{"name":"description","content":"In our Q&amp;A series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. This month, we’re shining the spotlight on Emad ElShawa, Business Operations Manager at Fundbox. Based in Fundbox’s San Francisco office, Emad works cross-functionally to help improve"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Humans of Fundbox: Emad ElShawa | Fundbox Blog"},{"property":"og:description","content":"In our Q&amp;A series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. This month, we’re shining the spotlight on Emad ElShawa, Business Operations Manager at Fundbox. Based in Fundbox’s San Francisco office, Emad works cross-functionally to help improve"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/shutterstock_1028168668.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/shutterstock_1028168668.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In our Q&amp;A series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. This month, we’re shining the spotlight on Emad ElShawa, Business Operations Manager at Fundbox. Based in Fundbox’s San Francisco office, Emad works cross-functionally to help improve"},{"name":"twitter:title","content":"Humans of Fundbox: Emad ElShawa | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/01\/shutterstock_1028168668.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10320"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10320"}],"version-history":[{"count":11,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10320\/revisions"}],"predecessor-version":[{"id":14164,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10320\/revisions\/14164"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10322"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10320"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10320"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10320"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10320"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}