{"id":10435,"date":"2019-02-07T07:58:00","date_gmt":"2019-02-07T15:58:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10435"},"modified":"2022-06-24T13:23:34","modified_gmt":"2022-06-24T20:23:34","slug":"authentically-celebrate-diversity-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/authentically-celebrate-diversity-business\/","title":{"rendered":"How to Authentically Celebrate Diversity in Your Business"},"content":{"rendered":"<h2>4 experts explain how to go beyond lip service and create a truly inclusive workplace.<\/h2>\n<p>An organization says it “supports diversity”—but has a homogeneous staff.<\/p>\n<p>A company claims it “advances women”—but pays its female leaders less.<\/p>\n<p>We’ve all seen it before: businesses that pay lip service to the ideas of diversity and inclusion, without really making a difference. Call it “pink-washing” or “rainbow-washing,” call it whatever you like. The point is, it’s not good enough.<\/p>\n<p>So how can you truly celebrate diversity? And why does it matter? We talked to four business leaders about the value of diversity—and also got their tips for creating a vibrant and inclusive workplace.<\/p>\n<h2>Why does diversity matter?<\/h2>\n<p>If you’re reading this article, you probably already know diversity’s important. But if you need the numbers behind the impact, consider McKinsey’s report on <a href=\"https:\/\/www.mckinsey.com\/business-functions\/organization\/our-insights\/why-diversity-matters\">why diversity matters<\/a>.<\/p>\n<p>Among its most salient points were these two figures:<\/p>\n<ul>\n<li>When compared to national industry medians, companies with the most racial and ethnic diversity were 35% more likely to have higher returns—and companies with the most gender diversity were 15% more likely.<\/li>\n<li>For every 10% increase in racial and ethnic diversity among senior executives, company earnings rise 0.8%.<\/li>\n<\/ul>\n<p>Although correlation doesn’t equal causation, the evidence does suggest that companies who commit to diverse leadership are more successful.<\/p>\n<p>“More diverse companies, we believe, are better able to win top talent and improve their customer orientation, employee satisfaction, and decision making, and all that leads to a virtuous cycle of increasing returns,” states McKinsey.<\/p>\n<p>In agreement is Stefan Kollenberg, co-founder and chief marketing officer of Crescendo, which offers a <a href=\"https:\/\/getcrescendo.co\/workplace-inclusion-blog\/2018\/10\/9\/shared-diversity-inclusion-strategies-resources\">diversity and inclusion training<\/a> tool. He cited the McKinsey report and also offered additional insight in a recent conversation.<\/p>\n<p>“What really allows diverse workforces to thrive is when they feel like they’re accepted and appreciated at work,” he explains. “This feeling empowers employees to share their different — and potentially conflicting — opinions, leading to better group problem solving, more innovative products and larger profits.”<\/p>\n<p>Anuja Ketan is co-founder and chief technology officer of <a href=\"https:\/\/www.newtonx.com\/\">NewtonX<\/a>. Her company, an AI-powered expert knowledge platform, has embraced diversity since its launch. She says pandering to diversity doesn’t work, and highlights <a href=\"http:\/\/time.com\/4814714\/uber-diversity-sexism-kalanick-report\/\">Uber<\/a> and <a href=\"https:\/\/www.newyorker.com\/magazine\/2017\/11\/20\/the-tech-industrys-gender-discrimination-problem\">Tesla<\/a> as cautionary tales.<\/p>\n<p>“If you go through the motions of hiring without emphasizing diversity, you will end up reproducing the bias of your industry,” she says. And once your company grows, she notes that could “severely impact your public perception” — which, in turn, will affect your bottom line.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/c62b07c7-2fc9-45e0-9511-9877a84c4de8_Stefan20Kollenberg20on20diversity.png\" alt=\"\" \/><\/p>\n<h2>Start with your team<\/h2>\n<p>When it comes to diversity and inclusion, it all starts with your team. They are, after all, the foundation for everything you do.<\/p>\n<p>When Ketan founded NewtonX, she and her co-founders prioritized culture and tolerance. “My co-founders and I had seen so many tech companies become toxic because of an early hire who is inappropriate or biased in the workplace,” she says. “We proactively recruited our first 10 hires and emphasized cultural awareness and respect as a crucial component of culture fit.”<\/p>\n<p>While NewtonX never had specific quotas to fill, she says focusing on those core values allowed it to “naturally develop into a highly diverse, female-led company.”<\/p>\n<p>Similarly, Crescendo places a heavy emphasis on the wording and placement of its job listings. “We ensure <a href=\"https:\/\/www.getcrescendo.co\/\">our job postings<\/a> use inclusive language and focus on the skill requirements of the role, rather than on specific degrees or years of experience which are often unnecessary barriers for applying,” says Kollenberg.<\/p>\n<p>The company also shares its opportunities with a wide range of communities. “We want to avoid the bias of only hiring from our immediate network,” explains Kollenberg. “And focus on meeting people where they are.”<\/p>\n<p>Andres Zapata, co-founder of integrated marketing agency <a href=\"https:\/\/idfive.com\/\">idfive<\/a>, has a more laid-back approach: <a href=\"https:\/\/fundbox.com\/blog\/4-ways-to-hire-the-right-people\/\">Hire the best people<\/a>. Period.<\/p>\n<p>“When you are open to it all, amazing things happen, especially because nothing is forced,&#8221; says Zapata. &#8220;It’s just natural. We have women in leadership, several non-native leaders, including our top brass, and a wide range of cultural, ethnic and racial diversity amongst our ranks. And they are all seriously talented.”<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/24f9d2f3-5406-4c4e-ae2a-63e5cfc1e80a_Andres20Zapata20on20diversity.png\" alt=\"\" \/><\/p>\n<h2>Cultivate diverse leaders<\/h2>\n<p>If you want to have diverse leadership, Ketan says you must be conscious of who you’re hiring for each position. She notes that, while many companies say they are “50% women,” their management is not.<\/p>\n<p>To combat this, NewtonX strived to hire women for leadership-track roles from the beginning, and then created a “transparent promotion path to manager.”<\/p>\n<p>Today, women hold more than half of NewtonX’s <a href=\"https:\/\/fundbox.com\/blog\/hiring-your-leadership-team\/\">leadership positions<\/a>.<\/p>\n<p>“Be proactive and intentional about hiring women and minorities for leadership and tech-focused positions,” says Ketan. “Culture comes from the top down and it’s important to live the values you espouse.”<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/f8b277e0-92b2-4e34-ae3b-f757c75af277_Anuja20Ketan20on20diversity.png\" alt=\"\" \/><\/p>\n<h2>Involve everyone in the process<\/h2>\n<p>Employees are your most valuable asset. That’s why Kollenberg says understanding what they want, and maintaining open lines of communication, is absolutely vital.<\/p>\n<p>“Feedback is incredibly important,” he says. “When getting started, mistakes will be made and you need to be willing to learn from your employees.”<\/p>\n<p>Melisa Yatman, Senior Human Resources Business Partner for <a href=\"https:\/\/fundbox.com\/careers\/\">Fundbox<\/a>, agrees.<\/p>\n<p>&#8220;Here at Fundbox,” says Yatman, “we really value employee feedback. We’re currently working on rolling out a Diversity and Inclusion Program at the company. We listen to and care about the people we work with, and employees clearly value inclusion so we’ve made this a top priority.&#8221;<\/p>\n<p>To get a pulse on your team’s needs, here’s what Kollenberg recommends: “Start asking questions about diversity and inclusion in your one-on-ones, have open forum discussions and create avenues for getting feedback. From there, you&#8217;ll identify which areas of your business need the most work and you can find <a href=\"https:\/\/www.getcrescendo.co\/\">solutions to those problems<\/a>.”<\/p>\n<p>While you may not yet have an official Diversity and Inclusion program yet, there are many ways to get buy-in and feedback from your team. Here are some unique initiatives that Zapata’s firm idfive has introduced:<\/p>\n<ul>\n<li>Hold cookoffs where team members share “dishes inspired by their ethnic, cultural and religious backgrounds.”<\/li>\n<li>Allow employees to suggest where to volunteer for the company’s annual “Day of Giving.” (This year, it was the International Refugee Committee — a pitch from an employee who’s an Iraqi political refugee.)<\/li>\n<li>Donate all the profits from the company vending machine to a charity chosen by the team.<\/li>\n<\/ul>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/760c1a33-cc08-46d9-8421-cc900622f9c4_Melisa20Yatman20on20diversity.png\" alt=\"\" \/><\/p>\n<h2>It’s OK to start small<\/h2>\n<p>To create a culture of diversity, your efforts don’t have to be over-the-top or expensive. You just have to view business decisions through an inclusive lens.<\/p>\n<p>idfive, for example, offers floating holidays so team members can take paid leave on days that are important to their own religion and culture.<\/p>\n<p>At Crescendo, all employees list their pronouns in bios on Twitter, LinkedIn, email, etc., as part of the company’s effort to normalize the behavior.<\/p>\n<p>And NewtonX has a “zero tolerance” policy for racist or sexist comments—even ones meant as jokes. “We believe making sure employees feel comfortable, respected and valued at the workplace is a crucial component of encouraging top-notch performance,” says Ketan. The company also outlines every meeting’s agenda beforehand, which allows “content to prevail over personalities.”<\/p>\n<h2>Be intentional<\/h2>\n<p>Are you seeing a common thread here? To integrate diversity into the fabric of your workplace, you don’t need a magic wand or specialized knowledge. To be successful, you do need to be open, intentional, and proactive with your efforts.<\/p>\n<p>“To go beyond tokenism, your company&#8217;s leadership needs to do two main things: take diversity and inclusion seriously and actively ask for feedback,” says Kollenberg. “When employees see leadership committing time and effort to improve their own behavior and making the processes within the company more inclusive, it sets a strong foundation for everything else.”<\/p>\n<p>Yatman points out that being intentional about diversity can help set the company up for business success later on.<\/p>\n<p>“It&#8217;s not very common for an early-stage company like Fundbox to focus on diversity initiatives, but we believe the right time to address them is early on,” says Yatman. “We want to be ahead of the curve and align our culture and business with our core values while maintaining a diverse and inclusive environment.”<\/p>\n<p>&nbsp;<\/p>\n<blockquote class=\"wp-embedded-content\" data-secret=\"tg2b9nqbH3\"><p><a href=\"https:\/\/fundbox.com\/blog\/6-ways-to-increase-employee-retention-in-your-small-business\/\">6 Ways to Increase Employee Retention in Your Small Business<\/a><\/p><\/blockquote>\n<p><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"&#8220;6 Ways to Increase Employee Retention in Your Small Business&#8221; &#8212; Fundbox\" src=\"https:\/\/fundbox.com\/blog\/6-ways-to-increase-employee-retention-in-your-small-business\/embed\/#?secret=tg2b9nqbH3\" data-secret=\"tg2b9nqbH3\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>4 experts explain how to go beyond lip service and create a truly inclusive workplace. An organization says it “supports &#8230;<\/p>\n","protected":false},"author":65,"featured_media":10442,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[326],"yst_prominent_words":[10225,757,10231,10230,8099,10229,8098,10217,10221,866,10228,10234,10233,10227,7523,10226,10224,10220,9307,10232],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How to Authentically Celebrate Diversity in Your Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"4 experts explain how to go beyond lip service and create a truly inclusive workplace. An organization says it “supports diversity”—but has a homogeneous staff. A company claims it “advances women”—but pays its female leaders less. We’ve all seen it before: businesses that pay lip service to the ideas of diversity"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Authentically Celebrate Diversity in Your Business | Fundbox Blog"},{"property":"og:description","content":"4 experts explain how to go beyond lip service and create a truly inclusive workplace. An organization says it “supports diversity”—but has a homogeneous staff. A company claims it “advances women”—but pays its female leaders less. We’ve all seen it before: businesses that pay lip service to the ideas of diversity"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/authentically-celebrate-diversity-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/shutterstock_1159836931.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/shutterstock_1159836931.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"4 experts explain how to go beyond lip service and create a truly inclusive workplace. An organization says it “supports diversity”—but has a homogeneous staff. A company claims it “advances women”—but pays its female leaders less. We’ve all seen it before: businesses that pay lip service to the ideas of diversity"},{"name":"twitter:title","content":"How to Authentically Celebrate Diversity in Your Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/shutterstock_1159836931.jpg"},{"name":"twitter:creator","content":"@susan_shain"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/authentically-celebrate-diversity-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10435"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/65"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10435"}],"version-history":[{"count":11,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10435\/revisions"}],"predecessor-version":[{"id":16354,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10435\/revisions\/16354"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10442"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10435"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10435"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10435"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10435"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}