{"id":10551,"date":"2019-03-14T12:01:11","date_gmt":"2019-03-14T19:01:11","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10551"},"modified":"2022-06-24T08:27:54","modified_gmt":"2022-06-24T15:27:54","slug":"marqeta-leader-future-digital-payments","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/marqeta-leader-future-digital-payments\/","title":{"rendered":"Marqeta Leader on the Future of Digital Payments"},"content":{"rendered":"<h3><span style=\"font-weight: bold;\">Q&amp;A with Lester Chen, Director of Product at Marqeta<\/span><\/h3>\n<p><a href=\"https:\/\/www.marqeta.com\/\">Marqeta<\/a> is a financial technology firm which provides access to an Issuer Processor API for developers of commerce solutions. Based in Oakland, CA, and founded in 2010, the company aims to revolutionize the way that we make payments and make business transactions more efficient.<\/p>\n<p>We recently had the opportunity to meet with Lester Chen, Director of Product Management for Marqeta’s e-commerce products. In our discussion, we explored his approach to creating truly simple customer experiences, the evolution of digital payments, and his predictions for the future of digital commerce.<\/p>\n<figure id=\"attachment_10553\" aria-describedby=\"caption-attachment-10553\" style=\"width: 501px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10553\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/headshot_Lester-Chen-crop.jpg\" alt=\"Headshot of Lester Chen, Director of Product Management at Marqeta\" width=\"501\" height=\"444\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/headshot_Lester-Chen-crop.jpg 2400w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/headshot_Lester-Chen-crop-768x681.jpg 768w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/headshot_Lester-Chen-crop-1536x1363.jpg 1536w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/headshot_Lester-Chen-crop-2048x1817.jpg 2048w\" sizes=\"(max-width: 501px) 100vw, 501px\" \/><figcaption id=\"caption-attachment-10553\" class=\"wp-caption-text\">Lester Chen, Director of Product Management at Marqeta<\/figcaption><\/figure>\n<h3><span style=\"font-weight: bold;\">Fundbox:<\/span> Hi Lester, let’s start with an introduction. Tell us about you and what you do.<\/h3>\n<p><span style=\"font-weight: bold;\">Lester Chen:<\/span> Sure. To give you the total picture, let me start off saying that I&#8217;m a newlywed, I got married last May. (I love you, Renee!) At Marqeta, I work on products that help people get paid with ease. That&#8217;s my professional life. To round it out, I also do my part in public service by serving as a member of the San Mateo Library Board of Trustees.<\/p>\n<h3>Awesome, thanks for spending time with us today. At Marqeta, you are a Director of Product. Can you explain a little bit about the problems that you&#8217;re currently solving?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> We have different product lines within Marqeta and I’m the product lead for one of those product lines. My area is what we call the e-commerce product line. It includes online travel, online retail, and digital media agencies.<\/p>\n<p>What these three segments have in common is, they&#8217;re all aggregators. With an online travel agency, you don&#8217;t have to go here and there to book hotels and tours. With an online retailer, you get to create a selection.<\/p>\n<p>What I help all of my customers with has to do with their payments: how they can pay their suppliers so they can get the best selection for their customers and then grow their businesses.<\/p>\n<p>In product management, we are basically problem solvers. We look at pain points our customers face with paying suppliers. Then we make sure it gets easier and easier so they don&#8217;t have to think about it. That frees them to focus on what they do best, which is growing their business and serving their customers, and not worry about payments, which is our problem.<\/p>\n<h3>In your product line, is there a typical customer profile or size that you&#8217;re focused on?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> We have a range of customers from large to small. Definitely, this year, we have a little bit more of a focus on platforms. We want to democratize fintech. We want to make sure that fintech isn&#8217;t just for tech giants or big corporations, but that it’s available to everybody. Through platforms, we can reach smaller businesses.<\/p>\n<h3>&#8220;Open banking” is a phrase that we are hearing a lot lately to describe the new financial world and this emerging ecosystem of technology products, like yours at Marqeta, and ours here at Fundbox. What’s your take on open banking?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> I&#8217;d say our take on it is what we&#8217;ve been seeing recently, which is this trend towards broader solutions. Let me explain what I mean by that and give an example. A leader I really admire once said their bar for a good product is whether its benefits are “ridiculously obvious.”<\/p>\n<p>This means the product in question is not only 10 times (10x) more effective, but also 10 times easier to use than what came before it. Every business has a ton of problems to solve. If something&#8217;s going to work for them, then it&#8217;s got to be so ridiculously easy for them [to use] before they will even think about adopting it, about switching from their current solution.<\/p>\n<p>I think where we are right now, to your point about being more open and things being more connected, is a market full of point solutions that pass the “ridiculously obvious” test, but when a business tries to use them all together, things become a bit clunky.<\/p>\n<p>Then, as a business owner, you&#8217;re stringing together a series of these 10x solutions, but the result is not 10x overall.<\/p>\n<h3>The Marqeta platform integrates with large partners like Visa and Mastercard. Can you explain in simple terms where your platform sits within the ecosystem of a transaction?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> Where we sit is on the paying side. We issue and process payments. We issue instruments that allow people to make payments. That could be a physical card, it could be a virtual card, it could be a tokenized card, but in all cases, they&#8217;re being used to make a payment.<\/p>\n<p>For me and my product line, I&#8217;m helping my customers pay their suppliers. It could be a travel agency using a virtual card to hold a reservation for their traveler at hotel. It could be a retail aggregator paying their suppliers. Or it could be a digital media ad agency paying publishers to run effective advertising campaigns for their clients.<\/p>\n<h3>Are there other companies or products besides your own that you look to or keep tabs on, for either a competitive intelligence or to get ideas?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> There&#8217;s not a particular company I look at, personally, because there are so many to choose from. I&#8217;m a firm believer that the best seed for a creative spark can often come from outside your industry. Cross-pollination across industries can get you something really different. I try to keep my eye out for interesting solutions, so [inspiration] can come from companies outside the industry, from competitors, from customers&#8230; They&#8217;re all trying to innovate, too.<\/p>\n<h3>Are there game-changing innovations or news that have inspired you in the past year that come to mind?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> On the inspirational theme, I want to tell a story about Western Union. Western Union started in 1851 with the telegraph, and now they&#8217;ve<a href=\"https:\/\/www.pymnts.com\/amazon\/2018\/western-union-cross-border-payments-partnership\/\"> <\/a><span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.pymnts.com\/amazon\/2018\/western-union-cross-border-payments-partnership\/\">partnered with Amazon<\/a><\/span> so that shoppers can pay cash for cross-border online retail orders. It&#8217;s an interesting innovation that allows international folks who are underbanked and are really used to cash, to not be cut off from the future of retail.<\/p>\n<p>Western Union has been around for a long time but they are still innovating and figuring out a way to bring something new to solve this problem. I think that&#8217;s good news for your audience who are small businesses because now, there are more and more choices for [financial] solutions that fit their needs.<\/p>\n<p>Today, there’s more and more customer choice, however you want to run your business—you&#8217;ll probably find at least one, maybe to two options out there that really suits you. I think it&#8217;s an exciting time if Western Union is still doing interesting things.<\/p>\n<figure id=\"attachment_10554\" aria-describedby=\"caption-attachment-10554\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10554\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/telegraph.jpg\" alt=\"\" width=\"500\" height=\"309\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/telegraph.jpg 2280w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/telegraph-768x474.jpg 768w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/telegraph-1536x949.jpg 1536w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/telegraph-2048x1265.jpg 2048w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><figcaption id=\"caption-attachment-10554\" class=\"wp-caption-text\">Ancient technology! The telegraph. (<a href=\"http:\/\/www.wanowandthen.com\/telegraph.html\">Image<\/a> via <em>Western Union Now and Then<\/em>.)<\/figcaption><\/figure>\n<h3>That&#8217;s a great example of a company and brand that has evolved so much over the years. You mentioned something else that was interesting there about the number of solutions that are emerging today, driven by technology. Our customers aren&#8217;t so different: at Fundbox we serve a lot of small business customers, and none of them got into business because they wanted to do paperwork and keep up with financial solutions. With so many solutions out there, would you have any advice for business owners who are not financial or technology experts, who want to keep up?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> My advice for small businesses is, you don&#8217;t necessarily have to look for the point solutions to solve your problems. Instead, I would look at platforms. You want everything to work well together.<\/p>\n<p>As an example, look in the travel space, one of my customer segments. When we think of travel, we often think everything is online. That’s true for the airlines and hotels, but then when you take a vacation, what do you do once you got there? You want to be entertained, you want to do activities.<\/p>\n<p>About three quarters of tours and activities, you still need to book offline. In the past few years I&#8217;ve seen entrepreneurs create platforms to help tour operators which tend to be smaller businesses.<\/p>\n<p>Now imagine those smaller tour operators thinking, “Geez, I&#8217;ve got to figure out how to take online payment, set up a website, create a reservation platform…”<\/p>\n<p>They don’t want all this hassle to try to make it all fit together. It&#8217;s not what they got in a business to do.<\/p>\n<p>In a situation like this, I would say, if you&#8217;re just trying to get tech-enabled, look for a <span style=\"font-style: italic;\">platform<\/span> in your space. There&#8217;s a smaller number of options to evaluate and they&#8217;ll help you build a broader solution so that you can be a fully digital business. As you get more advanced you can figure out your niche or specialty, and start looking for things that accentuate and play to your strengths.<\/p>\n<h3>That&#8217;s great advice. I think a lot of entrepreneurs see a problem and think, &#8220;I have a problem. I&#8217;m going to go online and use search engines and try and solve that problem.&#8221; Then they end up with a collection of point solutions, like you said.<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> Yes. This is my daily life. Recently, my dad asked me to open a CD for him at online bank. My dad&#8217;s 75 and he&#8217;s retired. He just wants safety, inflation protection and that&#8217;s good enough. He said, &#8220;Hey son, this is an online bank. I think they got a good interest rate. Help me open the account.”<\/p>\n<p>I&#8217;m helping him through this, and 90% of the process is super easy. It’s online, digital, and smooth. Then it comes the time to deposit the funds. We have to mail in a signature card and a check. It feels like exiting a superhighway like the German Autobahn and getting on to an unpaved road.<\/p>\n<p>I suspect that if I wasn&#8217;t there, he may have just given up in frustration, and that would cost him the chance to protect his money. I think businesses have this experience, too. [They hit a roadblock in a setup process], it&#8217;s manual, it&#8217;s slow, and it&#8217;s unpleasant. Then either it&#8217;s so frustrating, they give up and they don&#8217;t even use the original point solution or now they&#8217;re spending more time doing it. This situation is costing them opportunities to grow.<\/p>\n<p>One of my predictions for this year is a continued focus on how businesses can become fully digital. Companies are going to look more broadly. Businesses should not miss out on opportunities because they had to waste time stitching solutions together.<\/p>\n<h3>You do have kind of a unique window into the future because of what you do. How do you envision the future of e-commerce and how payment technologies like yours are going to bring us there?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> Yes. I need to take a step back because there&#8217;s so many different variants. I hesitate to make predictions about the path we take to get there, but the trend is always going to be to make things easier for the end customer, whether you&#8217;re a traveler, a shopper, or an advertiser. That&#8217;s just timeless. People just want things to be easier. I also think the quality of experience is going to go up. Every fintech vendor I know is trying to improve.<\/p>\n<p>There are internal pressures. We&#8217;re always trying to make a product more effective for our customers.<\/p>\n<p>We also have a lot of external pressures. Competitors are getting bigger. There&#8217;s the economic cycles—caveat, this is not investment advice—whenever the economic cycle turns down, customers are going to look at any solution carefully. As we&#8217;re scrutinized, we&#8217;re all going to have to up our game.<\/p>\n<p>There’s also regulation. Especially in Europe, they’re generally a little bit more proactive in the U.S. in regulation. As the rules change we still have to be just as innovative. To keep innovation going in a increased regulatory regime, we&#8217;re going to have to up our game. I personally don&#8217;t want to complain about regulation. It&#8217;s just a challenge to be creative and still be innovative.<\/p>\n<p>I can&#8217;t give you a picture of how e-commerce will look in the future, but it&#8217;s going to be easier and higher-quality. We&#8217;re going to keep getting closer and closer to fully digital businesses.<\/p>\n<p>That&#8217;s the future of e-commerce, and as payments providers that are supporting these businesses, we&#8217;ll be obsessed with making payments invisible so that they can get to that future and never have to think about payments.<\/p>\n<h3>Awesome. I think that&#8217;s a great note to end on. Any final thoughts about fintech and the world of payments that you want to share before we sign off?<\/h3>\n<p><span style=\"font-weight: bold;\">LC:<\/span> Quality is going up, and you&#8217;ll see the businesses are becoming more fully digital. That&#8217;s not just for the big name companies. We’re going to see that democratization of fintech.<\/p>\n<h3>Could not agree more. I think both of our companies are trying to work toward that in our own way. Thanks, Lester.<\/h3>\n<div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Q&amp;A with Lester Chen, Director of Product at Marqeta Marqeta is a financial technology firm which provides access to an &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10555,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11504,10147],"yst_prominent_words":[1132,10537,10538,10539,798,10560,10561,10609,10661,10662,10663,870,10710,865,10718,1657,10729,10730,2083,10802],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Marqeta Leader on the Future of Digital Payments | Fundbox Blog","yoast_meta":[{"name":"description","content":"Q&amp;A with Lester Chen, Director of Product at Marqeta Marqeta is a financial technology firm which provides access to an Issuer Processor API for developers of commerce solutions. Based in Oakland, CA, and founded in 2010, the company aims to revolutionize the way that we make payments and make business"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Marqeta Leader on the Future of Digital Payments | Fundbox Blog"},{"property":"og:description","content":"Q&amp;A with Lester Chen, Director of Product at Marqeta Marqeta is a financial technology firm which provides access to an Issuer Processor API for developers of commerce solutions. Based in Oakland, CA, and founded in 2010, the company aims to revolutionize the way that we make payments and make business"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/marqeta-leader-future-digital-payments\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/shutterstock_1099878668.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/shutterstock_1099878668.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Q&amp;A with Lester Chen, Director of Product at Marqeta Marqeta is a financial technology firm which provides access to an Issuer Processor API for developers of commerce solutions. Based in Oakland, CA, and founded in 2010, the company aims to revolutionize the way that we make payments and make business"},{"name":"twitter:title","content":"Marqeta Leader on the Future of Digital Payments | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/shutterstock_1099878668.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/marqeta-leader-future-digital-payments\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10551"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10551"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10551\/revisions"}],"predecessor-version":[{"id":16288,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10551\/revisions\/16288"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10555"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10551"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10551"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10551"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10551"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}