{"id":10568,"date":"2019-03-19T08:13:00","date_gmt":"2019-03-19T15:13:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10568"},"modified":"2020-11-10T11:46:32","modified_gmt":"2020-11-10T19:46:32","slug":"humans-of-fundbox-prashant-fuloria","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/","title":{"rendered":"Humans of Fundbox: Prashant Fuloria"},"content":{"rendered":"<p>In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, we’re proud to highlight our Chief Operating Officer, Prashant Fuloria.<\/p>\n<p>Part of the executive leadership team, Prashant leads core technical functions (engineering, data, product management, and user experience) as well as HR from his home base in the San Francisco office. He talked with me about his career and what led him to join Fundbox nearly three years ago. We also dug into his thoughts about creating culture in a rapidly-expanding company, and the immense value that diversity and collaboration bring to organizations.<\/p>\n<figure id=\"attachment_10572\" aria-describedby=\"caption-attachment-10572\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10572\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/headshot_Prashant-Fuloria-Nov-2018-crop.jpg\" alt=\"Prashant Fuloria, Chief Operations Officer, Fundbox\" width=\"500\" height=\"618\" \/><figcaption id=\"caption-attachment-10572\" class=\"wp-caption-text\"><em>Prashant Fuloria, Chief Operations Officer, Fundbox<\/em><\/figcaption><\/figure>\n<h3>Fundbox: Prashant, you’d been a leader at several incredibly successful technology companies before you joined the executive team at Fundbox three years ago. What about this company was so compelling to you then?<\/h3>\n<p><span style=\"font-weight: bold;\">Prashant Fuloria:<\/span> Before I joined Fundbox, I took a few months off from work and spent time doing things that I wanted to catch up on, like teaching, advising, and investing. I was looking for what to do next and in that journey, I was looking for a few things that I found at Fundbox.<\/p>\n<p>Number one, I was looking for a company that had an inspiring mission. I&#8217;ve been privileged to work at companies with strong missions: Google&#8217;s mission was to organize the world&#8217;s information and make it universally accessible. Facebook had the mission of making the world more open and connected. In my next role, I wanted to work at a company whose mission was inspiring and big.<\/p>\n<p>One litmus test of a “big mission” is that you could work on it for a very long time, be very successful, and yet not complete the mission. The Fundbox mission of helping businesses succeed by giving them financial power and tools that might otherwise be out of their reach passes this test and is very inspiring to me. This is especially so because all of us can relate to small businesses in some way, either as customers, as former owners, or by knowing people who&#8217;ve had both the fortune and the challenges of running a small business.<\/p>\n<p>What is also very compelling was that the mission seemed to resonate around the company. People I talked to seemed to understand the mission and were excited by it.<\/p>\n<p>That brings me to the second thing, which is the people.<\/p>\n<h3>What was it about the people that stood out to you?<\/h3>\n<p><strong>PF:<\/strong> In my career, I’ve learned that you can be at a very successful company and yet be miserable on a day to day basis if you&#8217;re not working with the right people. On the other hand, you could be working at a company where you may have challenges, but every day is still fun because you know you&#8217;re going into those challenges with the right people around you.<\/p>\n<p>When I met the people at Fundbox, I found them to be incredibly smart and talented, very passionate and energized by that mission. Also, there were people that I just felt would be good to partner with and that was very important for me.<\/p>\n<p>Of course, we&#8217;ve grown almost four times over the last two and a half years, but I think we&#8217;ve kept that spirit in this expanded Fundbox team.<\/p>\n<p>The third compelling thing about Fundbox for me was the execution. When I look at the company during that time, we were a little over three years old, but in three years, the company had done some amazing things. We had a thesis and had started figuring out product market fit in their first product. We built some cool technology had a successful business with some very, very happy customers.<\/p>\n<p>Just on the basis of the customer success, the business, the product and the tech, it was clear that this relatively small company had done a lot over a short period of time.<\/p>\n<p>Those are the three things that I saw, one the mission, two the people, three, the execution and the trajectory that said to me, there&#8217;s something special about this company.<\/p>\n<h3>In your observation, what type of person most thrives at Fundbox?<\/h3>\n<p><span style=\"font-weight: bold;\">PF: <\/span>There are some characteristics that help people succeed and thrive at Fundbox. For one thing, people who can comprehend things quickly and can create structure out of ambiguity, and people who&#8217;ve got a lot of energy and drive all do well at Fundbox.<\/p>\n<p>Other things that come to mind are adaptability and both the willingness and yearning for change. As a rapidly-growing company, change is the one thing that&#8217;s constant for us.<\/p>\n<p>Similarly, people for whom the mission is important or who are energized by the mission tend to do well. If you&#8217;re energized by the idea of leveling the playing field between smaller businesses and large enterprises when it comes to access to financial power, if that excites you, then Fundbox will be an exciting place to work!<\/p>\n<p>Finally, being collaborative is important. We don’t have a “star culture.” There are certain companies where specific individuals are held up as “stars” with the explicit goal of motivating others through competition or jealousy. Fundbox is not like that, so if you are motivated by showing how much cleverer or smarter or better you are than other people, that&#8217;s not very helpful at Fundbox.<\/p>\n<p>If, on the other hand, you derive a lot of your energy from the success of our customers, our company and the team, then I think Fundbox is really a good place for you because it&#8217;s very collegial and highly collaborative.<\/p>\n<h3>That&#8217;s a great observation and I think that culture attracts a certain type of person, as well. What would you say about your day to day life at Fundbox? What do you spend most of your work hours doing and what are the main ways that you track your own success for yourself and for your team?<\/h3>\n<p><span style=\"font-weight: bold;\">PF: <\/span>I&#8217;m very privileged to be working with teams that are so well-managed. The way I look at my job is to focus on whatever is needed at that moment. A lot of my work tends to be initiative-driven. For example, if we are making changes to our recruiting process, something that I might be deeply involved with for some period of time. Or if we are brainstorming around a new product idea, that could be a focus of mine.<\/p>\n<p>I view my work as being very situational, based on what the company needs. The reason why I can afford that luxury is because the teams that I work with are well-managed teams that can and do run themselves, such that if, for example, I get run over by a truck, it will have virtually no impact on the day-to-day execution of those teams.<\/p>\n<h3>Except we&#8217;ll be very depressed if you were run over by a truck! As the head of operations, that means HR, product, engineering, data, and UX all ultimately report to you.That&#8217;s rather different from some of the other leadership roles you&#8217;ve held, isn’t it? You were head of product at Flurry, and you’ve also held positions at Facebook, Yahoo and Google.<\/h3>\n<p><span style=\"font-weight: bold;\">PF: <\/span>Yes. My career is rooted in product management at companies small and large. I&#8217;ve been in companies as small as five people, startups, and at companies as large as 35,000. I have seen pretty much every scale in between.<\/p>\n<p>One of the things that product management teaches you is constrained problem solving. The constraints can be people, resources, or time but ultimately, you&#8217;re going to solve problems in very constrained environment and that is something that is a skill that&#8217;s carried me through my career. In some ways, my role at Fundbox is not that different from my prior roles.<\/p>\n<h3>What did you study in school? Did you already know that developing technology products was going to be in your future?<\/h3>\n<p><span style=\"font-weight: bold;\">PF: <\/span>My undergraduate degree is in Chemical Engineering. At Stanford, I focused on Business Management from a mathematical and statistical standpoint. I have a Master&#8217;s in Statistics from Stanford, a Master&#8217;s in Business Research, and a PhD from the Business School and Operation Information and Technology with a Minor from the Engineering School.<\/p>\n<p>Did I know I’d be developing tech products? Not at all.<\/p>\n<p>I graduated from IIT Delhi in my undergrad at &#8217;96 and I moved to the Bay Area to join the PhD program at Stanford. Originally, I was focused on becoming a business school faculty member. The PhD program I was part of at Stanford was and still is known for producing successful business school academics. Right till about &#8217;99, my goal was to become a business school professor.<\/p>\n<p>However, two things happened to me at that time. One was external, one was internal. This was 1999, and the Internet was booming. The bubble hadn&#8217;t burst at that time and I was thinking, wow, the world of technology is so exciting, and rather than just research it, why don&#8217;t I actually practice it?<\/p>\n<p>The second factor was, I realized that research, especially in an area like operations research or other managing practices was a lonely business. Most researchers, while they had the opportunity to teach, would basically be working by themselves or with a collaborator who was halfway across the country or world. I’ve learned that I get a lot of my energy by working with other people.<\/p>\n<p>While I loved research and I&#8217;m very glad that I did my PhD, I made the decision to finish it and then start working at a startup. Two years later, when the bottom had fallen out of the internet business, I was asking myself: did I just make the single biggest mistake of my life?<\/p>\n<p>Luckily, the startup ended up in a good place. I had the chance to join Google in the early days which was a very pivotal part in my career. So things have worked out well, but certainly not without their ups and downs.<\/p>\n<h3>As a chief executive at Fundbox, you have a big impact on how our culture develops. Can you talk a bit about how you look at that responsibility and opportunity at a rapidly-scaling company?<\/h3>\n<p><span style=\"font-weight: bold;\">PF: <\/span>Building and shaping culture is difficult. It’s especially difficult to do if you&#8217;re growing very, very fast.<\/p>\n<p>While I love businesses that grow fast, I&#8217;m always a little wary if teams grow <span style=\"font-style: italic;\">too<\/span> fast. I think that&#8217;s because bringing new people onboard, assimilating them and giving them the opportunity to understand what&#8217;s gone on before them and also what they want to change in a more thoughtful way is so important.<\/p>\n<p>I&#8217;m happy that we&#8217;ve been growing at a pace where new people have a chance to assimilate in the company. They have a chance to experience and shape the culture as we grow. I want to consider the experience new folks get when they join, and how much of a platform they get.<\/p>\n<p>I’ve learned that it&#8217;s useful to be as conscious or explicit about culture as possible. We spend a fair amount of time in codifying our values in what we call MOSAIC. [“MOSAIC” is an acronym for a set of values at Fundbox and it stands for, “Mission, Ownership, Speed, Achva, Innovation, and Clarity.”]  I&#8217;m glad we did it not only because the values themselves are important, but the process to actually elicit those values was useful in that it gave people the chance to reflect on who we are and who we want to be.<\/p>\n<h3>Millennial employees (both at Fundbox and elsewhere) have been increasingly vocal about how much they value inclusion and diversity. What&#8217;s your perspective on this?<\/h3>\n<p><span style=\"font-weight: bold;\">PF: <\/span>There&#8217;s obviously been a lot of focus on diversity and inclusion in the recent years and that&#8217;s a very good thing. I think diversity and inclusion may go also beyond the more obvious or the visible, for example, gender or ethnic or age diversity, to things like diversities in points of view or diversities in style. For example, how do you create an environment that lets people who have different work styles flourish and contribute?<\/p>\n<p>Diversity has a lot of different dimensions to it. Simply having people in the company that represent diversity, that&#8217;s definitely a good start, it&#8217;s necessary, but it&#8217;s not sufficient. I think the other part of it is to encourage those diverse backgrounds to manifest in discussions and decisions. For example, having people from all over the world work at a company is not that useful if that diversity of background is not somehow harnessed to make better decisions and to build a better company.<\/p>\n<p>The focus should be, how do you leverage or harness that diversity to build a better company, a better business, and potentially a better product for your customers.<\/p>\n<h3>That’s a good point, and it’s something we’re always trying to get better at. Thanks so much, Prashant, it’s been a pleasure to hear your perspective.<\/h3>\n<figure id=\"attachment_10577\" aria-describedby=\"caption-attachment-10577\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10577\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/Coverflow-with-Sammy-Hagar.jpg\" alt=\"Prashant and Coverflow with Sammy Hagar\" width=\"500\" height=\"333\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/Coverflow-with-Sammy-Hagar.jpg 960w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/Coverflow-with-Sammy-Hagar-768x512.jpg 768w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><figcaption id=\"caption-attachment-10577\" class=\"wp-caption-text\"><em>Prashant building a different kind of culture, rocking out with his all-technologist band, <a href=\"https:\/\/www.facebook.com\/pg\/Coverflow\">Coverflow<\/a>, onstage with Sammy Hagar in 2012.<\/em><\/figcaption><\/figure>\n<p>&nbsp;<\/p>\n<p><em>Want to work with Prashant at Fundbox? Check out our <a href=\"https:\/\/fundbox.com\/careers\/\">Careers page<\/a> for openings.<\/em><\/p>\n<p><em>Want more Humans of Fundbox?<\/em><\/p>\n<ul>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/\">Meet Gibson Holland, Sync Support Manager<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/\">Meet Emad ElShawa, Business Operations Manager<\/a><\/em><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-tom-goldschmiedt\/\"><em>Meet Tom Goldschmiedt, Human Resources Manager <\/em><\/a><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-robin-macpherson\/\">Meet Robin MacPherson, Software Engineer<\/a><\/em><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10578,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,326],"yst_prominent_words":[10519,723,10530,757,8098,10217,10586,838,10087,4838,1521,10712,10720,1657,10730,10756,3300,3090,10807],"post-meta-fields":{"stripe_selected":"top-right-risks","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"Humans of Fundbox: Prashant Fuloria | Fundbox Blog","yoast_meta":[{"name":"description","content":"Part of the executive leadership team, Prashant leads core technical functions (engineering, data, product management, and user experience) as well as HR from his home base in the San Francisco office. He talked with me about his career and his thoughts about creating culture in a rapidly expanding company."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Humans of Fundbox: Prashant Fuloria | Fundbox Blog"},{"property":"og:description","content":"Part of the executive leadership team, Prashant leads core technical functions (engineering, data, product management, and user experience) as well as HR from his home base in the San Francisco office. He talked with me about his career and his thoughts about creating culture in a rapidly expanding company."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/Fundbox_AB-3981-office-spaceship-scaled.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/Fundbox_AB-3981-office-spaceship-scaled.jpg"},{"property":"og:image:width","content":"2560"},{"property":"og:image:height","content":"1706"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Part of the executive leadership team, Prashant leads core technical functions (engineering, data, product management, and user experience) as well as HR from his home base in the San Francisco office. He talked with me about his career and his thoughts about creating culture in a rapidly expanding company."},{"name":"twitter:title","content":"Humans of Fundbox: Prashant Fuloria | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/Fundbox_AB-3981-office-spaceship-scaled.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10568"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10568"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10568\/revisions"}],"predecessor-version":[{"id":14145,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10568\/revisions\/14145"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10578"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10568"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10568"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10568"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10568"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}