{"id":10685,"date":"2019-05-02T07:05:00","date_gmt":"2019-05-02T14:05:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10685"},"modified":"2020-09-04T17:43:15","modified_gmt":"2020-09-05T00:43:15","slug":"streamlining-hvac-funding-housecall-pro-fundbox","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/streamlining-hvac-funding-housecall-pro-fundbox\/","title":{"rendered":"Streamlining HVAC and Funding with Housecall Pro and Fundbox"},"content":{"rendered":"<p>Joel Nieman owns <span style=\"text-decoration: underline;\"><a href=\"https:\/\/airaceheatingandcooling.com\/\">AirAce Heating &amp; Cooling<\/a><\/span> in Central Illinois. Since founding the business in 2014, his team provides HVAC services, specializing in heating and cooling systems for residential and light commercial applications. As part of his commitment to building transparent long-term customer relationships while operating at maximum efficiency, Joel uses both Housecall Pro and Fundbox to help run his business.<\/p>\n<p><img loading=\"lazy\" class=\"floatright alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/Joel_Nieman_AirAce.jpg\" alt=\"Joel Nieman, owner of AirAce Heating &amp; Cooling.\" width=\"342\" height=\"342\" \/><\/p>\n<p>Joel has lived in Illinois nearly all his life. After spending 10 years in the Navy, he returned to his home state and worked as a welding supervisor while taking classes at night. “My Navy background dovetailed nicely into HVAC,” he says. “A lot of what I was doing in the Navy and the experience I had was with metalworking, plumbing, and sheet metal. All that stuff that goes with HVAC was already there in my skill set. I just needed to learn the refrigeration side of things.”<\/p>\n<p>In school, he met Chris, another Illinois native who studied HVAC after serving in the Army, including two combat deployments in Iraq. The two started AirAce together in 2014 and have enjoyed considerable success, as indicated by the many glowing reviews they proudly display on their website.<\/p>\n<p>AirAce focuses on residential work. Specifically, they frequently work with new homeowners who want to fix up older houses, and homeowners who want to make their heating and cooling systems more energy-efficient. “We deal mainly with residential work,” says Joel. “We work a lot with the utility out here, called Ameren.”<\/p>\n<p>He’s referring to Ameren Illinois, which is actually the combination of three Illinois utilities (CIPSCO Incorporated, CILCO Inc. and Illinois Power Company) and Union Electric Company of St. Louis. Ameren Illinois ranks as Illinois&#8217; third largest natural gas distribution operation in total number of customers, according to their <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.ameren.com\/company\/about-ameren\">website<\/a><\/span>. They’re also a significant customer of AirAce, sending a steady flow of jobs.<\/p>\n<h2>Delayed payments can be a pain<\/h2>\n<p>Joel appreciates this relationship, though the time between jobs and payments can be a challenge. Often times, his team will purchase supplies and complete work a month or two months before getting paid. It’s typical for AirAce to move on to the next job before getting paid for the last one.<\/p>\n<p>“You&#8217;ll get a backlog of these jobs,” he explains. “You just don&#8217;t go and do the job one week and then get paid the next week. It’s a few months from now when you get paid. At a minimum, you would get paid one month from when you completed the job.”<\/p>\n<p>Some lag time between doing work and getting paid is normal for HVAC companies like AirAce, but the complicated nature of some jobs, combined with the variation in payment time can lead to cash flow crunches.<\/p>\n<p>“There&#8217;s no rule” about exactly how long payment might take, according to Joel. In most cases, “they will process your payment within three to four weeks after the job is done.”<\/p>\n<p>When the clock starts on those three to four weeks can vary, though: “There&#8217;s pre-testing you have to do when you go on-site. Then, you submit the paperwork or the findings. Once that&#8217;s approved, you do the work. Then, when the work&#8217;s done, you go out and do a post-test, and then you submit the findings from the post-test, then they review it and approve it. Then they process the payment.”<\/p>\n<p>With jobs and equipment orders frequently overlapping, those weeks of waiting for approval and processing can be frustrating and costly.<\/p>\n<p>“That whole process can take up to a couple of months. That&#8217;s where your problems can come in with the suppliers, your people that are supplying your equipment and things like that.”<\/p>\n<p>Joel recounted a story where this situation occurred with one of his suppliers. “I had a pretty good balance on my account down at my supply house, and they wanted their money,” he says.<\/p>\n<p>He says that so far, he’s never been denied an equipment purchase, and he intends to keep it that way. “If they weren&#8217;t willing to sell me any more equipment until I paid them the balance, then it could hinder my ability to do business unless I secured the money upfront to go down and purchase the equipment in cash.”<\/p>\n<h2>Streamlining work with Housecall Pro and Fundbox<\/h2>\n<p>When considering where to get some extra funding to make that urgent payment to his supply house, Joel’s first instinct was to call his bank.<\/p>\n<p>“I reached out to some of the local banks and it just takes a long time for some of them to make a decision,” he says. “I went to the bank where I have my business checking account. I reached out to someone there, and a couple of days later, I got an email. It was just a very slow process and I needed something quicker than that.”<\/p>\n<p>He needed to pay that supplier soon; he didn’t want to wait around for days just to get a response to every email. Luckily, he discovered that one of the services he already used, <a href=\"https:\/\/www.housecallpro.com\/\">Housecall Pro<\/a>, offered a financing integration with Fundbox.<\/p>\n<p>Overall, Housecall Pro has brought significant benefits to his business, including time savings and improved customer relationships.<\/p>\n<p>“Our customers especially like Housecall Pro,” says Joel. “When you go out and do a job, you mark yourself ‘on your way’ so the customer will get a text telling them that I&#8217;m coming. Customers can even track my location if they want, if they download the Housecall Pro app. [If the customer isn’t at home, Housecall Pro] will notify them when I get there and start the job. Then when I get done, I hit ‘finish’ to report my time on the job.”<\/p>\n<p>AirAce customers have appreciated the real-time updates, as well as the documentation that Housecall Pro makes easy. With Housecall Pro, says Joel, “I can document the job, take pictures, upload them, and send everything to the customer. I like the total documentation of the jobs. You can do all the steps and let them know what action you took. HousecallPro establishes a better form of communication between me and the customer. People really seem to like it.”<\/p>\n<p>Housecall Pro also speeds up reporting and improves efficiency when it comes to handling finances.<\/p>\n<p>“It saves me a lot of time,” says Joel. “On the reporting side, you can get all kinds of reports, from how much money you brought in, your income, how many estimates you won, to how many estimates you quoted.”<\/p>\n<p>Housecall Pro helped save him even more time when he was looking for a solution to his financing needs. When he discovered the Fundbox integration in his Housecall Pro account, he applied and was pleasantly surprised at how quickly he was approved.<\/p>\n<p>“I didn&#8217;t even know that [funding] was available on HousecallPro,” says Joel. “ We found out about that and I applied. Within maybe 30 minutes, we had approval for the funding.”<\/p>\n<p>Timing was important, and the speed and ease of the process was a big benefit to using Fundbox: “It was very easy to go on and apply. The decision was quick. I got the money I needed quickly, and I was able to get my supplier paid.”<\/p>\n<p>For AirAce, keeping things simple is key. When asked what advice he would give to other business owners, Joel takes a pragmatic approach. “We try to operate our business debt-free. For the most part, we&#8217;ve been pretty successful in doing that. We try to keep our overhead low and our operating expenses low. Of course, you&#8217;ve got to have cash.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Joel Nieman owns AirAce Heating &amp; Cooling in Central Illinois. Since founding the business in 2014, his team provides HVAC services, &#8230;<\/p>\n","protected":false},"author":61,"featured_media":10687,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[10410],"tags":[11504],"yst_prominent_words":[10878,10881,10903,6841,2964,10935,10936,10940,10941,10942,10944,3039,10955,3041,10984,10985,10988,11008,3300,3090],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"pink","bw_feature":"no","category_color":""},"yoast_title":"Streamlining HVAC and Funding with Housecall Pro and Fundbox | Fundbox Blog","yoast_meta":[{"name":"description","content":"Joel Nieman owns AirAce Heating &amp; Cooling in Central Illinois. Since founding the business in 2014, his team provides HVAC services, specializing in heating and cooling systems for residential and light commercial applications. As part of his commitment to building transparent long-term customer relationships"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Streamlining HVAC and Funding with Housecall Pro and Fundbox | Fundbox Blog"},{"property":"og:description","content":"Joel Nieman owns AirAce Heating &amp; Cooling in Central Illinois. Since founding the business in 2014, his team provides HVAC services, specializing in heating and cooling systems for residential and light commercial applications. As part of his commitment to building transparent long-term customer relationships"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/streamlining-hvac-funding-housecall-pro-fundbox\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1135475837.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1135475837.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Joel Nieman owns AirAce Heating &amp; Cooling in Central Illinois. Since founding the business in 2014, his team provides HVAC services, specializing in heating and cooling systems for residential and light commercial applications. As part of his commitment to building transparent long-term customer relationships"},{"name":"twitter:title","content":"Streamlining HVAC and Funding with Housecall Pro and Fundbox | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1135475837.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/streamlining-hvac-funding-housecall-pro-fundbox\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10685"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=10685"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10685\/revisions"}],"predecessor-version":[{"id":11855,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/10685\/revisions\/11855"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/10687"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=10685"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=10685"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=10685"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=10685"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}