{"id":1099,"date":"2015-03-09T07:10:00","date_gmt":"2015-03-09T14:10:00","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=1099"},"modified":"2019-01-29T15:23:14","modified_gmt":"2019-01-29T23:23:14","slug":"grow-accounting-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/grow-accounting-business\/","title":{"rendered":"8 Tips to Grow Your Accounting Business"},"content":{"rendered":"<p>According to <a href=\"http:\/\/www.sba.gov\/sites\/default\/files\/FAQ_Sept_2012.pdf\" target=\"_blank\">SBA data<\/a>, small businesses make up 99.7% of U.S. employer firms. This represents a big market opportunity for accountants who specialize in helping small business owners. But with the explosion of low-cost, cloud-based accounting software and the proliferation of big-brand tax\/accounting businesses on almost every street corner, small businesses have a lot of choice when it comes to choosing an accounting service.<\/p>\n<p>So how can small business accounting firms fight back? One increasingly popular approach is to offer more than simple point services, such as tax preparation. Instead, accountants and consultants are developing strategies to nurture lucrative client relationships in a broader business advisory capacity.<\/p>\n<p>If you are interested in growing and diversifying your accounting business to become a trusted small business advisor, here are eight considerations that can help take you there.<\/p>\n<p><strong>Why Become a Trusted Advisor?<\/strong><br \/>\nChoosing an accountant is a significant milestone for any small business. It’s a sign that the business owner is ready to strengthen its financial function, improve reporting, and prepare the business for growth. Because the role crosses so many aspects of the owner’s business and can have a significant impact on operations, a relationship based on trust is a must.<\/p>\n<p>What does this mean for you? Well, as an advisor you’ll need to exhibit a commitment to getting to know your client’s business – its goals, challenges, opportunities and threats. You’ll also need to keep an eye on the broader regulatory landscape and proactively bring potential issues and opportunities to the attention of your client.<\/p>\n<p><strong>Do You Have the Personal Qualities?<\/strong><br \/>\nWhen small business owners seek out the services of an accountant, they look for several qualities. Professional accreditations and experience are a must, but the personal qualities of an accountant play a vital role too. The good news is that if you own your own business you already have a distinct advantage over larger accounting firms – you understand what it takes to be an expert in your field while juggling the demands of business ownership.<\/p>\n<p>But can you translate these qualities into that of a trusted advisor? Since your clients are small business owners too, you’ll need to be able to demonstrate that you understand their problems (more on this in my next point), that you have patience, and, most importantly, that you have a good command of plain English communication skills.<\/p>\n<p>These and other factors can help build trust and a positive relationship.<\/p>\n<p><strong>Focus on the Client Pain Points that you can Address<\/strong><br \/>\nOne of frequent the mistakes that business owners make is that they focus on selling products and services, as opposed to selling the actual benefits or, what I like to call, the “so-what?” factor of what they do.<\/p>\n<p>If you are to become a trusted advisor, your ability address your client’s pain points is critical – this is your value-add. So, as you approach new clients and nurture existing ones, always keep in mind the “so-what?” element of what your services and expertise bring.<\/p>\n<p>Put yourself in your clients shoes, what are they looking for when they start their search for an accountant? Think of ways to relate these needs and pain points to how you position your services, for example:<\/p>\n<p>“<em>I\/we can help you navigate the tax issues associated with Obamacare and the specific implications they have on your business.<\/em>”<\/p>\n<p>“<em>I\/we can educate you on payroll laws that you need to comply with so that you don’t find yourself unwittingly committing payroll fraud.<\/em>”<\/p>\n<p>“<em>If you’re frustrated trying to figure out how your business finances are computed, managed and distributed, I\/we can help<\/em>.”<\/p>\n<p><em>“Are you unsure when you should expense a business asset as opposed to capitalizing it, I\/we can help<\/em>.”<\/p>\n<p><strong>Back Up What you Do with Proof Points and References<\/strong><br \/>\nLeading directly on from my last point, always have a proof point to back up what you say you can do.<\/p>\n<p>Think of it as a “don’t just take our word for it” statement. Proof points include customer quotes, your accreditations and continuing education, success stories, case studies, and references. These are all important because they show how your business has solved the problems of others. A few words or paragraphs can convey the customer’s challenge, the solution you delivered, and the results they gained.<\/p>\n<p>This is a great exercise because it focuses you on the customer experience. Use these as stand-alone messages or incorporate the common themes you see into your messaging. You might want to develop a cheat sheet of the services you provide, backed by customer testimonials, so that customers can have a quick visual aid of what you can do for them.<\/p>\n<p><strong>Look for Upsell Opportunities<\/strong><br \/>\nTo become a trusted advisor it’s useful to start with the clients that you’ve already done business with. Review your existing client base and look for opportunities to upsell consultative or broader accounting services. Is there a niche or market that you play in better than others?<\/p>\n<p>While you may not be able to make money in the short term, plan for a no-fee-based business development cycle as you get to know your client’s needs and goals. Looks for ways to make yourself indispensable and find ways to grow your scope of work.<\/p>\n<p>While your client may incur additional fees if they do decide to expand your scope of work, be sure to stress how you can save the company money over and above the fees you charge (back this up with proof points, references and examples wherever possible).<\/p>\n<p><strong>Get Online and Provide Great Content<\/strong><br \/>\nSelling doesn’t just happen face-to-face. Spend some time now and for the long-haul building your reputation online. Make sure your web content is rich – include team bios, create interesting videos, maintain a blog, add testimonials to your site. Search engines need content to index, and content is also key to attracting visitors, encouraging them to share your content socially. Great content can really differentiate you, engage visitors, and improve searchability.<\/p>\n<p>If your struggling for ideas think back to your customer’s pain points and offer tip-based or how-to articles that demonstrate your knowledge of these issues. Interview satisfied customers; solicit guest blogs from partners, affiliates, or industry experts. Reach out to local media to see if you can place an article or give an interview on radio.<\/p>\n<p><strong>Prepare your Business Operations for Growth<\/strong><br \/>\nIn addition to looking for ways to differentiate yourself, preparing for growth also involves an honest assessment of your operational readiness. Do you have sufficient talent on-board to support a broader “trusted advisor” role that may require more dedicated client time? Can your own cash flow tolerate the investment you might need to make to grow your business?<\/p>\n<p>To help you steer a course towards growth, develop an actionable business plan, and mini-plans for each area of your operations.<\/p>\n<p><strong>Refine your Traditional Sales Pitch <\/strong><br \/>\nIf you are to become a trusted advisor, your client will likely want to know a few more things about what they can expect from the working relationship than they would for a one-off engagement. As such, here are a few things to consider adding to your sales pitch:<\/p>\n<ul>\n<li>Be clear about who your client’s point of contact will be. This is a distinct benefit offered by smaller accounting firms, who are less likely to hand off agreed duties to a junior once the scope of work is signed.<\/li>\n<li>Stress your flexibility. For example, are you willing to visit your client’s business for monthly or quarterly reviews? How quickly do you respond to requests, etc.?<\/li>\n<li>How can you go above and beyond the competition?<\/li>\n<li>What specifics can you bring to the table that will help your client stay accountable?<\/li>\n<li>Demonstrate that you speak the same language, drop the buzzwords and financial jargon. You’ll relate a whole lot quicker.<\/li>\n<\/ul>\n<p>At the end of the day, what separates an advisory accountant from a point-services accountant, is passion and a drive for excellence. If your goal is to become an indispensable part of your client’s team, takes steps every day to ensure you are doing everything you can to demonstrate your commitment to their success!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to SBA data, small businesses make up 99.7% of U.S. employer firms. This represents a big market opportunity for &#8230;<\/p>\n","protected":false},"author":7,"featured_media":1215,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,72],"yst_prominent_words":[741,2537,4485,723,719,1248,4482,3037,4481,4419,4484,4113,4111,4483,4463,1097,712,709,4486,2538],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"8 Tips to Grow Your Accounting Business","yoast_meta":[{"name":"description","content":"If you are interested in growing and diversifying your accounting business to become a trusted small business advisor, here are eight considerations that can help take you there."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"8 Tips to Grow Your Accounting Business"},{"property":"og:description","content":"If you are interested in growing and diversifying your accounting business to become a trusted small business advisor, here are eight considerations that can help take you there."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/grow-accounting-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/03\/shutterstock_258622985.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/03\/shutterstock_258622985.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"If you are interested in growing and diversifying your accounting business to become a trusted small business advisor, here are eight considerations that can help take you there."},{"name":"twitter:title","content":"8 Tips to Grow Your Accounting Business"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/03\/shutterstock_258622985.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/grow-accounting-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1099"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=1099"}],"version-history":[{"count":1,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1099\/revisions"}],"predecessor-version":[{"id":2426,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1099\/revisions\/2426"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/1215"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=1099"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=1099"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=1099"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=1099"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}