{"id":11617,"date":"2019-03-06T08:00:00","date_gmt":"2019-03-06T16:00:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10506"},"modified":"2020-11-10T11:55:59","modified_gmt":"2020-11-10T19:55:59","slug":"broker-credit-expert-says-education-key","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/broker-credit-expert-says-education-key\/","title":{"rendered":"This Broker and Credit Expert Says Education is Key"},"content":{"rendered":"<p>Bladimir Mercedes is a business loan broker and credit expert. As the Executive Director of <span style=\"text-decoration: underline;\"><a href=\"https:\/\/americancapitalexpress.com\/\">American Capital Express<\/a><\/span>, he works with individuals and business owners to help them understand their bigger financial picture, repair their credit, and get the business funding they need to take their businesses to the next level.<\/p>\n<p>Specializing in helping entrepreneurs obtain Small Business Administration loans and other forms of strategic working capital, Mercedes is a vocal advocate for transparency and education when it comes to financial matters.<\/p>\n<p>In this recent conversation with Fundbox, he shared how he guides clients to healthier financial habits, his favorite types of businesses to work with, and how he sees the industry changing.<\/p>\n<figure id=\"attachment_10509\" aria-describedby=\"caption-attachment-10509\" style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-10509 \" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/BladimirApril2015-015b.jpg\" alt=\"Bladimir Mercedes, business loan broker and credit repair expert\" width=\"500\" height=\"334\" \/><figcaption id=\"caption-attachment-10509\" class=\"wp-caption-text\"><em>Bladimir Mercedes, Executive Director of American Capital Express<\/em><\/figcaption><\/figure>\n<h3><span style=\"font-weight: bold;\">Fundbox:<\/span> Hello Bladimir, glad to have you with us. Tell us a bit about what you do and how you work with business owners.<\/h3>\n<p><span style=\"font-weight: bold;\">Bladimir Mercedes:<\/span> Absolutely. I am a business loan broker and credit expert. I own a credit repair company and I&#8217;ve had it for about 12 years. I help consumers and business owners deal with pressing issues on their credit reports, some of the mistakes that they made in the past, others&#8217; errors and some stuff as a result of identity theft and unauthorized use of their personal information.<\/p>\n<p>That&#8217;s how I started 12 years ago. I started my business loan broker operation from dealing with business owners who needed working capital and were working through issues with their personal credit.<\/p>\n<h3>You began by focusing on credit repair. Can you clarify how you help with that?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Absolutely. Credit repair is a consumer service, it&#8217;s completely separate from my work as a business loan broker. Sometimes, often because of a lack of education, people just don&#8217;t understand how credit reporting works and they make mistakes. Identity theft issues can also cause damaged credit. Identity theft is a big problem.<\/p>\n<p>We offer credit repair as a service. We review people&#8217;s credit reports and identify errors and negative information that&#8217;s affecting them. We can help clients with the disputing process for correcting errors, and we coach them through rebuilding credit. It&#8217;s a very popular service.<\/p>\n<h3>In your role as a loan broker, you work with a lot of different types of businesses. Can you talk about what some of the bigger challenges are that you face when working with small business owners?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Absolutely. One of the biggest challenges that we face when working with the small business owners is really a lack of education about how to qualify [for different products]. For example, sometimes, we need to show clients why they might not qualify for a particular lower rate loan product. That can be very challenging because a lot of times, clients just don&#8217;t know the factors that may be preventing them from getting something like an SBA loan.<\/p>\n<p>One of my challenges is to educate people on the fundamentals, so that they understand why are they getting what they&#8217;re getting.<\/p>\n<h3>What&#8217;s your process like for helping people with this? How do you work with them?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">: <\/span>I evaluate many different aspects of their business and their finances with them. I review their credit reports when I have the opportunity and then we review the cash flow of the business, make sure they have their taxes up to date, and look at their debt service coverage ratio.<\/p>\n<p>We review a lot together. I deal a lot with SBA loans, and you need to provide a lot of information about your business in order to qualify for those loans. We review as many aspects of their business as we can.<\/p>\n<h3>Are there particular industries or types of businesses that you focus on in your business?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> We’re not industry-specific. The SBA doesn’t have a lot of restrictions and I pretty much work with any industry, but there are some that are my favorites. For example, I like small health clinics and restaurants, and I like trucking companies when they have five or more vehicles. Those are some of my favorite businesses to work with.<\/p>\n<h3>What is it about those types of businesses that you find most interesting?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> I’m very result-oriented: I’ve had tons of success funding them. Also, I find them easy to work with, especially certain kinds of restaurants [such as] those that have half a million dollars or more in revenue and have been around for three years or more. When it comes to small health clinics, I have had a lot of success helping them, either getting them short-term working capital SBA loans regardless of their size.<\/p>\n<h3>Have you noticed any other trends among your clients?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> One of the trends that I’ve noticed is that people seem to be getting a bit more educated about short-term lending. When I started doing this almost five years ago, it wasn’t the case.<\/p>\n<p>When I started in the business, I noticed that many of my clients weren’t familiar with [options like] cash advances, for example, with weekly payments and daily payments. That created both opportunities and issues. These days, in general, people seem better informed.<\/p>\n<h3>Why do you think that is?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> I think it’s the way that information has been spread and the way that lenders are sharing the information. It’s partly thanks to fintech companies like Fundbox and others that have contributed to that spread of information. That helps. Almost all the lenders now have an online presence. That&#8217;s the reason why people are more knowledgeable right now. If [they] can only qualify for certain short-term loans, now clients already know what that means.<\/p>\n<h2>One client: From overdraft fees to prosperity<\/h2>\n<h3>Are there any great success stories that come to mind where you have been really happy to be able to help someone achieve a particular goal using financing?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> It&#8217;s funny that you ask. There was one client who was having trouble managing their bank account. I was able to get them a higher-risk loan for around $15,000. That&#8217;s all they could get. I coached them on how to manage their funds better to prevent overdraft charges and pay fewer fees since previously, they were paying ridiculous amounts; it was thousands of dollars a year that they were paying in overdraft fees.<\/p>\n<p>Long story short, she took my advice. Three months later, I was able to get that same client a loan for about $50,000, then later I was able to help her get an SBA loan for $345,000.<\/p>\n<p>It’s an unbelievable success story. She’s still a client today. Now, we&#8217;re looking to buy the building where she operates. She has not bounced a single payment ever since I began coaching her. She has prospered with her bakery and even opened a second location. Now, we&#8217;re looking to buy the building from her landlord.<\/p>\n<h3>Sounds like her journey has been very positive. Would you recommend that business owners consider alternative financing options for getting funding rather than just going to their bank and saying they need a business loan?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Well, most of the traditional banks are not lending. It&#8217;s very tough to secure loans with your traditional banks. Also, the amount of documentation banks want can make it very painful. Fintechs are really good options.<\/p>\n<p>We really know things have changed in the way lending is being done. It&#8217;s inspiring other bigger lenders to learn from the success that fintechs are having. To answer your question, yes, because the big guys are usually not lending, not enough to meet the needs of small business owners.<\/p>\n<h3>What do you think business owners should know when they&#8217;re choosing a loan broker to work with them? Are there any particular questions that they should ask to make sure that they&#8217;re choosing the right person to work with?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Yes, absolutely. It&#8217;s actually pretty basic. Just make sure that broker that you’re working with is presenting the best option for you, not the best option for them. That could easily translate to a loan as transparent as an SBA loan where you already know how much the broker is making, you know their compensation and you know that you&#8217;re getting the best possible terms.<\/p>\n<p>Ask questions and just make sure that you’re getting the best option that you can qualify for. Sometimes, it’s hard to figure that out because you have to do a lot of research to make sure that you’re not being presented a mediocre offer.<\/p>\n<h3>Would you advise them to ask their broker, &#8220;Hey, is this really the best rate that I can qualify for and why?&#8221;<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">: <\/span> Absolutely, that’s always a fair question. I get that question asked all the time and I don’t get offended when somebody asks. I always try to present the client the best possible option, even if that is the least compensation and the most work for me.<\/p>\n<h2>On partnering with Fundbox<\/h2>\n<h3>What has it been like so far to partner with Fundbox?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> So far, I actually feel like I haven’t pushed Fundbox to even 15% of the potential that I can do it with. I&#8217;ve built some automation, but I feel like I can do a lot more. The relationship got off a good start. I’ve worked with Fundbox to fund quite a few deals.<\/p>\n<p>The technology is on point, the systems that you guys have in place are on point, the customer service is on point.<br \/>\nI like the reporting and the dashboard that gives me access to what my clients are getting. I think you guys have done a phenomenal job. I have very little feedback as to what you can do to improve.<\/p>\n<h3>That’s great to hear! To wrap things up today, do you have any last words of advice on either choosing the right financing or improving your credit?<\/h3>\n<p><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Absolutely. When it comes to improving your credit, paying on time is extremely important. Always make sure that you know what your credit score is. Personal credit is used to determine a lot of things when it comes to lending, both for your business and at the personal level.<\/p>\n<p>The most fundamental thing, when you’re working with a broker, is are you getting the best possible type of loan that you can qualify for? It’s not a question about whether that broker offers it or not, it&#8217;s whether you are getting the best loan out there. That’s a good question for anyone working with a broker to ask.<\/p>\n<hr \/>\n<p><span style=\"font-style: italic;\"><a href=\"https:\/\/www.linkedin.com\/in\/bladmercedes\/\">Bladimir Mercedes<\/a> is a Premier Partner of Fundbox, after connecting 25 of his clients with Fundbox credit. Fundbox Premier Partners receive a range of benefits including a lifetime residual commission and exclusive monthly bonuses. To learn more about partnering with Fundbox, visit <\/span><span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/fundbox.com\/partners\/\">our partner page<\/a><\/span><span style=\"font-style: italic;\">, or ask your partner manager about becoming a Premier Partner.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bladimir Mercedes is a business loan broker and credit expert. As the Executive Director of American Capital Express, he works &#8230;<\/p>\n","protected":false},"author":61,"featured_media":11468,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,11547,426],"yst_prominent_words":[10494,10505,10518,723,1704,10526,10527,719,739,10549,10853,10851,10852,10850,10668,10669,10670,10675,709,10792],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"This Broker and Credit Expert Says Education is Key | Fundbox Blog","yoast_meta":[{"name":"description","content":"Bladimir Mercedes is a business loan broker and credit expert. As the Executive Director of American Capital Express, he works with individuals and business owners to help them understand their bigger financial picture, repair their credit, and get the business funding they need to take their businesses to the next"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"This Broker and Credit Expert Says Education is Key | Fundbox Blog"},{"property":"og:description","content":"Bladimir Mercedes is a business loan broker and credit expert. As the Executive Director of American Capital Express, he works with individuals and business owners to help them understand their bigger financial picture, repair their credit, and get the business funding they need to take their businesses to the next"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/broker-credit-expert-says-education-key\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/shutterstock_467781959.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/shutterstock_467781959.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"649"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Bladimir Mercedes is a business loan broker and credit expert. As the Executive Director of American Capital Express, he works with individuals and business owners to help them understand their bigger financial picture, repair their credit, and get the business funding they need to take their businesses to the next"},{"name":"twitter:title","content":"This Broker and Credit Expert Says Education is Key | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/03\/shutterstock_467781959.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/broker-credit-expert-says-education-key\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11617"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=11617"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11617\/revisions"}],"predecessor-version":[{"id":14175,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11617\/revisions\/14175"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/11468"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=11617"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=11617"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=11617"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=11617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}