{"id":11615,"date":"2019-02-19T10:24:12","date_gmt":"2019-02-19T18:24:12","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=10488"},"modified":"2020-11-10T11:54:07","modified_gmt":"2020-11-10T19:54:07","slug":"humans-fundbox-tom-goldschmiedt","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/humans-fundbox-tom-goldschmiedt\/","title":{"rendered":"Humans of Fundbox: Tom Goldschmiedt"},"content":{"rendered":"<p>In our series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company.<\/p>\n<p>Today, meet Tom Goldschmiedt, Human Resources People Operations Manager at Fundbox in San Francisco. Born in Israel and now a proud San Franciscan, Tom is a longterm Fundboxer who loves working with people and helping others reach their full potential.<\/p>\n<p>In this Q&amp;A, she shares her journey from law school to finding her niche in human resources and operations, and her perspective on the company’s mission.<\/p>\n<figure style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/61e16313-cb69-4c49-b0a8-d163481967c4_Headshot20Tom20Gold.jpg\" alt=\"\" width=\"500\" height=\"564\" \/><figcaption class=\"wp-caption-text\"><em>Tom Goldschmiedt, People Operations Manager at Fundbox. Photo: Ashley Batz.<br \/><\/em><\/figcaption><\/figure>\n<h3>Fundbox: In 2 or 3 sentences, can you describe your role at Fundbox?<\/h3>\n<p><strong>Tom Goldschmiedt:<\/strong> I’m in charge of everything related to the lifecycle of an employee at Fundbox. That includes everything from the onboarding process, to implementing employee development programs, company events, employee relations as well as creating and implementing any related policies. In addition, I also oversee the office’s facilities. I see my role as a liaison between the employees and the company, someone who can help bring out the employee’s voice, while also finding a happy medium that fits the company’s needs.<\/p>\n<h3>What’s your typical day at work like?<\/h3>\n<p><strong>TG:<\/strong> I’m usually juggling multiple tasks, employee problem-solving, and working on ongoing projects. For example, I recently revamped our new hire onboarding process to include different department overviews and coordinating with the manager to tailor their training plan to a specific role. These days I’m also working on our upcoming employee comp evaluation cycle by collecting market data and getting together with managers and execs to make sure we offer fair pay.<\/p>\n<p>On the facilities side, just recently I led an office expansion to a new floor in our building, which involved months of lease negotiations and communication with different vendors, including designers, IT and more. No matter the day, I stay busy!<\/p>\n<h3>You’re nearly an original Fundboxer—how long have you been at the company? What has kept you here over the years?<\/h3>\n<p><strong>TG:<\/strong> I’ve been with Fundbox for almost four years now, I started as an Office Manager and was the 8th employee in the San Francisco office. I’ve really enjoyed seeing the company grow and taking a part in making it to what it is today. I love my job and how I can have an impact on people’s day to day lives in the office, especially when we were a very small startup.<\/p>\n<p>I’m the type of person who likes to keep active and busy, and through these past four years there has never been a dull moment. I always feel like I can contribute as we grow our team, and I really enjoy that.<\/p>\n<h3>Did you know from a young age what you wanted to do for a living, or discover it as you went along? What did you study in school?<\/h3>\n<p><strong>TG:<\/strong> When I was younger, I didn’t know what I wanted to do when I grew up. After my military service (which is mandatory for everyone in Israel), I was excited to go to school. I chose to go to law school, but after finishing school, an internship, and passing my bar exams, I entered the corporate litigation field and quickly learned that I didn’t enjoy the practice as much as the theory.<\/p>\n<p>My next step was business school and a career change, when the opportunity to relocate to San Francisco came up through my husband’s work. We decided to go for it! I was interested in Operations roles and soon found an Office Manager role at Fundbox.<\/p>\n<p>I immediately felt a sense of belonging at the company. Israel is a small place, and we Israelis tend to find each other. For me, being from Israel and working at a half-Israeli company helps me feel a bit closer to home.<\/p>\n<p>As far as the work goes, I also found that working with people and managing operations came naturally to me. My transition to Human Resources Manager also felt like a natural next step and I enjoy learning and growing in the profession with every new experience.<\/p>\n<p>Today, I see how working as a lawyer pushed me to “take sides” and I never loved the feeling of fighting “against” the other side. In contrast, working in HR is exactly the opposite. It requires me to understand all sides and facilitate win-win situations, to help ensure more communication and satisfaction for everyone.<\/p>\n<h3>Do you have any personal or family small business connection that helps you engage with the Fundbox mission and customers?<\/h3>\n<p><strong>TG:<\/strong> I do! My dad has owned a furniture manufacturing store in Tel Aviv for about 30 years. I know firsthand from watching him, how difficult it can be for small business owners to depend on consistent sales to stay afloat. It’s a day-by-day struggle. That perspective definitely helps me connect with Fundbox’s mission on a personal level.<\/p>\n<figure style=\"width: 500px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/11da4b74-f264-4cf4-826e-8c99f26bcf97_Fundbox_AB-4006.jpg\" alt=\"\" width=\"500\" height=\"333\" \/><figcaption class=\"wp-caption-text\"><em>Tom Goldschmiedt shares a laugh with colleague Katie Silverman in the San Francisco Fundbox office. Photo: Ashley Batz.<\/em><\/figcaption><\/figure>\n<h3><span style=\"font-style: italic;\"> <\/span><br \/>\nSince you’ve been at the company longer than most, can you share any good stories about what changes you’ve experienced as the company grew?<\/h3>\n<p><strong>TG:<\/strong> Fundbox is very different today than it was when I joined. Now, we’re close to 200 employees. I had the privilege of joining the company early and seeing how it started as an extension of the Tel Aviv office and grew its own roots.<\/p>\n<p>With that said, I believe that the core values of Fundbox are still the same: each of us has a sense of ownership of our mission.<\/p>\n<h3>As a company, we’re interested in inclusion. Specifically, we care about using technology innovations to expand financial inclusion, making new opportunities available to more people. Do you think it’s important for financial firms to have a social mission? Why?<\/h3>\n<p><strong>TG:<\/strong> My strongest connection to the Fundbox mission is through our people. The core of the business is the people that work in it, and my job is to support them while they work towards their goals. I think it’s important for a financial firm to have a social mission because as a firm who’s providing such a valuable resource as business capital, we have a lot of responsibility and opportunities to have an impact on businesses across the country.<\/p>\n<p>Diversity is something we value and spend a lot of time thinking about. As an Israeli coming to work in an American environment, I can very much appreciate how these different perspectives balance each other and how cross-functional and diverse teams bring out the best solutions.<\/p>\n<h3>When you interview people to join Fundbox, what are some of the biggest things you’re looking for in a great candidate?<\/h3>\n<p><strong>TG:<\/strong> To be successful at Fundbox, you have to be a true owner and have a great sense of commitment. This person doesn’t only think about what the company can give them, but what they can give to the company.  We’re looking for someone who will not view their time here as “just a job” but will instead look for extra meaning and strive to keep learning and growing.<\/p>\n<p>What we do has a direct impact on thousands of small businesses, and also an indirect impact on their vendors and customers. For me, it’s a great feeling knowing we’re working towards something that positively changes people’s lives.<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-style: italic;\">Want to work with Tom at Fundbox? <\/span><span style=\"font-style: italic; text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/careers\">Check out our Careers page.<\/a><\/span><\/p>\n<p><em>Want more Humans of Fundbox?<\/em><\/p>\n<ul>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/\">Meet Prashant Fuloria, Chief Operations Officer<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/\">Meet Gibson Holland, Sync Support Manager<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/\">Meet Emad ElShawa, Business Operations Manager<\/a><\/em><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-robin-macpherson\/\"><em>Meet Robin MacPherson, Software Engineer<\/em><\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>In our series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make &#8230;<\/p>\n","protected":false},"author":61,"featured_media":11465,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,326],"yst_prominent_words":[11435,757,838,10626,10087,10655,10657,10088,10699,10091,10084,11433,11432,11431,11434,10713,10755,2355,10786,10810],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"Humans of Fundbox: Tom Goldschmiedt | Fundbox Blog","yoast_meta":[{"name":"description","content":"In our series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. Today, meet Tom Goldschmiedt, Human Resources People Operations Manager at Fundbox in San Francisco. Born in Israel and now a proud San Franciscan, Tom is a longterm Fundboxer who loves working"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Humans of Fundbox: Tom Goldschmiedt | Fundbox Blog"},{"property":"og:description","content":"In our series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. Today, meet Tom Goldschmiedt, Human Resources People Operations Manager at Fundbox in San Francisco. Born in Israel and now a proud San Franciscan, Tom is a longterm Fundboxer who loves working"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/humans-fundbox-tom-goldschmiedt\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/shutterstock_239634340.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/shutterstock_239634340.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In our series, Humans of Fundbox, we’re taking a look at some of the diverse and hardworking folks who make up our company. Today, meet Tom Goldschmiedt, Human Resources People Operations Manager at Fundbox in San Francisco. Born in Israel and now a proud San Franciscan, Tom is a longterm Fundboxer who loves working"},{"name":"twitter:title","content":"Humans of Fundbox: Tom Goldschmiedt | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/02\/shutterstock_239634340.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/humans-fundbox-tom-goldschmiedt\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11615"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=11615"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11615\/revisions"}],"predecessor-version":[{"id":14167,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11615\/revisions\/14167"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/11465"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=11615"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=11615"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=11615"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=11615"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}