{"id":11862,"date":"2019-05-07T07:56:00","date_gmt":"2019-05-07T14:56:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=11862"},"modified":"2022-06-24T13:34:52","modified_gmt":"2022-06-24T20:34:52","slug":"28-must-hear-podcasts-business-owners","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/28-must-hear-podcasts-business-owners\/","title":{"rendered":"29 Must-Hear Podcasts for Business Owners"},"content":{"rendered":"<p>When’s the last time you listened to a truly great podcast?<\/p>\n<p>Business owners like you have a lot to gain by becoming regular listeners to relevant podcasts. Not only can podcasts expose you to new ideas and help you learn new things, the best ones are also highly entertaining, and you shouldn’t be surprised if you start belly-laughing while listening to one of these.<\/p>\n<p>In honor of <a href=\"https:\/\/www.sba.gov\/national-small-business-week\">Small Business Week<\/a>, we’ve put together a mega-list of 29 podcasts that business owners can learn a lot from. To help you find podcasts you might not be familiar with, we opted against including super-popular podcasts like <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.npr.org\/podcasts\/510289\/planet-money\">Planet Money<\/a><\/span>, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.npr.org\/podcasts\/510313\/how-i-built-this\">How I Built This<\/a><\/span>, or <span style=\"text-decoration: underline;\"><a href=\"https:\/\/tim.blog\/podcast\/\">The Tim Ferriss Show<\/a><\/span> on this list.<\/p>\n<p>Whether you’re a podcast aficionado or you’ve never gotten hooked on one before, you stand to find insightful tips that’ll help you become a more effective executive by listening to any number of the following podcasts. To make things easier, we’ve separated the list into five categories: <strong>finance, real business stories, entrepreneurs, how-to, and marketing. <\/strong><\/p>\n<p>Let’s jump right in.<\/p>\n<h2><span style=\"font-weight: bold;\">Finance Podcasts<\/span><\/h2>\n<h3><span style=\"font-weight: bold;\">1. Entrepreneurs on Fire<\/span><\/h3>\n<p>Everything big must first be small. On <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.eofire.com\/\">Entrepreneurs on Fire<\/a><\/span>, host Jon Lee Dumas interviews entrepreneurs like Tim Ferriss, Barbara Corcoran, and Gary Vaynerchuk, asking them to reveal their biggest failures before diving into their tips for success. To date, Dumas has interviewed more than 2,100 entrepreneurs. New podcasts pop up a few times a week.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/ec64a665-3c8d-49db-96b5-a0e8bc6e4ec1_Fire20Nation20podcast.png\" alt=\"Fire Nation podcast\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">2. Smart Passive Income<\/span><\/h3>\n<p>Passive income: It’s making money when you sleep. If that sounds like an awesome way to make a living, check out Pat Flynn’s excellent podcast, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.smartpassiveincome.com\/\">Smart Passive Income<\/a><\/span>. Flynn shares his own advice on the podcast. But he also welcomes all sorts of guests—like industry pundits and successful entrepreneurs. New episodes of Smart Passive Income arrive each week; to date, Flynn has recorded more than 365 podcasts.<\/p>\n<h3><span style=\"font-weight: bold;\">3. HerMoney<\/span><\/h3>\n<p>Navigating the world of finance is difficult because managing money is complex. Jean Chatzky, host of the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.hermoney.com\/t\/podcasts\/\">HerMoney<\/a><\/span> podcast, attempts to remove the complexity from the equation with a podcast that is “for women, by women, about money.” Chatzky explores money challenges that are unique to women, as well as common challenges women face in their personal and professional lives.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/5a729ad4-a21e-40b1-a6a4-7c5796545274_HerMoney20Podcast.png\" alt=\"hermoney podcast\" width=\"1302\" height=\"840\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">4. Financial Freedom<\/span><\/h3>\n<p>When he was in his mid-20s, Grant Sabatier has $2.26 left in his bank account. Fast-forward five years and Sabatier’s net worth grew to more than $1 million. To help other people gain financial independence, Sabatier launched a podcast in 2018 called <span style=\"text-decoration: underline;\"><a href=\"https:\/\/millennialmoney.com\/podcasts\/\">Financial Freedom<\/a><\/span>. The podcast—which includes tips on personal finance, investing, side hustling, real estate and more—has already been downloaded nearly 2 million times.<\/p>\n<h3><span style=\"font-weight: bold;\">5. Stacking Benjamins<\/span><\/h3>\n<p>Since 2012, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.stackingbenjamins.com\/\">Stacking Benjamins<\/a><\/span> has used humor to help listeners get a better grasp on their personal and business finances. Created and co-hosted by Joe Saul-Sehy, the podcast serves as a primer into many ideas related to money management and investing. Stacking Benjamins includes conversations with people who’ve made bad choices with money to help you avoid making the same mistakes.<\/p>\n<h3><span style=\"font-weight: bold;\">6. Afford Anything<\/span><\/h3>\n<p>Wouldn’t it be nice to have the financial independence needed to be able to buy whatever you wanted to buy? Paula Pant launched her <span style=\"text-decoration: underline;\"><a href=\"https:\/\/affordanything.com\/podcast\/\">Afford Anything<\/a><\/span> podcast to educate listeners on various financial topics, with the ultimate goal of achieving “FIRE”—financial independence, retire early. Pant helps listeners like you make smarter decisions about time and money to make it easier to achieve the lifestyle you hope for. New episodes are released twice a week.<\/p>\n<h2>Real <span style=\"font-weight: bold;\">Business Stories<\/span><\/h2>\n<h3><span style=\"font-weight: bold;\">7. The Startup Chat<\/span><\/h3>\n<p>Starting a business is hard work. Starting a <span style=\"font-style: italic;\">successful <\/span>business is even harder. Entrepreneurs Steli Efti and Hiten Shah created <span style=\"text-decoration: underline;\"><a href=\"https:\/\/thestartupchat.com\/\">The Startup Chat<\/a><\/span>, a podcast that explores all kinds of problems and common issues entrepreneurs face as they scale their companies. Learn about fundraising mistakes, how to work with graphic designers, how to act under pressure, and more.<\/p>\n<h3><span style=\"font-weight: bold;\">8. Brown Ambition<\/span><\/h3>\n<p>Journalist Mandi Woodruff and financial advisor Tiffany Aliche created the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/brownambitionpodcast.com\/\">Brown Ambition<\/a><\/span> podcast to discuss all aspects of the business world, highlighting podcasts with stories about their own successes and failures. Tune in to learn about things like student loan forgiveness and how to manage your credit history as well as incredible stories like how Aliche saved $100,000 on taxes. New episodes drop each week.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/7ae49275-8819-4f66-9d45-2aca5689046a_Brown20Ambition20podcast.png\" alt=\"Brown Ambition podcast\" width=\"1312\" height=\"883\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">9. HBR IdeaCast<\/span><\/h3>\n<p>The fine folks over at the <span style=\"font-style: italic;\">Harvard Business Review<\/span> have a podcast of their own called <span style=\"text-decoration: underline;\"><a href=\"https:\/\/hbr.org\/2018\/01\/podcast-ideacast\">HBR IdeaCast<\/a><\/span>, which, to date, has aired over 675 episodes. You probably have a pretty decent idea of what you can expect to hear on this podcast. Recent episode titles include “The Right Way to Get Your First 1,000 Customers”, “Why U.S. Working Moms Are So Stressed – And What To Do About It”, and “A Theoretical Physicist (and Entrepreneur) on Why Companies Stop Innovating.”<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/ec4bd639-7ac1-4939-8d83-244aa4cd1cfe_HBR20Ideacast20podcast.png\" alt=\"HBR Ideacast podacst\" width=\"1302\" height=\"892\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">10. Outside In<\/span><\/h3>\n<p>Hosted by Charles Trevail, <span style=\"text-decoration: underline;\">Outside In<\/span> shines a light on some of the most influential companies in the world and tries to unpack their customer-centric philosophies into actionable tips businesses like yours can put into practice.<\/p>\n<h3><span style=\"font-weight: bold;\">11. Business Wars<\/span><\/h3>\n<p>According to some, business is war. To win, you need to beat your competitors. The <span style=\"text-decoration: underline;\"><a href=\"https:\/\/wondery.com\/shows\/business-wars\/\">Business Wars<\/a><\/span> podcast was created by David D. Brown to examine high-profile competitions—like Coke vs. Pepsi, Nike vs. Adidas, McDonald’s vs. Burger King and Netflix vs. HBO, among others. Business Wars takes a deep dive into each of these battles, which are usually covered over the course of several episodes.<\/p>\n<h3><span style=\"font-weight: bold;\">12. The $100 MBA Show<\/span><\/h3>\n<p>Hosted by Omar Zenhom and Nicole Baldinu, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/100mba.net\/show\/\">The $100 MBA Show<\/a><\/span> offers actionable tips that you can put into practice right away. Instead of droning on and on about the same topic, this podcast aims to pack a lot of punch into a short period of time—eliminating the fluff so you can focus on the choice nuggets and get back to growing your business.<\/p>\n<h3><span style=\"font-weight: bold;\">13. Weird Work<\/span><\/h3>\n<p>Some people are doctors. Other people are bartenders. Still other people are marketing professionals. Then there are all sorts of jobs we rarely think about—like being a comic book inker, a professional hand model, or someone who repairs vintage arcade games. In case the name doesn’t give it away, the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.hubspot.com\/weird-work-podcast\">Weird Work<\/a><\/span> podcast—which is hosted by HubSpot—explores the stranger jobs people have. It’s definitely worth checking out.<\/p>\n<h2>Podcasts for <span style=\"font-weight: bold;\">Entrepreneurs<\/span><\/h2>\n<h3><span style=\"font-weight: bold;\">14. Mixergy<\/span><\/h3>\n<p>To reach your full potential as an entrepreneur, you need to be exposed to all kinds of ideas so you can keep learning new things. <span style=\"text-decoration: underline;\"><a href=\"https:\/\/mixergy.com\/\">Mixergy<\/a><\/span> seeks to be your go-to source for all of these ideas. Hosted by Andrew Warner, the Mixergy podcast features interviews with big-time movers and shakers—like Dropbox’s Drew Houston and Reddit’s Alexis Ohanian. To date, more than 1,000 episodes of Mixergy have aired.<\/p>\n<h3><span style=\"font-weight: bold;\">15. Unthinkable<\/span><\/h3>\n<p>Jay Acunzo believes that most B2B and business content is boring. Everyone probably agrees with that statement at least a bit. But instead of complaining about the state of content, Acunzo decided to do something about it. He created <span style=\"text-decoration: underline;\"><a href=\"http:\/\/jayacunzo.com\/podcasts\">Unthinkable<\/a><\/span>, an entrepreneur-focused podcast that seeks to convey the emotions we experience over the course of our careers—in an entertaining and engaging way. (Acunzo also hosts <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.stitcher.com\/podcast\/nextview-ventures\/traction\">Traction<\/a><\/span>, a podcast that focuses on how startups begin.)<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/d74ce774-604a-43fa-9445-1fd4c3a430e3_Unthinkable20podcast.png\" alt=\"Unthinkable podcast\" width=\"1242\" height=\"730\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">16. Rise and Grind<\/span><\/h3>\n<p>Time is the great equalizer. No matter how hard-working, wealthy, or talented we are, we are all working with 24 hours every day. Daymond John, founder of FUBU and a star of <span style=\"font-style: italic;\">Shark Tank<\/span>, created a podcast called <span style=\"text-decoration: underline;\">Rise and Grind<\/span> to shine a light on how some of the most effective entrepreneurs, musicians, and athletes are able to seemingly cram more into an average day than the rest of us.<\/p>\n<h3><span style=\"font-weight: bold;\">17. Inside LaunchStreet<\/span><\/h3>\n<p>How do top innovators and entrepreneurs make good decisions, increase creativity, and get more done? That’s what the <span style=\"text-decoration: underline;\">Inside LaunchStreet<\/span> podcast sets out to explore. Hosted by Tamara Ghandour, Inside LaunchStreet releases a new episode each week designed to provide actionable tips you can immediately apply to your everyday life. To date, more than 1,800 episodes have aired.<\/p>\n<h3><span style=\"font-weight: bold;\">18. RISE Together<\/span><\/h3>\n<p>Husband-and-wife duo Dave and Rachel Hollis launched a podcast called <span style=\"text-decoration: underline;\">RISE Together<\/span> to help couples reach their full potential in their personal and professional lives. The podcast debuted in July 2018 and is published weekly—however, it appears the couple is on a bit of a hiatus at the time of this writing. Still, it’s worth checking out their library to see if there’s anything that speaks to you—particularly if you run a business with your partner.<\/p>\n<h3>19. Being Boss<\/h3>\n<p>Billed as a podcast for creative entrepreneurs, <a href=\"https:\/\/beingboss.club\/podcast\">Being Boss<\/a> is hosted by authors Emily Thompson and Kathleen Shannon. The podcast speaks specifically to small business owners, new or aspiring entrepreneurs, and freelancers hoping to scale their business. Topics include productivity, habits, inspiration, goal setting, and ways to get you closer to living the life of your dreams while doing what you love.<\/p>\n<h2><span style=\"font-weight: bold;\">How-To Podcasts<\/span><\/h2>\n<h3><span style=\"font-weight: bold;\">20. The Growth Show<\/span><\/h3>\n<p><span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.hubspot.com\/podcasts\/the-growth-show\">The Growth Show<\/a><\/span> is a podcast from HubSpot that explores how, specifically, people can transform their ideas into bona fide businesses. Hosted by Meghan Keaney Anderson, HubSpot’s vice president of marketing, the podcast highlights real-world stories of how people have built their dreams.<\/p>\n<h3><span style=\"font-weight: bold;\">21. The Science of Social Media<\/span><\/h3>\n<p>For most businesses, social media is a critical marketing and sales tool. But you can’t just expect to open up a Twitter account and get great results. Enter the team at Buffer. Their podcast—<span style=\"text-decoration: underline;\"><a href=\"https:\/\/buffer.com\/podcast\">The Science of Social Media<\/a><\/span>—explores tips, tricks, trends, and more that are designed to help you take your social media game to the next level.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/38e33c7d-c133-48ca-94d0-995b82f69128_Science20social20media20podcast.png\" alt=\"Science of Social Media podcast\" width=\"1262\" height=\"753\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">22. The Indie Hackers<\/span><\/h3>\n<p>It’s one thing to say “I want to be an entrepreneur.” Turning that statement into reality—and being successful—is a different beast. Hosted by Courtland Allen, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.indiehackers.com\/podcast\">The Indie Hackers<\/a><\/span> podcast features conversations with startup founders that focus on what they’re actually doing to take their businesses to the next level.<\/p>\n<h3><span style=\"font-weight: bold;\">23. Hack the Entrepreneur<\/span><\/h3>\n<p>Interested in building an online business? Listen to Jon Nastor’s <span style=\"text-decoration: underline;\"><a href=\"https:\/\/hacktheentrepreneur.com\/podcasts\/\">Hack the Entrepreneur<\/a><\/span> podcast and learn how to develop an entrepreneurial mindset—as well as tips that’ll teach you how to succeed with your digital business. Is your idea a legit business? Or is it more of a side hustle? Listen to Hack the Entrepreneur to find out.<\/p>\n<h3><span style=\"font-weight: bold;\">24. The Hustle and Flowchart<\/span><\/h3>\n<p>How do you drive traffic to your site? How do you raise brand awareness? How do you build repeatable processes for your business? Find out the answers to these questions and more on <a href=\"https:\/\/evergreenprofits.com\/category\/the-podcast\/\">The Hustle &amp; Flowchart Podcast<\/a>, hosted by Matt Wolfe and Joe Fier. Episode titles include “How 80\/20 Thinking Applies to Absolutely Everything in Life”, “Tactics And Formulas To Write Amazing Sales Copy” and “Outsourcing the Scaling of Your Business.”<\/p>\n<h2><span style=\"font-weight: bold;\">Marketing Podcasts<\/span><\/h2>\n<h3><span style=\"font-weight: bold;\">25. Marketing School<\/span><\/h3>\n<p>Want to sharpen your marketing skills, fast? Then you <span style=\"font-style: italic;\">need <\/span>to subscribe to the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/marketingschool.io\/\">Marketing School<\/a><\/span> podcast, hosted by Neil Patel and Eric Siu. The podcast covers all facets of marketing—everything from how many blogs you should write each week and whether podcast advertising actually works to instances where SEO doesn’t matter and when a freemium business model might make sense. With a new short-and-sweet episode every day—and nearly 1,000 episodes to date—you won’t run out of material any time soon.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/92cc340f-7ec4-45d9-8dc7-b0026baa4da3_Marketing20School20podcast.png\" alt=\"Marketing School podcast\" width=\"1299\" height=\"655\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">26. Copyblogger<\/span><\/h3>\n<p>Getting your online business to the next level requires good marketing—and lots of it. The fine folks over at <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.copyblogger.com\/category\/podcasts\/\">Copyblogger<\/a><\/span> have a great podcast that will help you become a better copywriter, a better podcaster, and a better content marketer.<\/p>\n<h3><span style=\"font-weight: bold;\">27. Duct Tape Marketing<\/span><\/h3>\n<p>Every handyman knows how important duct tape is. The <span style=\"text-decoration: underline;\"><a href=\"https:\/\/ducttapemarketing.com\/about\/duct-tape-marketing-podcast\/\">Duct Tape Marketing Podcast<\/a><\/span>, hosted by John Jantsch, seeks to provide the same utility to small business owners like you. The podcast explores all kinds of business topics with a strong emphasis on marketing. Guests include big names like <span style=\"text-decoration: underline;\"><a href=\"https:\/\/ducttapemarketing.com\/leaders-eat-last\/\">Simon Sinek<\/a><\/span> and <span style=\"text-decoration: underline;\"><a href=\"https:\/\/ducttapemarketing.com\/pre-suasion\/\">Dr. Robert Cialdini<\/a><\/span>.<\/p>\n<h3><span style=\"font-weight: bold;\">28. Marketing Over Coffee<\/span><\/h3>\n<p><span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.marketingovercoffee.com\/\">Marketing Over Coffee<\/a><\/span>, the brainchild of John J. Wall and Christopher S. Penn, examines traditional and new approaches to marketing to help entrepreneurs get a better understanding of the myriad of marketing tactics they can employ to get better business results. New episodes appear every week and each of them runs about 20 minutes long, so you don’t have to carve out huge chunks of your day to learn something new.<\/p>\n<h3><span style=\"font-weight: bold;\">29. Perpetual Traffic<\/span><\/h3>\n<p>Wouldn’t it be great if millions of people went to your business’ website every day? That might not be possible, but the folks over at DigitalMarketer are doing their best to help you get there with a podcast called <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.digitalmarketer.com\/podcast\/perpetual-traffic\/\">Perpetual Traffic<\/a><\/span> that’s hosted by Ralph Burns and Molly Pittman. The podcast teaches listeners everything they need to know about driving traffic to their sites through services like Facebook and Instagram. New episodes are released each week. Sign up to stay on top of every development in the world of paid traffic.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/c51381f4-f96c-4a38-b738-5183c753da41_Perpetual20traffic20podcast.png\" alt=\"Perpetual Traffic podcast\" width=\"1312\" height=\"849\" \/><\/p>\n<p>While you might not need to subscribe to <span style=\"font-style: italic;\">every <\/span>single one of these podcasts, the fact that you made it this far proves that you’re interested in gaining more knowledge and becoming a more effective entrepreneur.<\/p>\n<p>Did we miss one of your favorites? Feel free to <span style=\"text-decoration: underline;\"><a href=\"https:\/\/twitter.com\/fundbox\">Tweet at us @fundbox<\/a><\/span> and tell us what else belongs on this list!<\/p>\n<p>Poke around this list and test out some new podcasts. You’re certain to find at least a couple you love.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When’s the last time you listened to a truly great podcast? Business owners like you have a lot to gain &#8230;<\/p>\n","protected":false},"author":14,"featured_media":11873,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72],"yst_prominent_words":[11363,723,719,11365,11351,2751,11350,11367,808,11358,11352,11354,8108,11368,8109,11356,11360,11349,794,11361],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"29 Must-Hear Podcasts for Business Owners | Fundbox Blog","yoast_meta":[{"name":"description","content":"When’s the last time you listened to a truly great podcast? Business owners like you have a lot to gain by becoming regular listeners to relevant podcasts. Not only can podcasts expose you to new ideas and help you learn new things, the best ones are also highly entertaining, and you shouldn’t be surprised if you"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"29 Must-Hear Podcasts for Business Owners | Fundbox Blog"},{"property":"og:description","content":"When’s the last time you listened to a truly great podcast? Business owners like you have a lot to gain by becoming regular listeners to relevant podcasts. Not only can podcasts expose you to new ideas and help you learn new things, the best ones are also highly entertaining, and you shouldn’t be surprised if you"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/28-must-hear-podcasts-business-owners\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1272317824.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1272317824.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"When’s the last time you listened to a truly great podcast? Business owners like you have a lot to gain by becoming regular listeners to relevant podcasts. Not only can podcasts expose you to new ideas and help you learn new things, the best ones are also highly entertaining, and you shouldn’t be surprised if you"},{"name":"twitter:title","content":"29 Must-Hear Podcasts for Business Owners | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1272317824.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/28-must-hear-podcasts-business-owners\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11862"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=11862"}],"version-history":[{"count":9,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11862\/revisions"}],"predecessor-version":[{"id":16366,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11862\/revisions\/16366"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/11873"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=11862"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=11862"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=11862"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=11862"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}