{"id":11875,"date":"2019-05-08T08:07:00","date_gmt":"2019-05-08T15:07:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=11875"},"modified":"2022-06-24T08:23:37","modified_gmt":"2022-06-24T15:23:37","slug":"world-famous-sock-brand-uses-fundbox-delight-retailers","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/world-famous-sock-brand-uses-fundbox-delight-retailers\/","title":{"rendered":"World Famous Sock Brand Uses Fundbox to Delight Retailers"},"content":{"rendered":"<p>The outrageously-named <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.gumballpoodle.com\/\">Gumball Poodle<\/a><\/span> is an online brand specializing in unique and creative socks. Founded by Erica Easley in Los Angeles, CA, in 2008, Gumball Poodle socks have been featured on The View, Live! With Kelly and Michael, The TODAY Show, Rachel Maddow, Meet the Press, and MTV. They count celebrities like Beyoncé, Madonna, Snoop Dogg, and Cara Delevingne among their fans.<\/p>\n<p>If you’ve visited any independent clothing boutiques or modern gift shops lately, you may have encountered Gumball Poodle’s merchandise. They offer over 100 designs of creative, humorous, and pop-culture-inspired hosiery, all made in the U.S., including what Erica says were the world’s first “OBAMA” knee socks (in 2008) and, more recently, a series of sock-art tributes to notorious drag performer Divine.<\/p>\n<figure style=\"width: 669px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/23753c2a-8175-40f4-aa59-dcfd5a008639_pasted20image200.png\" alt=\"Screenshot: Beyoncé wearing Gumball Poodle socks in her music video, “Pretty Hurts”\" width=\"669\" height=\"375\" \/><figcaption class=\"wp-caption-text\">Beyoncé wearing Gumball Poodle socks in her music video, “Pretty Hurts”<\/figcaption><\/figure>\n<p>Erica and her team clearly enjoy creating wearable art, and customers around the world have responded, making Gumball Poodle a top-selling success in the world of novelty socks. As with any independent business, however, there are challenges.<\/p>\n<h2>Small brand, big risk<\/h2>\n<p>One common challenge the Gumball Poodle team must handle is in working with the dozens of independent retailers that carry their products. If a retailer is interested in stocking Gumball Poodle’s wares, they’re usually also interested in trade credit, in the form of delayed payment terms.<\/p>\n<p>Offering trade credit is a common practice among merchants and brands like Gumball Poodle, who use credit to give their retailers more buying power. Unfortunately for brands, retail buyers commonly take longer than their agreed-upon term to pay invoices.<\/p>\n<p>In the past, Gumball Poodle typically offered an industry-standard Net-30 to approved buyers, but this came with some significant operational headaches. For example, approving a new retailer for net terms requires a credit check, which can take up to two weeks to complete, requiring an employee to manage and follow up on the approval, and delaying the order. Any delay in the order process can endanger the order and the relationship with a new retail customer, especially in the trend-driven world of gift shops and novelty socks.<\/p>\n<p>While offering longer terms, like Net-60, would make her customers happier and potentially increase order volumes, Erica says, the financial risk and gaps in her cash flow would be prohibitive: “Being able to offer Net-60 would be great but we aren&#8217;t big enough to even consider doing that type of thing.”<\/p>\n<p>That’s one big reason why Erica turned to Fundbox as a solution to provide credit as a service to her retail customers.<\/p>\n<p>&nbsp;<\/p>\n<figure style=\"width: 400px\" class=\"wp-caption aligncenter\"><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/7762a528-4548-4413-a710-04629e0a288d_Easley_Gumball20Poodle.jpg\" alt=\"Erica Easley, founder of Gumball Poodle.\" width=\"400\" \/><figcaption class=\"wp-caption-text\">Erica Easley, founder of Gumball Poodle.<\/figcaption><\/figure>\n<h2>Solving the trade credit challenge<\/h2>\n<p>Erica first found out about Fundbox through a referral from a trusted friend, also in the gift and housewares retail business: Missy Livingston, owner of <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.twistedwares.com\">Twisted Wares<\/a><\/span>. Like Erica, Missy wanted a technology provider to offer credit as a service to her retailers while maintaining control of her important customer relationships. Twisted Wares found that fintech partner in Fundbox, and Erica thought it would work for her business, too.<\/p>\n<p>The Fundbox team takes a highly attentive and customized approach to working with brands like Twisted Wares and Gumball Poodle. Brands using Fundbox to offer terms to their buyers work with a dedicated account representative and custom marketing assets to make sure that onboarding new buyers is as simple as possible. Offering co-branded assets (like brochures and website landing pages) helps explain the new offering to retail buyers, which helps build trust and adoption of the service.<\/p>\n<p>“One of the things you did early on was to create a branded landing page,” says Erica. “When people go to fill out that Fundbox application, it says, ‘Gumball Poodle, powered by Fundbox.’ I think that&#8217;s helped a lot.”<\/p>\n<p>Erica’s team also took initiative when it came to launching the partnership. Since Gumball Poodle was scheduled to exhibit at <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.lasvegasmarket.com\/\">Las Vegas Market<\/a><\/span> during the summer soon after signing up for Fundbox, they whipped up a quick advertisement, along with their friends, Twisted Wares. At the show, they handed out a flyer advertising their new Net-60 terms. From the beginning, those more-generous payment terms have been a hit with customers, and working with Fundbox has streamlined the brand’s business.<\/p>\n<p>“Offering Net-60 to customers is something that really is a benefit for them and that helps us,” says Erica. “It helps our cash flow because we&#8217;re getting money right away. Fundbox definitely simplified our A\/R.”<\/p>\n<p>Since signing up nearly a year ago, Erica says she has made it the default process to offer Net-60 terms through Fundbox. “Anybody who asks for terms now, that&#8217;s a new account or new to asking for terms,” says Erica, “We give them the Fundbox link: here&#8217;s how you get Net-60.”<\/p>\n<p>In addition to signing up their new buyers, Gumball Poodle also offers Net-60 terms to buyers who had previously been approved for their typical 30-day payment terms.<\/p>\n<p>“Some customers who are previously on terms with us at Net-30, when they found out they could get Net-60, have [chosen to go through the new process] and have signed up for Fundbox,” says Erica.<\/p>\n<p>For several of their long-term customers, the additional 30 days to pay was a significant attraction. In less than one year, Gumball Poodle have signed over 20 active retail customers to the platform. Now, those customers can take advantage of 60-day payment terms, while Gumball Poodle gets paid for their orders right away, significantly speeding up their cash flow.<\/p>\n<h2>Results: How Fundbox helps Gumball Poodle grow<\/h2>\n<p>Since signing up with Fundbox as a trade credit partner, Gumball Poodle has realized a few significant benefits.<\/p>\n<p>Operationally, using Fundbox has reduced complexity and freed employees to spend less time managing credit checks and other tasks related to their internal credit program. The brand has an employee dedicated to collections, sending payment reminders, and managing credit checks. With fewer credit checks for new customers to manage, and faster, more reliable payments on new invoices through Fundbox, collections and bookkeeping are simpler and less time-consuming.<\/p>\n<p>With fewer struggles around chasing payments, and the ability the offer more desirable payment terms, the Gumball Poodle team noticed an improvement in customer relationships, too.<\/p>\n<p>That makes sense, considering that many of the brand’s customers are independent retail shops with their own cash flow challenges to conquer. With the extra flexibility afforded to them by Net-60 terms, smaller retailers have more time to sell, meaning they can write bigger orders with merchants like Gumball Poodle.<\/p>\n<p>When it comes to the experience of working with Fundbox, Erica highlights the importance of having an attentive team to work with her every step of the way, including facilitating onboarding with retailers. “Your team overall is just terrific to work with and helpful,” she says. “[Account representative] Nick has been awesome in talking with customers and working with us. I feel like you listen to us.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The outrageously-named Gumball Poodle is an online brand specializing in unique and creative socks. Founded by Erica Easley in Los Angeles, &#8230;<\/p>\n","protected":false},"author":61,"featured_media":11880,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11504],"yst_prominent_words":[713,739,11378,7872,798,11379,11377,838,11371,11370,11373,11374,11375,11178,1694,11372,3842,2102,11376],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"World Famous Sock Brand Uses Fundbox to Delight Retailers | Fundbox Blog","yoast_meta":[{"name":"description","content":"The outrageously-named Gumball Poodle is an online brand specializing in unique and creative socks. Founded by Erica Easley in Los Angeles, CA, in 2008, Gumball Poodle socks have been featured on The View, Live! With Kelly and Michael, The TODAY Show, Rachel Maddow, Meet the Press, and MTV. They count celebrities"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"World Famous Sock Brand Uses Fundbox to Delight Retailers | Fundbox Blog"},{"property":"og:description","content":"The outrageously-named Gumball Poodle is an online brand specializing in unique and creative socks. Founded by Erica Easley in Los Angeles, CA, in 2008, Gumball Poodle socks have been featured on The View, Live! With Kelly and Michael, The TODAY Show, Rachel Maddow, Meet the Press, and MTV. They count celebrities"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/world-famous-sock-brand-uses-fundbox-delight-retailers\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1177669810.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1177669810.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"The outrageously-named Gumball Poodle is an online brand specializing in unique and creative socks. Founded by Erica Easley in Los Angeles, CA, in 2008, Gumball Poodle socks have been featured on The View, Live! With Kelly and Michael, The TODAY Show, Rachel Maddow, Meet the Press, and MTV. They count celebrities"},{"name":"twitter:title","content":"World Famous Sock Brand Uses Fundbox to Delight Retailers | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_1177669810.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/world-famous-sock-brand-uses-fundbox-delight-retailers\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11875"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=11875"}],"version-history":[{"count":12,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11875\/revisions"}],"predecessor-version":[{"id":16281,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11875\/revisions\/16281"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/11880"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=11875"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=11875"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=11875"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=11875"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}