{"id":11916,"date":"2019-05-16T07:55:00","date_gmt":"2019-05-16T14:55:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=11916"},"modified":"2022-06-24T13:34:52","modified_gmt":"2022-06-24T20:34:52","slug":"pros-cons-cashless-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/pros-cons-cashless-business\/","title":{"rendered":"The Pros and Cons of a Cashless Business"},"content":{"rendered":"<h3>Should your business go cashless? In this guest post from Lendio, a look at the pros and cons.<\/h3>\n<p>Credit cards are more widespread than ever, mobile wallets like Apple Pay and Samsung Pay are growing, and entire countries—such as Sweden, which aims to become a <a href=\"https:\/\/www.npr.org\/2019\/02\/11\/691334123\/swedens-cashless-experiment-is-it-too-much-too-fast\">cashless society<\/a>—are embracing plastic and trying to rid the world of paper money. But in the United States, where the <a href=\"https:\/\/www.fdic.gov\/householdsurvey\/\">FDIC reports<\/a> that 8.4 million households are unbanked and another 24 million are underbanked, the cashless revolution might not be so near.<\/p>\n<p>While cash use is declining in the US, more than 70 percent of Americans still make purchases in cash every week, the <a href=\"https:\/\/www.pewresearch.org\/fact-tank\/2018\/12\/12\/more-americans-are-making-no-weekly-purchases-with-cash\/\">Pew Research Center<\/a> reports. Of course, that leaves a third of the population for whom cash is no longer necessary, and that number is likely growing. Given this trend toward plastic and digital, it can be tempting to adjust your business accordingly.<\/p>\n<p>There are plenty of benefits to doing away with cash altogether, but is it the right choice for your retail business?<\/p>\n<h2>The Cashless Business Trend Sweeps US Cities<\/h2>\n<p>Several hip eateries catering toward younger crowds in major US cities have <a href=\"https:\/\/www.eater.com\/2018\/2\/15\/16974980\/cashless-restaurants-credit-card-only-legal-problem-discriminatory\">already gone cashless<\/a>, including popular dessert chain Milk Bar and Chicago-based Epic Burger. Amazon recently introduced <a href=\"https:\/\/www.amazon.com\/b?ie=UTF8&amp;node=16008589011\">Amazon Go<\/a>, a cashless-by-design chain of grab-and-go supermarkets where you can avoid the checkout process entirely by charging anything you place in your shopping cart to your Amazon account.<\/p>\n<p>While businesses can fall on both sides of the cashless debate, one clear winner is propelling the movement: credit card companies, which stand to make anywhere from 1 percent to 4 percent each time a customer swipes plastic. Visa launched a <a href=\"https:\/\/www.pymnts.com\/visa\/2018\/visa-cashless-challenge-smbs-pos\/\">Cashless Challenge<\/a> in 2017 that awarded 50 businesses with $10,000 for making the switch to being cashless.<\/p>\n<h2>Pros of Going Cashless for Small Businesses<\/h2>\n<p>Chains aren’t the only businesses moving to cashless systems. Even small businesses stand to benefit in some key ways.<\/p>\n<h3>1. Save time and money<\/h3>\n<p>While businesses have to pay a fee for each credit card transaction, they also have to pay an employee for the additional time it takes to accept cash. From counting the cash at the end of the day to making frequent trips to the bank and possibly paying deposit fees, these extra hours add up. When Sweetgreen, a salad chain, originally went cashless, they <a href=\"https:\/\/medium.com\/sweetgreen\/cashless-49f64f24dd0f\">released a statement<\/a> explaining that a large part of the decision came from the desire to scale up and the fact that they spent about two hours every day on cash management in each store.<\/p>\n<h3>2. Increase checkout efficiency<\/h3>\n<p>One swipe or tap of a credit card makes for a much faster transaction than the process of counting cash and giving change. For businesses that experience long lines during peak times, going cash-free can significantly speed up the checkout process and curb those lines, making customers more likely to stop in and make a purchase.<\/p>\n<h3>3. Decrease risk<\/h3>\n<p>Keeping cash in the register leaves your business at risk for theft and robbery. One Baltimore-based cafe went cashless in 2017 after facing five armed robberies in just four months. What’s more, <a href=\"https:\/\/www.cnbc.com\/2017\/09\/12\/workplace-crime-costs-us-businesses-50-billion-a-year.html\">Statistic Brain and CNBC report<\/a> that employee theft costs US businesses $50 billion each year. By not accepting cash, you’re also making it impossible for employees to skim your profits from the register.<\/p>\n<h3>4. Improve accounting<\/h3>\n<p>Imagine never having to go through the books again to figure out why the register is coming up short at the end of the day. Going cashless allows you to track every transaction easily and leads to more accurate accounting, which increases efficiency and your bottom line.<\/p>\n<h2>Cons of Going Cashless for Small Businesses<\/h2>\n<p>There are some obvious drawbacks to deciding not to accept cash at your business, as evidenced by Shake Shack’s reversal of their decision to go cashless. Sweetgreen, an early adopter of cashless business, recently <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-04-25\/after-outrage-sweetgreen-will-accept-cash-again\">made the decision to accept cash again<\/a> due to the controversy surrounding cashless businesses. Here are a few reasons your business might not want to go cashless.<\/p>\n<h3>1. Pay more credit card fees<\/h3>\n<p>With credit card fees as high as 3 percent or 4 percent on each purchase, business owners spend a small fortune on credit card transactions every year. This fee is why many independent businesses are still cash-only or charge customers a fee for credit card use. Other businesses are forced to build the credit card fees into their prices, which can mean losing some customers to the competition.<\/p>\n<h3>2. You might lose customers<\/h3>\n<p>Shake Shack, a popular NYC-based burger chain, attempted to go cashless but <a href=\"https:\/\/www.eater.com\/2018\/5\/4\/17320390\/shake-shack-cashless-credit-card-kiosks\">scrapped the plan<\/a> in 2018 after a series of angry customer complaints. Many children, older folks, and other typically unbanked or underbanked people are effectively prohibited from purchasing at your business at all if you go cashless. Other customers may feel alienated by the decision to no longer accept cash, which could result in negative publicity or even a boycott of your business. Customers who simply prefer to pay in cash, perhaps for privacy or data security reasons, or don’t have their cards on them, will also be forced to shop elsewhere. Some customers rely entirely on cash for budgeting purposes, as personal finance guru Dave Ramsey’s <a href=\"https:\/\/www.daveramsey.com\/blog\/envelope-system-explained\">envelope method<\/a> for budgeting recommends. Consider if you really want to send the message that all those people can’t shop with you.<\/p>\n<h3>3. There’s no way to accept payments if your system crashes<\/h3>\n<p>Having your credit card system go down in the middle of the day is stressful enough, even with the recourse of accepting only cash until it’s back up. However, if your business goes cashless, you’ll be rendered unable to accept any form of payment at all in these situations.<\/p>\n<h2>Discrimination and Legality Concerns in Cashless Businesses<\/h2>\n<p>The ethical issues surrounding the trend toward cashless are thorny at best. Many customers and lawmakers consider the practice to be discriminatory, and in some cities and states, it’s even illegal.<\/p>\n<p><a href=\"https:\/\/www.wsj.com\/articles\/philadelphia-is-first-u-s-city-to-ban-cashless-stores-11551967201\">Philadelphia<\/a> became the first major US city to ban cashless practices in a new law that will require stores to accept cash starting in July 2019. <a href=\"https:\/\/www.wnyc.org\/story\/new-jersey-bans-cashless-retailers\/\">New Jersey<\/a> also passed a bill to ban cashless stores earlier this year, and <a href=\"https:\/\/malegislature.gov\/Laws\/GeneralLaws\/PartIII\/TitleIV\/Chapter255D\/Section10A\">Massachusetts<\/a> has had such a law on the books for decades.<\/p>\n<p>While New York City is home to an increasing number of cashless restaurants, at the time of this writing, NYC Councilmember Ritchie Torres is pushing for the city to ban them as well. He proposed a similar bill in the <a href=\"https:\/\/newyork.cbslocal.com\/2019\/02\/14\/nyc-council-considers-bills-to-force-shops-to-accept-cash-payments\/\">fall of 2018<\/a>. In an <a href=\"https:\/\/www.youtube.com\/watch?v=VUUa_iSzaWU\">op-ed video<\/a> for NowThis News, Torres argues that American bills are printed with the statement, “This note is legal tender for all debts public and private” for a reason, and refusing to accept them constitutes illegal discrimination under the Civil Rights Act.<\/p>\n<p>This concern seems especially understandable <a href=\"https:\/\/www.urban.org\/sites\/default\/files\/publication\/71511\/2000430-Where-Are-the-Unbanked-and-Underbanked-in-New-York-City.pdf\">in NYC<\/a>, where the share of unbanked and underbanked households is more than 36 percent, higher than the national average. 27.7 percent of American households overall fall into one of those two categories, with 7.7 percent of them are unbanked, meaning they don’t have a bank account at all.<\/p>\n<p>Why would someone not have a bank account? There are a few common reasons.<\/p>\n<p>For starters, most checking accounts require a minimum opening deposit, and they may also come with monthly maintenance fees and requirements to maintain a minimum monthly balance, which is out of reach for many Americans living in poverty. They also require a government-issued form of identification and residential address, which homeless Americans do not have. Undocumented individuals are also unable to open a bank account. Finally, some consumers may be barred from opening a checking account due to a negative banking history. Most banks will check your banking history and deny any applicants who have evidence of mismanagement in previous bank accounts, typically by overdrawing them and failing to pay the accumulated fees.<\/p>\n<p>In sum, the unbanked and underbanked tend to be the nation’s poorest, which is why Torres describes the push for cashless transactions in his video as “the disempowerment of America’s most vulnerable communities.”<\/p>\n<h2>You Can Accept Cash While Encouraging Plastic<\/h2>\n<p>Given the large segment of the US population that still relies on or prefers cash, it can be hard to justify going completely cashless. If you’re tempted by the time-saving benefits but worried about the potential drawbacks, consider continuing to accept cash but encouraging your customers to pay with a card if they can.<\/p>\n<p>You can do this by installing cashless kiosks that speed up the ordering process or maintaining one cashless location, as <a href=\"https:\/\/www.cnbc.com\/2017\/10\/02\/shake-shack-to-open-a-cashless-kiosk-in-new-york.html\">Shake Shack did<\/a>. Another tactic is to implement a rewards or points program for customers who pay with a card.<\/p>\n<p>We may arrive at a totally cashless society one day. But for now, it seems the US still has a lot of work to do—particularly when it comes to serving the underbanked—before we can embrace the cashless future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Should your business go cashless? In this guest post from Lendio, a look at the pros and cons. Credit cards &#8230;<\/p>\n","protected":false},"author":101,"featured_media":11920,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[10486,11547],"yst_prominent_words":[8579,11420,1165,723,1132,3068,11425,3202,11419,11423,11428,11426,739,724,11421,798,11422,3040,11424,11427],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"The Pros and Cons of a Cashless Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"Should your business go cashless? In this guest post from Lendio, a look at the pros and cons. Credit cards are more widespread than ever, mobile wallets like Apple Pay and Samsung Pay are growing, and entire countries—such as Sweden, which aims to become a cashless society—are embracing plastic and trying to rid the"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"The Pros and Cons of a Cashless Business | Fundbox Blog"},{"property":"og:description","content":"Should your business go cashless? In this guest post from Lendio, a look at the pros and cons. Credit cards are more widespread than ever, mobile wallets like Apple Pay and Samsung Pay are growing, and entire countries—such as Sweden, which aims to become a cashless society—are embracing plastic and trying to rid the"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/pros-cons-cashless-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/Stocksy_txp1a5c64053wK200_Medium_2145324_crop.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/Stocksy_txp1a5c64053wK200_Medium_2145324_crop.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Should your business go cashless? In this guest post from Lendio, a look at the pros and cons. Credit cards are more widespread than ever, mobile wallets like Apple Pay and Samsung Pay are growing, and entire countries—such as Sweden, which aims to become a cashless society—are embracing plastic and trying to rid the"},{"name":"twitter:title","content":"The Pros and Cons of a Cashless Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/Stocksy_txp1a5c64053wK200_Medium_2145324_crop.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/pros-cons-cashless-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11916"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/101"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=11916"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11916\/revisions"}],"predecessor-version":[{"id":16367,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11916\/revisions\/16367"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/11920"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=11916"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=11916"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=11916"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=11916"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}