{"id":11938,"date":"2019-05-21T07:48:00","date_gmt":"2019-05-21T14:48:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=11938"},"modified":"2022-06-24T08:55:24","modified_gmt":"2022-06-24T15:55:24","slug":"humans-fundbox-robin-macpherson","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/humans-fundbox-robin-macpherson\/","title":{"rendered":"Humans of Fundbox: Robin MacPherson"},"content":{"rendered":"<p>In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, meet Robin MacPherson. He works in the San Francisco Fundbox office as a software engineer.<\/p>\n<p>To put it mildly, Robin has had an interesting life. Born in the United Kingdom, he’s spent years traveling the world, teaching himself new skills, and running independent businesses in language instruction, translation, and design. He speaks eight languages and has lived in nine countries, experiencing many different types of work, people, and lifestyles along the way.<\/p>\n<p>In this conversation, he opens up about his path to becoming a developer, and why the Fundbox mission is so meaningful to him.<\/p>\n<figure id=\"attachment_11940\" aria-describedby=\"caption-attachment-11940\" style=\"width: 600px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-600 wp-image-11940\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/Robin-M-headshot-bw.png\" alt=\"Robin M, software engineer at Fundbox\" width=\"600\" height=\"400\" \/><figcaption id=\"caption-attachment-11940\" class=\"wp-caption-text\"><em>Robin MacPherson, software engineer at Fundbox in San Francisco.<\/em><\/figcaption><\/figure>\n<h3>Fundbox: What were you doing before you joined Fundbox?<\/h3>\n<p><strong>Robin MacPherson:<\/strong> Before I came to the Fundbox, I had moved back to the United States from Barcelona because I had a book that I had been writing for a couple of years that I wanted to finish. At the time, I was also learning web development, not for the purpose of getting a job, but because I wanted to build cool and helpful tools and resources for my YouTube audience and people learning languages.<\/p>\n<p>The process of learning how to design a book and how to design and build my first website all took so much time that I decided to quit a side job that I had at the time and just went for it. The income from my business wasn’t enough to pay all the bills, so I completely focused on those projects and it was now a race against time. Though I did finish every single thing on my list, it took everything I had. Unfortunately, that was pretty much the exact time where I lost my home.<\/p>\n<p>It was a very interesting moment and this was not even a year ago today. I became homeless again but I had also finished my book, I finished the website and everything I had come back to the United States to do. It was a really bizarre feeling. I just wasn&#8217;t scared anymore. It was a moment where I said, &#8220;Okay, I think now it&#8217;s time for me to finally make some big changes in my life, once and for all,” because I had been living below the poverty line in terms of income for five years. I had a variety of skills and a lot of my YouTube followers were telling me, &#8220;You shouldn&#8217;t be poor and starving! Please consider getting a job that utilizes all these new skills you’ve learned.&#8221;<\/p>\n<p>That was literally the first time, about eleven months ago to this day, that I actually considered that I could get a job writing software. Lo and behold, here I am.<\/p>\n<h3>What made you choose San Francisco as your next place to land?<\/h3>\n<p><strong>RM:<\/strong> Previously, I tried to see if I could get a job as a developer in Charlotte, North Carolina where I was living at the time. I struggled to attract interest from employers there because I was totally self-taught and had no professional experience writing software. It was very challenging to find a good opportunity.<\/p>\n<p>When things were looking bleak, there was a moment when I thought, “Maybe I should try San Francisco.” Around then, I had been listening to hours and hours of design podcasts every day. I used to bike five miles a day back and forth to work and all the way I would listen to those podcasts. And in everything I was listening to, everything that was influential seemed to be here, in SF. It seemed like a magical place and I had previously never imagined that I would end up here, but I decided to give it a try.<\/p>\n<p>I definitely experienced a lot of imposter syndrome and I thought there was no way that I would qualify for these jobs. Finally, I reached out to a recruiter and said, “Hey, I know I may not be qualified for this job, but could we have a short call and maybe you could help me find something else?”<\/p>\n<p>That connection led me to learn about Fundbox. Right around the time I scored an interview, I was kicked out of my home! I had almost no clothing and my shoes were held together with duct tape when I was invited to come to San Francisco to interview. I was worried that not only wasn’t I qualified, but I would also look terrible.<\/p>\n<p>I’ve been quite active on my YouTube channel, and I made a video letting people know what was happening with my life. I didn’t mean it to be a sad story, I meant it to be powerful, saying, “My content will change because I won’t have this space any longer, but don’t worry about me! I’ve finished everything that I came back here to do.”<\/p>\n<p>I had no idea what would happen. In response, my followers started sending me money and assistance. People around the world who had been watching my videos for years&#8230;people that I had been helping non-stop without asking for anything&#8230;they all reached out to me and many of them sent me the money I needed to buy clothes, get my hair cut, and eat. After that, I had an onsite interview at Fundbox in San Francisco and eventually got the job.<\/p>\n<h3>That’s an amazing story. In some ways, it’s similar to other stories we’ve heard, and to many experiences that other business owners have: when you found a business, you often sacrifice everything for it, like you did to complete your book.<\/h3>\n<p><strong>RM:<\/strong> Yes, and that&#8217;s a lot of what really resonated with me about Fundbox. All throughout my career as a business owner (which admittedly was fairly short, about three years), I struggled immensely financially. The company was profitable from day one but it was on a very small scale.<\/p>\n<p>Very often, running my business, I felt powerless. There were times I did feel a bit desperate for money. I just needed some buffer. Not a lot! Even $10,000 would have been enough. I had built an audience, validated my product, but I just didn’t have the time because I was now working a full-time job at a coffee shop and still running my first company, teaching languages online.<\/p>\n<p>I tried to go to the bank, and see if I could just get any business funding. They told me the minimum amount would be a huge loan, and that I didn’t have the revenue numbers that they would need to see in order to consider approving me.<\/p>\n<p>That&#8217;s one of the reasons why I loved Fundbox&#8217;s mission. To me, it felt like the whole point of Fundbox is empowering business owners and small businesses. I felt powerless for such a long time, so it feels very good to be a part of a company that&#8217;s striving to give power and options to people that might be in that position, where I was so recently.<\/p>\n<h3>Since joining the team, has anything surprised you?<\/h3>\n<p><strong>RM:<\/strong> I really appreciate the culture here. This company was willing to look past what was on paper, at least for me. It was the first place I’d interviewed where I felt, for the first time in my life, people were actually evaluating me based on the skills that I could demonstrate and the experiences I had, not the number of years of experience that I had, or based on my degrees or GPA. This is the first time someone said, simply, &#8220;What can you do?&#8221;<\/p>\n<p>The two super important ingredients for success, in my opinion, are very simple and are things that anybody can do: developing a taste for doing good work and putting in the hours. It really can be that simple. A constant throughout my life has been that I love doing good work. I love understanding things. Those traits have propelled me forward. Fundbox happens to be an environment that supports that exceptionally well.<\/p>\n<p>For me, one of the most exciting things about working at Fundbox is that I feel important. I feel like my voice matters and people care about what I do and what I have to say. That feeling, it&#8217;s so liberating and empowering.<\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-style: italic;\">You can find out about Robin’s book and other projects on his website, <\/span><span style=\"font-style: italic; text-decoration: underline;\"><a href=\"https:\/\/www.kumabrand.com\/\">Kuma Brand<\/a><\/span><span style=\"font-style: italic;\"> and on <\/span><span style=\"font-style: italic; text-decoration: underline;\"><a href=\"https:\/\/www.youtube.com\/channel\/UC5wbKd54tG-juXnoSbTApCQ\">YouTube<\/a><\/span><span style=\"font-style: italic;\"> where he vlogs regularly<\/span><span style=\"font-style: italic;\">.<\/span><\/p>\n<p><span style=\"font-style: italic;\">Want to work with Robin? <\/span><span style=\"font-style: italic; text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/careers\">Check out our Careers page.<\/a><\/span><\/p>\n<p><em>Want more Humans of Fundbox?<\/em><\/p>\n<ul>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/\">Meet Prashant Fuloria, Chief Operations Officer<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/\">Meet Gibson Holland, Sync Support Manager<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/\">Meet Emad ElShawa, Business Operations Manager<\/a><\/em><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-tom-goldschmiedt\/\"><em>Meet Tom Goldschmiedt, Human Resources Manager <\/em><\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space &#8230;<\/p>\n","protected":false},"author":61,"featured_media":11949,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,326],"yst_prominent_words":[723,719,11389,11386,11387,6766,838,11383,11381,11388,10087,3039,1521,11382,6450,2355,11384,3300,3762,11385],"post-meta-fields":{"stripe_selected":"top-right-risks","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Humans of Fundbox: Robin MacPherson | Fundbox Blog","yoast_meta":[{"name":"description","content":"In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, meet Robin MacPherson. He works in the San Francisco Fundbox office as a software engineer. To put it mildly, Robin has had an interesting life. Born in the United"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Humans of Fundbox: Robin MacPherson | Fundbox Blog"},{"property":"og:description","content":"In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, meet Robin MacPherson. He works in the San Francisco Fundbox office as a software engineer. To put it mildly, Robin has had an interesting life. Born in the United"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/humans-fundbox-robin-macpherson\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_543159142.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_543159142.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, meet Robin MacPherson. He works in the San Francisco Fundbox office as a software engineer. To put it mildly, Robin has had an interesting life. Born in the United"},{"name":"twitter:title","content":"Humans of Fundbox: Robin MacPherson | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/shutterstock_543159142.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/humans-fundbox-robin-macpherson\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11938"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=11938"}],"version-history":[{"count":9,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11938\/revisions"}],"predecessor-version":[{"id":16309,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/11938\/revisions\/16309"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/11949"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=11938"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=11938"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=11938"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=11938"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}