{"id":12242,"date":"2019-06-25T07:58:00","date_gmt":"2019-06-25T14:58:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12242"},"modified":"2022-06-24T08:33:59","modified_gmt":"2022-06-24T15:33:59","slug":"start-food-truck-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/start-food-truck-business\/","title":{"rendered":"How to Start a Food Truck Business"},"content":{"rendered":"<p>In 2015, the <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.statista.com\/statistics\/444924\/industry-value-us-food-trucks\/\">U.S. food truck industry<\/a><\/span> brought in $856.7 million. By 2020, that number is expected to flirt with $1 billion as food trucks <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.economist.com\/graphic-detail\/2017\/05\/04\/americas-food-truck-industry-is-growing-rapidly-despite-roadblocks\">increasingly open up shop<\/a><\/span> all over the country—in places like Portland, Austin, Seattle, San Francisco, New York City, and everywhere in between.<\/p>\n<p>Suffice it to say that now is a great time to start your own food truck business. And that’s precisely what people of all backgrounds are doing.<\/p>\n<p>“I used to be a lawyer,” says Eric Silverstein, owner of <span style=\"text-decoration: underline;\"><a href=\"https:\/\/thepeachedtortilla.com\/\">The Peached Tortilla<\/a><\/span>, an award-winning food-truck that started in Austin, Texas in 2010 and has since grown into a full-throttled brick-and-mortar <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.barpeached.com\/\">restaurant<\/a><\/span> and catering company. “I got into this industry mainly because I was just very interested in owning my own business and food was a passion more than anything. The nature of the food truck business was exciting to me. It was a low barrier to entry in terms of the starting capital I needed.”<\/p>\n<p>Oh. There was one other thing, too.<\/p>\n<p>“I didn’t particularly love my old career as a lawyer,” Silverstein adds with a laugh.<\/p>\n<p>If you’re thinking about starting a food truck business, you’ve come to the right place. We’ve scoured the internet for the information you need and collected in one comprehensive guide. We’ve also interviewed successful entrepreneurs and food truck business experts, to bring their insights to you.<\/p>\n<p><strong>This guide will cover everything you need to know about running a food truck business, including:<\/strong><\/p>\n<ul>\n<li><a href=\"#Businessplan\">How to create a food truck business plan<\/a><\/li>\n<li><a href=\"#Challenges\">What challenges you can expect when you open your business<\/a><\/li>\n<li><a href=\"#Finance\">How to finance a food truck business<\/a><\/li>\n<li><a href=\"#Find\">How to find food truck businesses for sale<\/a><\/li>\n<li><a href=\"#Equipment\">What food truck business equipment you need<\/a><\/li>\n<li><a href=\"#Run\">Tips on how to run a food truck business<\/a><\/li>\n<li><a href=\"#Market\">Tips on how to market a food truck business<\/a><\/li>\n<li><a href=\"#Bestareas\">The best areas in the United States to launch a food truck business<\/a><\/li>\n<\/ul>\n<h2><a id=\"Businessplan\"><\/a>How to create a food truck business plan<\/h2>\n<p>So you want to open a food truck business. That’s awesome.<\/p>\n<p>But you need more than an idea.<\/p>\n<p>“You want to make sure you have a solid business plan and a deep understanding of your local market and laws before you pursue funding for your truck,” says Amber van Moessner, senior director of communications for <span style=\"text-decoration: underline;\"><a href=\"https:\/\/upserve.com\/\">Upserve<\/a><\/span>, makers of a modern restaurant management platform.<\/p>\n<p>Here’s what your <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.thebalancesmb.com\/write-a-food-truck-business-plan-4066702\">business plan<\/a><\/span> should include:<\/p>\n<ul>\n<li>An <span style=\"font-weight: bold;\">executive summary<\/span> that explains what you’re trying to accomplish<\/li>\n<li>A <span style=\"font-weight: bold;\">company description<\/span> that includes what kind of food you’re going to sell, where you’re going to operate, what equipment you need, how many trucks you’ll have, and other similar items<\/li>\n<li>A <span style=\"font-weight: bold;\">market analysis<\/span> that examines potential customers, competitors, and what you bring to the table that’s different<\/li>\n<li>A summary of <span style=\"font-weight: bold;\">management and ownership <\/span>that explains who’s involved in the business and how your food truck operation is going to be run<\/li>\n<li>A <span style=\"font-weight: bold;\">marketing strategy <\/span>that describes how you plan to promote your business (more on that later)<\/li>\n<li>A <span style=\"font-weight: bold;\">business operation <\/span>plan that includes your hours of operation, the number of employees you’ll have and—if you’ve gotten that far—how much you’re going to charge<\/li>\n<\/ul>\n<p>In addition to a business plan, you’ll also have to <span style=\"text-decoration: underline;\"><a href=\"https:\/\/mobile-cuisine.com\/business\/food-truck-licenses-permits-required\/\">secure<\/a><\/span> a food truck business license, a food handler’s permit, vehicle permits, health permits, fire safety inspection certifications, and other documentation.<\/p>\n<p>This all might sound like a lot—and maybe it is. No one ever said starting a company was easy.<\/p>\n<p>But if all goes according to plan, a lucrative dream job may be just around the corner.<\/p>\n<p>A recent <span style=\"text-decoration: underline;\"><a href=\"https:\/\/foodtruckempire.com\/news\/survey-income\/\">survey<\/a><\/span> asked 300 full-time food truck owners how much income they generate annually. More than 85% of respondents said they bring in over $100,000 in gross income each year. More specifically, 34.08% earn between $100,000 and $149,999, 30.04% earn between $150,000 and $199,999, and 21.52% earn more than $200,000.<\/p>\n<p>With the right plan in place and the determination to reach your goals, the sky’s the limit.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-600 wp-image-12247\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_414437299.jpg\" alt=\"A crowd and several food trucks\" width=\"600\" height=\"400\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_414437299.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_414437299-768x512.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2><a id=\"Challenges\"><\/a>Understand the challenges of running a food truck business<\/h2>\n<p>Building a small business from the ground up is hard work—regardless of the industry. Like all small business owners, food truck owners have to worry about building a brand, selling high-quality products at good prices, finding good employees and keeping them happy, and making sure customers find the food truck in the first place—and enjoy their experiences every time.<\/p>\n<p>Beyond those common business problems, food truck owners all experience a few other industry-specific issues when they’re just starting out, van Moessner says.<\/p>\n<p>“The biggest challenges are balancing your new business and—hopefully—customer demand with marketing and social media and having the right amount of ingredients, supplies, and customers on a daily basis,” van Moessner explains. Technology, however, can make all of it a lot easier. “Using an inventory tool or POS system with data built in can help you predict what your staffing and supply needs will be.”<\/p>\n<p>It can also be difficult to figure out how much inventory to have on hand at any time and where to store your food items and associated accouterments.<\/p>\n<p>“Food and recipe costing can be really challenging—especially if you’re dealing with more limited food storage than a traditional brick-and-mortar restaurant,” van Moessner says.<\/p>\n<p>There are also cash flow issues to consider, particularly since most food trucks are unable to take advantage of the economies of scale that some traditional restaurants enjoy.<\/p>\n<p>“You might not be able to buy your supplies in bulk at lower prices,” she continues. “You also have to consider things like vehicle maintenance and fluctuating fuel costs, insurance, licenses, and permits.”<\/p>\n<p>Permits and licenses <span style=\"text-decoration: underline;\"><a href=\"https:\/\/thebolditalic.com\/a-closer-look-at-sfs-food-truck-industry-69a56055dc05\">don’t always come easy<\/a><\/span>, either. For example, San Francisco food trucks need to complete at least 32 procedures to get proper permits. All told, each food truck needs 11 permits to operate legally in the city—at a cost of nearly $3,500.<\/p>\n<p>Depending on where your food truck operates, you may have a different set of challenges.<\/p>\n<p>According to a <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.foodtrucknation.us\/wp-content\/themes\/food-truck-nation\/Food-Truck-Nation-Full-Report.pdf\">recent report<\/a><\/span>, San Francisco food truck operators spend $28,642 to run their businesses each year while food truck operators in Portland spend $5,410 to do the same. Boston food truck operators have it the worst, paying nearly $38,000 each year to run their businesses.<\/p>\n<p>Of course, competition can also be challenging. If there are an endless amount of food truck options in the vicinity, it may be hard to break through the market and end up profitable on the other side.<\/p>\n<p>As any small business owner knows, challenges come with the territory. With a solid business plan in place and the right approach to these obstacles, you can build a highly successful food truck business.<\/p>\n<h2><a id=\"Finance\"><\/a>How to finance a food truck business<\/h2>\n<p>You’re ready to face the challenges food truck operators face and you can’t wait to start serving customers. But you still need to turn your idea into reality—which means you’ll need capital.<\/p>\n<p>Food trucks businesses may be cheaper to start than other businesses, but they still require a good amount of cash. A used food truck can <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.thebalancesmb.com\/how-to-start-a-food-truck-business-2888645\">cost<\/a><\/span> as much as $40,000, while a brand-new one can cost up to $100,000, for example.<\/p>\n<p>There are also many other kinds of costs to consider: vehicle repairs, a POS system, uniforms, supplies, gas, office supplies, a website, inventory, kitchenware, and more.<\/p>\n<p>Some food truck entrepreneurs may have access to that much capital, but most don’t. If you find yourself in the same category as most other food truck owners, there are several financing options to consider.<\/p>\n<p>Silverstein financed The Peached Tortilla by raising $40,000 from investors and funding the rest of the business out of his own pocket.<\/p>\n<p>“The odds of me getting a substantial enough loan to run the business were not good—I had no track record,” Silverstein says. “Banks look at food trucks or restaurants like high-risk loans. I had trouble securing a loan for my restaurant—and that was after I’ve proven myself in the food truck. Why would anyone loan me money for my food truck?”<\/p>\n<p>Other food truck entrepreneurs take different routes.<\/p>\n<p>“Most food truck operators start with a mix of savings, crowdfunding, and microloans,” van Moesser explains. “For some lower-cost operations, getting started is as easy as taking out a low-interest rate business card.”<\/p>\n<p>While it may be tempting to finance your food truck business out of your own pocket, that can create a whole other set of problems—even if you have the cash to spare.<\/p>\n<p>“Self-financing has its pros and cons,” van Moesser continues. “You can start your business debt-free and right away when you are self-financed. But it’s easy to quickly run out of money without a backup plan on the long road to profitability.”<\/p>\n<p><span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/blog\/5-pros-and-cons-of-crowdfunding-your-businesses\/\">Crowdfunding<\/a><\/span> is another financing option food truck business can consider.<\/p>\n<p>“Crowdfunding is a great idea for food trucks because it also provides a crash course in marketing and a proof of concept before you set up shop,” van Moessner concludes. “If you can get a community excited and bought in on your food truck and products, they will likely support you by purchasing your food once you’re open and established. This also allows you to start your business with minimal debt.”<\/p>\n<p>Still, even with financing in place, cash flow problems can always loom.<\/p>\n<p>“I think what makes the food truck business challenging is the margin, the day-to-day hustle and grind, the amount of stress and energy you have to put in to be successful,” Silverstein says. “If your volume isn’t big enough, you can’t go with vendors that deliver, so then you end up having to go out to a commercial warehouse to buy your products.”<\/p>\n<p>Despite these obstacles, with a solid business plan, financing on hand, and a contingency plan in place if you need more funding, you can grow your food truck business into something much more—as Silverstein’s story demonstrates.<\/p>\n<h2><a id=\"Find\"><\/a>How to find food truck businesses for sale<\/h2>\n<p>If you dream of running a popular food truck, you don’t <span style=\"font-style: italic;\">have <\/span>to start your food truck business from scratch. You could always opt to buy one outright, assuming you can find a seller with an existing business you like.<\/p>\n<p>A quick Google search reveals several sites dedicated to selling food trucks to entrepreneurs such as yourself.  But buyer beware: When you take over the business, you inherit everything that comes with it—including the truck.<\/p>\n<p>“There are very few food trucks in the United States that are running out of a vehicle that was built as a food truck,” Silverstein says. “Usually, there’s a truck base or a truck shell that was an old UPS truck or an old FedEx truck and they’ve been retrofitted. The problem with that is that they’re old vehicles, they have a lot of miles on them, and they’re not meant to support the amount and weight of equipment that is on the vehicle itself. You end up having a lot of problems—transmission problems, chassis problems, tire problems, you name it.”<\/p>\n<p>This isn’t to say that old trucks won’t work. Silverstein actually built his own business on the backs of two retrofitted trucks. It can work, and it does work for many successful food truck entrepreneurs. You just need to be careful.<\/p>\n<p>“It’s a huge gamble because you know you’re going to have a lot of problems,” he explains. “You really don’t know how this truck was treated. It’s got a lot of miles, so you know there’s going to be a lot of repairs. It’s just the nature of the business.”<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-12246 size-600\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_1095843908.jpg\" alt=\"Young woman standing in front of a food truck\" width=\"600\" height=\"400\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_1095843908.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_1095843908-768x512.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2><a id=\"Equipment\"><\/a>Food truck business equipment and expenses<\/h2>\n<p>As you consider starting your own food truck business, you need to get a good idea of how much it might cost to run or <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/resources\/guides\/truck-loans\/\">consider a truck loan<\/a><\/span>.<\/p>\n<p>Luckily for us, the folks over at Food Truck Empire put together a <span style=\"text-decoration: underline;\"><a href=\"https:\/\/foodtruckempire.com\/how-to\/costs\/\">handy list<\/a><\/span> of food truck startup costs:<\/p>\n<ul>\n<li>The food truck itself—fitted with equipment and branding—can cost anywhere between $25,000 and $100,000<\/li>\n<li>Initial inventory costs between $1,000 and $2,000<\/li>\n<li>A point-of-sale system can cost another $1,000<\/li>\n<li>Kitchenware (e.g., pots and pans) can cost up to $2,000<\/li>\n<li>A website can set you back another $5,000 (but you can also build something respectable for less than that)<\/li>\n<li>A fire extinguisher is anywhere between $100 and $300<\/li>\n<\/ul>\n<p>These are far from the only expenses to consider. Permitting and licensing fees (and taxes) all vary on a state-by-state and city-by-city basis—so set up shop accordingly.<\/p>\n<p>You’ll also need a uniform of sorts—some T-shirts and hats might do the trick. And there are office supplies, marketing expenses, fuel costs, insurance, payroll taxes, and other miscellaneous fees to keep in mind as well.<\/p>\n<h2><a id=\"How\"><\/a>Step by step: How to run a food truck business<\/h2>\n<p>By now, you know what’s involved with starting a food truck business, how much it might cost to get up and running, and the challenges that food truck operators experience.<\/p>\n<p>You’re still stoked on the idea—awesome!<\/p>\n<p>Here are five things to keep in mind as you get ready to serve your first delicious meal.<\/p>\n<h3>1. Choose the right menu and set the right prices.<\/h3>\n<p>If there are 20 food trucks in your city and they’re all serving tacos and burritos, you may want to think twice about opening up yet another truck that sells Mexican food.<\/p>\n<p>Do a bit of research and see what kind of food truck businesses are in your neck of the woods. The more you know about your local market and competition, the better chance you’ll have of standing out. One way to stand out is to come up with a menu that’s unique—something that your city’s missing.<\/p>\n<p>Once you’re happy with your menu, it’s time to set prices. You don’t want to charge too much, because you’ll scare customers away. And you don’t want to charge too little, either, because you won’t make any money.<\/p>\n<p>Best practices <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.dummies.com\/business\/start-a-business\/menu-pricing-methods-for-your-food-truck-business\/\">suggest<\/a><\/span> targeting food-cost percentages between 20–40%. By this logic, if it costs you $3 to make an item, you would consider charging between $8 and $15.<\/p>\n<h3>2. Come up with a catchy name.<\/h3>\n<p>Like any restaurant or dining establishment, the name you give your food truck business can have a tremendous impact on your company’s success.<\/p>\n<p>Spend a lot of time brainstorming potential names. Consider the theme of your menu and the vibe you’re trying to convey. You want customers to be able to tell what kind of food you’re selling with a quick glance. That said, you don’t want to be too restrictive; you never know when you might want to expand your menu in the future, and you don’t want to confine yourself in a corner.<\/p>\n<p>Your food truck’s name should also memorable and easy to pronounce—yet different enough to stand apart from other businesses. If the name is incredibly long, no one will remember it.<\/p>\n<p>Not super confident in your idea? Don’t be afraid to bounce names off of trusted people in your circle for feedback. Your food truck’s name is very important, so you should gather as much data as you can before you make a final decision.<\/p>\n<h3>3. Hire the right people.<\/h3>\n<p>You might create the best business plan in the world and have an even better menu to back it all up. But at the end of the day, there’s only one of you. Unless you’re planning on doing <span style=\"font-style: italic;\">everything <\/span>on your own, you’ll need a team of dedicated workers to help your business get to the next level.<\/p>\n<p>Choosing who to hire is another incredibly important decision you’ll have to make. While the right employees will help delight your customers, toxic ones will scare them away.<\/p>\n<p>Look for employees who are reliable and friendly. It doesn’t hurt if they are well-connected to the community either, because you can probably bank on some of their friends supporting your business. Great food truck employees will also have a working knowledge of the kitchen and will be able to talk in detail about the meals you serve—what’s in them, whether gluten-free options are available, where the food comes from, whether it’s possible to customize the order, that sort of thing.<\/p>\n<p>Because this decision is so important, you should choose your employees very carefully. It’s probably worth working really hard for a few more weeks if it means the difference behind hiring someone you can’t count on and hiring a rock star.<\/p>\n<h3>4. Get your legal affairs in order.<\/h3>\n<p>The geographic area you choose to operate your food truck business out of will determine what you need to do to ensure you’re complying with local laws and regulations. No matter where you wind up, you will have to obtain a food service permit that will need to be renewed on a regular basis (e.g., once a year).<\/p>\n<p>While each jurisdiction’s specific requirements will vary, you’ll generally need to register with the health department to make sure your vehicle is up to code and that your food is stored properly. You’ll also need to make sure that your water supplies are free from contaminants. If you use a commercial kitchen for food prep, inspectors will want to check that out, too.<\/p>\n<p>The health department may also want to see your team in action. To this end, there’s a chance they’ll stop by your food truck unannounced to see whether your staff is wearing gloves and that foods are stored at proper temperatures, among other things.<\/p>\n<p>In addition to passing health inspections, you’ll also need to secure business licenses, obtain an <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.irs.gov\/businesses\/small-businesses-self-employed\/how-to-apply-for-an-ein\">Employer Identification Number<\/a><\/span> for tax purposes, keep your vehicle registered and insured, and pass a fire safety inspection.<\/p>\n<p>Finally, you’ll have to familiarize yourself with local ordinances and zoning policies. What hours can you sell food during? Where can you park (in San Francisco, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/thebolditalic.com\/a-closer-look-at-sfs-food-truck-industry-69a56055dc05\">food trucks<\/a><\/span> can’t be within 75 feet of a restaurant)? Are there any limitations on how long you can stay in one location? These are the kinds of questions you’ll have to find answers to.<\/p>\n<h3>5. Embrace your inner entrepreneur.<\/h3>\n<p>Running any kind of business is hard work. Many people underestimate how much is involved in starting any business.<\/p>\n<p>Even if you only serve meals during the lunch window, there are all sorts of other tasks you’ll need to tend to—like processing payroll, ordering supplies, managing your finances, meeting with your team, networking with other businesses in the community, reaching out to media outlets for coverage, and more.<\/p>\n<p>Get ready to work like a machine. If all goes according to plan, you’ll be able to hire more employees and delegate some of these tasks. Investing in modern technology can also help streamline a lot of business-related responsibilities—like managing HR, processing payroll, keeping track of inventory, and even solving cash flow issues.<\/p>\n<p>Now that you have a good idea of what you need to do to run your business, let’s take a look at some ideas on how you can effectively market your business to attract more customers and grow your bottom line.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-600 wp-image-12248\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_516896896.jpg\" alt=\"People eating at a food truck business\" width=\"600\" height=\"400\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_516896896.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_516896896-768x512.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2><a id=\"Market\"><\/a>How to market a food truck business<\/h2>\n<p>You might be thinking: <span style=\"font-style: italic;\">If you park it, they will come.<\/span><\/p>\n<p>Unfortunately, it’s probably not going to be that easy. Sure, you might open up shop and get passersby to give you a whirl. But if you really want to grow your food truck into a successful business, you’ll need to spend some time and money marketing your operation.<\/p>\n<p>Here are six easy ways to do that.<\/p>\n<h3>1. Pay attention to your truck’s design.<\/h3>\n<p>Wherever your truck goes, the eyeballs will follow. Pay close attention to the way you ultimately decide to design your truck and brand it with your logo.<\/p>\n<p>Your food truck itself serves as a mobile advertisement for your business, so you want to make sure it commands attention and is pleasing to the eye. Since your truck is the first thing people will see when they encounter your business, it’s worth going the extra mile to make sure your design is engaging and appealing.<\/p>\n<h3>2. Get more trucks.<\/h3>\n<p>You’ve got awesome branding on your truck. But there’s a problem: Like you, your truck can’t be in two places at once. If business is going well and the market wants more of what you’re selling, you can buy a new truck, give it the same branding, and double your exposure.<\/p>\n<p>If you don’t have enough liquid cash to buy a new truck, don’t sweat it. You can apply for an <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/resources\/guides\/equipments-loan-financing\/\">equipment loan<\/a><\/span> to get the money you need to expand your reach with a new truck—or even a few of them.<\/p>\n<h3>3. Post on social networks.<\/h3>\n<p>Everyone is on social media and everyone likes looking at pictures of delicious food (except when we’re hungry!), so setting up a presence on Instagram is a no-brainer. You probably want to be on Facebook, too, because that’s where all of your customers are. Twitter is another platform to consider. And unless you’re building a food truck empire, you probably don’t need to be on LinkedIn.<\/p>\n<p>Grow your social network by offering unique deals and discounts to fans and subscribers who promote your business. What’s more, if your food truck is mobile and not in the same spot every day, your social media fans will be able to easily find out where you are by following your status updates.<\/p>\n<h3>4. Use email marketing to grow your fanbase.<\/h3>\n<p>As you grow your social networks and build up an email list, use email marketing to reach out to your customers every now and again, letting them know about new offerings, special deals, and any events coming up that your food truck is participating in (e.g., a music festival).<\/p>\n<p>Tools like Mailchimp can automate many of these tasks, so you won’t have to worry about staring at a computer all day and can instead focus on what you do best: serving your customers.<\/p>\n<h3>5. Cater private parties and community and business events.<\/h3>\n<p>People are increasingly hiring food trucks to cater all kinds of events: corporate outings, weddings, birthday parties, baby showers, graduation parties, and more.<\/p>\n<p>Not only do these types of opportunities give you a chance to generate more revenue, they also present great marketing opportunities. Stack a pile of buy-one-get-one-half-off coupons on your counter and let guests that are interested grab one at their leisure.<\/p>\n<h3>6. Encourage word-of-mouth advertising.<\/h3>\n<p>More than 80% of customers seek <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.business2community.com\/marketing\/numbers-dont-lie-2016-nielsen-study-revealed-referrals-01477256\">recommendations<\/a><\/span> before making buying decisions. This is why word-of-mouth advertising is incredibly effective.<\/p>\n<p>You can’t force customers to advertise on your behalf. But you can take proactive steps to ensure they have great experiences—increasing the chances they do.<\/p>\n<p>Be friendly, be prompt, and be courteous. Serve up great experiences to your customers on a regular basis, couple that with great food, and it’s only a matter of time before patrons recommend your food truck to their friends and colleagues.<\/p>\n<p>You’ve built a great food truck business and—thanks to your marketing efforts—you’ve grown your revenue considerably. Now it’s time to expand your food truck business to get to the next level.<\/p>\n<p>Next, we’ll explore exactly how you can do that.<\/p>\n<figure id=\"attachment_12249\" aria-describedby=\"caption-attachment-12249\" style=\"width: 600px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-600 wp-image-12249\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/CurryUpNow-and-Steph-Curry.png\" alt=\"\" width=\"600\" height=\"383\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/CurryUpNow-and-Steph-Curry.png 930w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/CurryUpNow-and-Steph-Curry-768x491.png 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><figcaption id=\"caption-attachment-12249\" class=\"wp-caption-text\"><em>Curry Up Now scored a visit to their food truck from basketball star Stephen Curry, and got some big love on their social media, too. Source: <\/em><a href=\"https:\/\/www.instagram.com\/p\/ByDzBONlYUM\/\"><em>Instagram.<\/em><\/a><\/figcaption><\/figure>\n<h2>How to expand your food truck business<\/h2>\n<p>Some entrepreneurs might be content having a single successful food truck.<\/p>\n<p>Others have bigger ambitions.<\/p>\n<p>Case in point? Akash Kapoor grew his <span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.curryupnow.com\/\">Curry Up Now<\/a><\/span> food truck business into an empire that now includes four food trucks, six restaurants, and two cocktail bars. Franchising is also in the works, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/upserve.com\/restaurant-insider\/turned-one-food-truck-culinary-empire-thats-still-growing\/\">Kapoor says<\/a><\/span>.<\/p>\n<p>As Curry Up Now demonstrates, it’s definitely possible to grow your food truck business into something much larger. It just might not be smooth sailing the entire time.<\/p>\n<p>After Silverstein launched The Peached Tortilla, he truly understood how difficult the food truck business actually was. Eventually, he realized that—instead of driving around from spot to spot or parking in one location—a different path forward made more sense.<\/p>\n<p>“We ended up turning to private events and kind of became this very food-truck-based catering company initially,” Silverstein continues.<\/p>\n<p>That decision opened the door for more opportunities. After Silverstein proved his Peached Tortilla concept successful, he targeted expansion.<\/p>\n<p>“The margins became a lot better. We became profitable and we were able to reinvest those profits back into the business.”<\/p>\n<p>Instead of adding more food trucks to the fleet, Silverstein opted to follow the same route as Kapoor, opening a bona fide restaurant.<\/p>\n<p>Thanks to the success of his food truck, Silverstein had access to the cash he needed to open a brick-and-mortar location.<\/p>\n<p>“Raising money wasn’t too challenging,” Silverstein continues. “I got a line of credit. I put my own money back into the business. I asked my investors to re-up and add more money to the pool and reinvest which they all did.”<\/p>\n<p>It’s unlikely every business owner will have as easy a time securing the capital needed to expand.<\/p>\n<p>If you’re eying the next step in the evolution of your food truck business and need financing, a flexible <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/blog\/\">line of credit<\/a><\/span> is a good option.<\/p>\n<h2><a id=\"Bestareas\"><\/a>The top 10 areas to run a food truck business<\/h2>\n<p>We all need to eat. That being the case, a food truck located anywhere lots of people are that serves good food at reasonable prices and has a friendly staff has a good chance at doing well.<\/p>\n<p>Some locations, however, have proven to be more lucrative—or at least less of a hassle—than others for food truck entrepreneurs.<\/p>\n<p>According to the experts at <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.foodtrucknation.us\/wp-content\/themes\/food-truck-nation\/Food-Truck-Nation-Full-Report.pdf\">Food Truck Nation<\/a><\/span> in collaboration with the U.S. Chamber of Commerce Foundation, here are the 10 best cities to run a food truck:<\/p>\n<ol>\n<li><span style=\"font-weight: bold;\">Portland<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Denver<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Orlando<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Philadelphia<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Indianapolis<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Houston<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Austin<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Los Angeles<\/span><\/li>\n<li><span style=\"font-weight: bold;\">New York City<\/span><\/li>\n<li><span style=\"font-weight: bold;\">Nashville<\/span><\/li>\n<\/ol>\n<h2>Additional resources<\/h2>\n<p>Still hungry for more information about starting, financing, and operating a food truck business?<\/p>\n<p>Here are some more resources you should check out in your research.<\/p>\n<ul>\n<li><span style=\"font-weight: bold; text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/resources\/guides\/funding\/\">Guide to Small Business Funding<\/a><\/span><span style=\"font-weight: bold;\"> <\/span>— This is the best place to start if you’re thinking about financing your food truck business. In this guide, learn about how business financing works, what types of financing options you should consider, how to apply for funding, and how to get approved.<\/li>\n<li><span style=\"font-weight: bold; text-decoration: underline;\"><a href=\"https:\/\/www.foodtruckoperator.com\/\">Food Truck Operator<\/a><\/span><\/li>\n<li><span style=\"font-weight: bold; text-decoration: underline;\"><a href=\"http:\/\/www.nationalfoodtrucks.org\/\">National Food Truck Association<\/a><\/span><\/li>\n<li><span style=\"font-weight: bold; text-decoration: underline;\"><a href=\"https:\/\/foodtruckempire.com\/\">Food Truck Empire<\/a><\/span><\/li>\n<li><span style=\"font-weight: bold; text-decoration: underline;\"><a href=\"https:\/\/foodtruckr.com\/\">FoodTruckr<\/a><\/span><\/li>\n<li><span style=\"font-weight: bold; text-decoration: underline;\"><a href=\"https:\/\/mobile-cuisine.com\/\">Mobile Cuisine<\/a><\/span><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>In 2015, the U.S. food truck industry brought in $856.7 million. By 2020, that number is expected to flirt with $1 &#8230;<\/p>\n","protected":false},"author":14,"featured_media":12245,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11545],"yst_prominent_words":[723,2123,11227,11231,11228,6173,11190,11192,11221,11210,11217,11207,11230,11229,11214,11213,11225,11223,9016,11199],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How to Start a Food Truck Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"In 2015, the U.S. food truck industry brought in $856.7 million. By 2020, that number is expected to flirt with $1 billion as food trucks increasingly open up shop all over the country—in places like Portland, Austin, Seattle, San Francisco, New York City, and everywhere in between. Suffice it to say that now is a"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Start a Food Truck Business | Fundbox Blog"},{"property":"og:description","content":"In 2015, the U.S. food truck industry brought in $856.7 million. By 2020, that number is expected to flirt with $1 billion as food trucks increasingly open up shop all over the country—in places like Portland, Austin, Seattle, San Francisco, New York City, and everywhere in between. Suffice it to say that now is a"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/start-food-truck-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_645031861.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_645031861.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In 2015, the U.S. food truck industry brought in $856.7 million. By 2020, that number is expected to flirt with $1 billion as food trucks increasingly open up shop all over the country—in places like Portland, Austin, Seattle, San Francisco, New York City, and everywhere in between. Suffice it to say that now is a"},{"name":"twitter:title","content":"How to Start a Food Truck Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/06\/shutterstock_645031861.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/start-food-truck-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12242"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12242"}],"version-history":[{"count":13,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12242\/revisions"}],"predecessor-version":[{"id":16292,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12242\/revisions\/16292"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12245"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12242"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12242"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12242"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12242"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}