{"id":12302,"date":"2019-07-09T07:33:00","date_gmt":"2019-07-09T14:33:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12302"},"modified":"2020-11-10T13:08:33","modified_gmt":"2020-11-10T21:08:33","slug":"i-dont-need-an-accountant-this-research-says-you-do","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/i-dont-need-an-accountant-this-research-says-you-do\/","title":{"rendered":"‘I Don’t Need an Accountant’: This Research Says You Do"},"content":{"rendered":"<p>Once tax season is over, it’s easy to put things like deductions and expenses aside and think about other things. However, that’s not a luxury small business owners can afford. Where traditional employees can wait for spring each year to start gathering up forms and donation receipts, as a business owner, it’s a good idea to take a more proactive approach if you want to stay financially healthy.<\/p>\n<p>But taxes and financials are complicated, made all the more challenging by changing tax codes and legal jargon that can confuse even the smartest among us. Like recreational climbers taking on Mt. Rainier, small business owners can benefit from investing in a guide—someone to lean on when the going gets tough. When it comes to taxes, that guide is usually an accountant or CPA.<\/p>\n<h2>“But I don’t need an accountant!”<\/h2>\n<p>Are you sure you don’t?<\/p>\n<p>In a recent <a href=\"https:\/\/quickbooks.intuit.com\/r\/taxes-money\/small-business-tax-survey\/\">tax reform survey<\/a> by QuickBooks Payroll, 48% of self-described small business owners said taxes were among their biggest challenges. Yet 38% of respondents said they still don’t enlist the help of an accountant at tax time. Sounds a bit like trying to catch a python without the help of a trained professional. Sure, you could reach your hand in there and grab it by the tail, but does that really sound like a good idea?<\/p>\n<p>Self-employed small business owners were even worse, according to a <a href=\"https:\/\/quickbooks.intuit.com\/self-employed\/expenses\/#expense-survey\">recent QuickBooks Self-Employed survey<\/a>. When asked how they determine business deductions and expenses, almost 40% said they consult an accountant.<\/p>\n<h2>How’s that working out?<\/h2>\n<p>Probably not great.<\/p>\n<p>73% of self-employed respondents in the QuickBooks survey said they deduct things they think they shouldn’t, and nearly 1 in 5 said they’d be nervous (or beyond nervous) if the IRS were to audit their business. Worst of all, business owners aren’t the only ones aware of the problem. In 2017, the IRS and the National Society of Tax Professionals estimated that Schedule C filers <a href=\"https:\/\/www.irs.gov\/pub\/irs-utl\/2016ntf-schedule-c-issues.pdf\">underpaid taxes by about $122 billion<\/a>, by overstating deductions and understating income. Suffice to say, small business owners, self-employed or otherwise, are in the crosshairs already.<\/p>\n<p>If things like expense tracking, deductions, and taxes make you anxious, consider what that stress is worth. Maybe you don’t need an accountant, but if having a professional on call can make your life and your finances easier, the peace of mind might be worth the expense.<\/p>\n<h2>The pros and cons of hiring an accountant<\/h2>\n<p>When asked why they didn’t hire an accountant to look over their taxes, 19% of respondents from the tax reform survey said it was because accountants were too expensive. 16% said they just didn’t see the value.<\/p>\n<p>It makes sense that so many small business owners don’t have an accountant lined up. Self-employed or otherwise, no one’s busier than a business owner, and finding the right accountant who is knowledgeable, affordable, and valuable takes time.<\/p>\n<p>Hiring a good accountant can help <a href=\"https:\/\/fundbox.com\/blog\/5-common-tax-mistakes-small-business-owners-make\/\">reduce the number of mistakes<\/a> many business owners make. It’s also worth the effort, or so say respondents in the tax reform survey who’ve used an accountant before.<\/p>\n<ul>\n<li>83% of survey respondents said their accountant saved them money.<\/li>\n<li>88% said their accountant saved them time.<\/li>\n<li>87% said their accountant reduced their stress.<\/li>\n<li>82% said their accountant helped them with compliance, saving them from any future IRS trouble.<\/li>\n<\/ul>\n<p>If value, to you, looks like more money, more time, less stress, and fewer legal problems, consider investing in an accountant.<\/p>\n<h2>What accountants do and where to get one<\/h2>\n<p>If you’ve never hired an accountant, rest assured that a good one isn’t just helpful around tax time. Sure, they can help you with taxes and deductions throughout the year, but what about things like expense tracking or budgeting?<\/p>\n<p>When asked about savings and unexpected expenses, 10% of self-employed respondents in the QuickBooks survey said an unexpected expense of $5,000 or more would put them out of business. Over half of respondents said they’d have to go into debt to pay a bill like that.<\/p>\n<p>Most business owners know the importance of budgeting. 83% of the self-employed workers surveyed said they have a budget for their business. However, less than 1 in 4 of them “always” sticks to it.<\/p>\n<p>Besides helping business owners budget, accountants also act as accountability partners. That’s because unlike their clients, they’re not mentally bogged down by the challenges of running a small business. They can devote their time and attention to the future. That’s according to 83% of business owners in the tax reform survey who said their accountant helped them plan ahead.<\/p>\n<p>By now, you might be thinking it’s time to let an accountant handle your accounts. So where do you go to find a good one?<\/p>\n<p>Caron Beesley, marketing communications consultant and a small business owner herself, recommends first reaching out to others for referrals. “Searching online for such a valued resource is like opening a can of worms; you’ll be bombarded with sponsored ads and listings with no real way of determining who’s worth pursuing and who’s not,” <a href=\"https:\/\/fundbox.com\/blog\/find-right-accountant-business\/\">she writes<\/a>.<\/p>\n<p>Your local chamber of commerce or <a href=\"https:\/\/www.sba.gov\/local-assistance\/find\/?type=Small%20Business%20Development%20Center&amp;pageNumber=1\">small business development center<\/a> might also be helpful. And it’s possible that the software solution you use to run your business’s financials might also be able to help. Many platforms have resource centers where business owners of all types can connect with industry-specific accounting professionals who are comfortable with the software solutions you’re already using. That means more answers than questions, an advisor who can help right out of the gate, and even fewer reasons to believe that an accountant isn’t valuable to you and your business.<\/p>\n<p><a href=\"https:\/\/fundbox.com\/resources\/tags\/accounting\/\"><img loading=\"lazy\" class=\"aligncenter wp-image-11904 size-600\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/05\/GuidetoAccounting@2x-banner-600x120.png\" alt=\"Fundbox Guide to Accounting ebook banner\" width=\"600\" height=\"120\" \/><\/a><\/p>\n<p><em><small>Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal and accounting advisors before engaging in any transaction. Please consult a tax professional for information about tax laws and how they apply to your business.<\/small><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Once tax season is over, it’s easy to put things like deductions and expenses aside and think about other things. &#8230;<\/p>\n","protected":false},"author":82,"featured_media":12305,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,72],"yst_prominent_words":[982,723,875,719,11166,3439,3368,1157,11164,11165,11163,11162,712,709,3259,3436,3367,3366,3438,11161],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"‘I Don’t Need an Accountant’: This Research Says You Do | Fundbox Blog","yoast_meta":[{"name":"description","content":"Taxes and financials are complicated, made all the more challenging by changing tax codes and legal jargon that can confuse even the smartest among us. Small business owners can benefit from investing in an accountant or CPA."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"‘I Don’t Need an Accountant’: This Research Says You Do | Fundbox Blog"},{"property":"og:description","content":"Taxes and financials are complicated, made all the more challenging by changing tax codes and legal jargon that can confuse even the smartest among us. Small business owners can benefit from investing in an accountant or CPA."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/i-dont-need-an-accountant-this-research-says-you-do\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_1230782830.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_1230782830.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Taxes and financials are complicated, made all the more challenging by changing tax codes and legal jargon that can confuse even the smartest among us. Small business owners can benefit from investing in an accountant or CPA."},{"name":"twitter:title","content":"‘I Don’t Need an Accountant’: This Research Says You Do | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_1230782830.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/i-dont-need-an-accountant-this-research-says-you-do\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12302"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/82"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12302"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12302\/revisions"}],"predecessor-version":[{"id":14185,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12302\/revisions\/14185"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12305"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12302"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12302"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12302"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12302"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}