{"id":12342,"date":"2019-07-25T08:07:00","date_gmt":"2019-07-25T15:07:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12342"},"modified":"2019-09-16T11:57:25","modified_gmt":"2019-09-16T18:57:25","slug":"incorporate-b-corporation","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/incorporate-b-corporation\/","title":{"rendered":"Ready to Incorporate as a B Corporation? Ask These 3 Questions"},"content":{"rendered":"<p>Are you planning to incorporate your business as a certified B Corporation? Congratulations! It’s exciting to take the step of <a href=\"https:\/\/fundbox.com\/blog\/sole-proprietor-or-incorporate\/\">incorporating your business<\/a>. B Corporations are a particularly unique entity.<\/p>\n<p>Forming a certified B Corp means that your business has decided to pursue a higher standard of purpose. In addition to turning a profit, B Corps are committed to upholding a specific social or environmental mission or otherwise using business as a force for good.<\/p>\n<p>However, the process for creating a <a href=\"https:\/\/blog.mycorporation.com\/2013\/08\/b-corp-vs-benefit-corporation-similar-names-different-duties\">certified B Corporation<\/a> does differ a bit from forming other entities like <a href=\"https:\/\/fundbox.com\/blog\/single-member-llc-member-managed-llc-whats-difference\/\">limited liability companies<\/a>. B Corporations conform to higher standards than companies that are not B Corp certified. Before you decide to incorporate as a certified B Corp, we recommend asking yourself the following questions to make sure this entity is the best fit for your business.<\/p>\n<h2>1. Is my business ready to meet higher standards?<\/h2>\n<p>Certified B Corps are all around us. We snack on ice cream treats from Ben &amp; Jerry’s, wear Athleta athletic apparel during workouts, and sleep on Casper mattresses. Almost any kind of product or service a business offers is eligible for certified B Corp status. The one catch is that the company must be able to adopt specific standards of purpose, accountability, and transparency.<\/p>\n<p>Take a moment to reexamine why you went into business. If you started a company solely to earn a lot of money and get rich quick, then a B Corporation would not be the right entity formation for you. What if you know you want to do good? Becoming a certified B Corp makes it possible to be a for-profit company that also commits to a general public benefit. Businesses that commit to a general public benefit aim to have a material, positive impact on society. Your goal isn’t to be the best business <em>in<\/em> the world. Ultimately, you want to be the best business <em>for<\/em> the world.<\/p>\n<p>For those businesses that are ready to “B The Change,” this is important. B Corporations are a hybrid between standard corporations and nonprofits. This means that the entity does not file traditional incorporation paperwork to send to the Secretary of State. Instead, they need to meet particular performance and legal requirements to achieve <a href=\"https:\/\/bcorporation.net\/\">certification from nonprofit group B Lab<\/a>.<\/p>\n<h2>2. Are you ready to take (and pass) the B Impact Assessment?<\/h2>\n<p>It’s time for a test — but we promise it’s not as intimidating as it might sound. For a B Corporation to become a certified B Corporation, businesses must first take and pass the free B Impact Assessment.<\/p>\n<p>How does this test work, exactly? The B Impact Assessment (BIA) helps measure and manage your social and environmental impact. The test includes a series of questions that focus on what it takes for your company to build a business that is better for its workers, community, and the environment. You can even view <a href=\"https:\/\/bimpactassessment.net\/how-it-works\/assess-your-impact#see-sample-questions\">sample questions<\/a> which help assess the company’s governance and its employer, community, and environmental practices.<\/p>\n<p>It takes no longer than 30 minutes to obtain a brief snapshot of your results. This snapshot, received after the test is complete, allows you to review the areas your business excels at and where it may need improvements. Those that want to be a fully certified B Corp, however, will need the full impact report. The full report takes two to three hours to complete and allows you to view your results holistically. Then, you can compare your answers to scores from thousands of other (anonymous) businesses and see how they responded to the same topic.<\/p>\n<p>To pass the BIA, test takers must receive a <a href=\"https:\/\/bcorporation.net\/certification\">minimum of 80 points<\/a> out of a possible 200 points. Businesses that do not pass are welcome to utilize free practice guides and improvement tools from BIA. Those that do score high enough to pass will be scheduled in for a virtual assessment review with a member of the B Lab staff. This review covers your BIA and may require submitting supporting documentation detailing and demonstrating how the company will commit to the general public benefit.<\/p>\n<p>If everything checks out, you’re nearly there to becoming a certified B Corp. There’s just one more major area to address.<\/p>\n<h2>3. Will my business meet legal requirements?<\/h2>\n<p>What’s the best way to determine if your business meets the legal requirements necessary to become a certified B Corporation? Try B Lab’s free <a href=\"https:\/\/bcorporation.net\/certification\/legal-requirements\">legal requirement tool<\/a>.<\/p>\n<p>A business that aims to become a certified B Corporation should integrate some element of sustainability into its company mission. The B Lab’s tool helps businesses to understand what they have to do to meet the legal requirements for B Corp certification.<\/p>\n<p>Depending on your state of incorporation and existing corporate structure, you may need to make the following legal changes:<\/p>\n<ul>\n<li>Amend governing documents or adopt a benefit corporation status.<\/li>\n<li>Update articles of incorporation.<\/li>\n<li>Communicate with any board members or legal counsel about the shift and whether or not implications will follow when making these changes.<\/li>\n<\/ul>\n<p>After receiving B Corp certification, it’s typically advisable to get board approval of its planned amendment and shareholder approval for the board-approved amendment, too.<\/p>\n<h2>The final step for B Corporation certification<\/h2>\n<p>Let’s say your business is ready to commit to a general public benefit. You passed the BIA, met the legal requirements, and reviewed final documents with a B Lab staffer.<\/p>\n<p>All that’s left is to sign the B Corp <a href=\"https:\/\/bcorporation.net\/about-b-corps\">Declaration of Interdependence<\/a> and sign your B Corp agreement (which you can find with the help of the B Lab legal requirement tool). Next, you would pay your <a href=\"https:\/\/bcorporation.net\/certification\">annual certification fees<\/a>. You can find these fees on the B Corporation website.<\/p>\n<p>If you’ve done all of that, then congratulations (again)! You’re now a certified B Corporation. Welcome to the global force committed to taking action to “B The Change” in the world and the future of business.<\/p>\n<p>&nbsp;<\/p>\n<p><em>Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal and accounting advisors before engaging in any transaction. Please consult a tax professional for information about tax laws and how they apply to your business.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you planning to incorporate your business as a certified B Corporation? Congratulations! It’s exciting to take the step of &#8230;<\/p>\n","protected":false},"author":80,"featured_media":12344,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11546],"yst_prominent_words":[11140,11148,11141,11143,11151,11152,11144,723,11137,11139,11138,11145,11149,11142,3368,11147,11146,11150,3367,3366],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"yellow","bw_feature":null,"category_color":null},"yoast_title":"Ready to Incorporate as a B Corporation? Ask These 3 Questions | Fundbox Blog","yoast_meta":[{"name":"description","content":"Forming a certified B Corp means that your business has decided to pursue a higher standard of purpose. However, the process for creating a certified B Corporation does differ a bit than forming other entities like limited liability companies. Here&#039;s what owners should consider when forming a B Corp."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Ready to Incorporate as a B Corporation? Ask These 3 Questions | Fundbox Blog"},{"property":"og:description","content":"Forming a certified B Corp means that your business has decided to pursue a higher standard of purpose. However, the process for creating a certified B Corporation does differ a bit than forming other entities like limited liability companies. Here&#039;s what owners should consider when forming a B Corp."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/incorporate-b-corporation\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_708344941.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_708344941.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"649"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Forming a certified B Corp means that your business has decided to pursue a higher standard of purpose. However, the process for creating a certified B Corporation does differ a bit than forming other entities like limited liability companies. Here&#039;s what owners should consider when forming a B Corp."},{"name":"twitter:title","content":"Ready to Incorporate as a B Corporation? Ask These 3 Questions | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_708344941.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/incorporate-b-corporation\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12342"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/80"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12342"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12342\/revisions"}],"predecessor-version":[{"id":12350,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12342\/revisions\/12350"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12344"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12342"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12342"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12342"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12342"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}