{"id":12352,"date":"2019-08-01T12:06:49","date_gmt":"2019-08-01T19:06:49","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12352"},"modified":"2022-06-24T08:53:03","modified_gmt":"2022-06-24T15:53:03","slug":"humans-fundbox-danielle-shaul","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/humans-fundbox-danielle-shaul\/","title":{"rendered":"Humans of Fundbox: Danielle Shaul"},"content":{"rendered":"<p>In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, we head to Tel Aviv, Israel, to meet Danielle Shaul. A three-year veteran of Fundbox, Danielle leads the Risk and Compliance Operations Team.<\/p>\n<p>In this conversation, Danielle shares how she got into programming, her time in the Israeli army, and how’s she’s helping build a strong local community of female engineers.<\/p>\n<figure id=\"attachment_12362\" aria-describedby=\"caption-attachment-12362\" style=\"width: 600px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-600 wp-image-12362\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/Danielle-Shaul-BW.png\" alt=\"\" width=\"600\" height=\"450\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/Danielle-Shaul-BW.png 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/Danielle-Shaul-BW-768x576.png 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><figcaption id=\"caption-attachment-12362\" class=\"wp-caption-text\"><em>Danielle Shaul, Risk and Compliance Operations Team lead at Fundbox, with her dog, Alex.<\/em><\/figcaption><\/figure>\n<h3>What’s your role at Fundbox? What’s a typical day like?<\/h3>\n<p><strong>Danielle Shaul:<\/strong> For about two years now I&#8217;ve been managing a Risk team, consisting of four talented engineers, which develops Fundbox’s core IP: the logic behind the underwriting process. As part of our daily routine, we implement models, rules, and Fundbox’s policies.<\/p>\n<p>My typical day is really busy! My job requires task management—it’s very hands-on. I spend some time in programming, working with the team and in meetings with other departments here in Fundbox as well as third parties and Fundbox’s partners. Risk is a dense area for Fundbox which is handled from many angles: we have a team of data scientists, a team of analytics folks, a team of engineers, and recently we hired a credit team in Texas.<\/p>\n<h3>When did you join Fundbox? What has your experience been here?<\/h3>\n<p>I joined Fundbox three years ago. I started as a developer on the payments team and then was promoted to manage the Compliance Risk team. After that, I moved to my current role, a Risk Team Leader.<\/p>\n<p>When I joined, we had around 50 employees in the Tel Aviv office. Now there are more than 100. My team has also grown in that time. At first, it was a one-person job whereas today we have more products, multiple flows, and processes are becoming a lot more complicated.<\/p>\n<h3>Previous to Fundbox, you&#8217;ve had some interesting jobs, including working with the Israeli Intelligence Corps and working as a software developer. Can you comment on your career path?<\/h3>\n<p>My technological career has begun during my military service. In Israel, it is mandatory to serve in the army. I was enlisted to an Israeli technological Intelligence unit. For me, it was natural to start there and then move towards more technical areas. When I was in school afterward, my student job was to give lectures about programming. That is when I understood that I really like coding and I’m still doing that today.<\/p>\n<p>I think the first time I discovered my passion was back in high school. I took computer science as my major and I really enjoyed it.<\/p>\n<p>I broadened my knowledge by practicing from an early age. In high school, for instance, I started doing little projects, building some websites for some people I knew and learning on the go.<\/p>\n<h3>How did you find Fundbox and what made you interested in joining?<\/h3>\n<p>A friend of mine who was a recruiter told me, &#8220;I&#8217;m working at an amazing company. You have to come and hear about it.&#8221;<\/p>\n<p>I came in for an interview with two really tough, brilliant engineers. I was so impressed by the conversations we had. Once I was hired, I was shocked and so proud to be part of this organization. I could not believe I was one of them.<\/p>\n<h3>What do you find interesting about this company?<\/h3>\n<p>What I really like here are the people and the fact that the original culture is kept even though the company is constantly growing.<\/p>\n<p>The devotion and the atmosphere here are really unique; people are always friendly and hardworking. This is something that I noticed from the very beginning and I still see it today. It&#8217;s rare that companies keep that in their DNA while they grow.<\/p>\n<p>I really believe in Fundbox’s products. They may change, but we always keep in mind our main goal: helping small businesses. That’s something I find valuable.<\/p>\n<h3>Can you talk about how what you do connects with our mission?<\/h3>\n<p>What my team does contributes to how Fundbox’s automated process works. The algorithm we designed estimates whether an applicant is qualified for funding and if so, what would be the credit limit that Fundbox will provide them. That affects the financial power we can help them gain. If approved, we try to assist those business and give them the highest credit limit amount as possible, in consideration with our limitation since we don&#8217;t want to lose money. It requires coordinating between the credit amount and the risk we are willing to take. That mission is highly related to what my team does.<\/p>\n<p>Anytime we modify a model or a policy, that’s having a direct influence on our underwriting process.<\/p>\n<h3>Recently in Tel Aviv, you presented at an event called WomenHack.<\/h3>\n<p>Yes, I gave a talk at <a href=\"https:\/\/womenhack.com\/\">WomenHack<\/a> about Fundbox, our operation and a little bit about us as employees and people. This event draws many women who are looking for their next challenge, seeking to get to know different companies in the high tech industry. When our Head of People, Iris Feinmesser told me, &#8220;There&#8217;s a really nice recruiting event for women,&#8221; I was interested in going. Several of us from the office attended as well and there was a good vibe around!<\/p>\n<p>We’re making an effort to attract more women as we build our engineering team in Tel Aviv. We would like to be more involved in the local engineering community in general, and we also currently have our own engineering women community inside Fundbox.<\/p>\n<p>There are still gaps, especially in the tech industry, between how women appreciate themselves and how they approach certain jobs or positions [when compared with men]. I think events like this can give women more confidence.<\/p>\n<p>Community building is really important in order to encourage women and educating people that women can handle these technical positions; it should be well known that there are really talented women who are already doing them.<\/p>\n<h3>What advice do you have for someone who&#8217;s interested in working at a place like Fundbox? Who thrives here?<\/h3>\n<p>First, believe in what you do and believe that you&#8217;re good enough to get your dream job.<\/p>\n<p>When I joined Fundbox I thought, &#8220;These people are very talented. I&#8217;m not at their level.&#8221; I was so impressed by them and I wanted to be part of this team. Believe in yourself, work hard, and you’ll get there.<\/p>\n<p>One more tip: networking. As I said, the person who got me to Fundbox is someone I worked with at my previous job. Networking is super important, especially in the tech industry. If you work hard and people appreciate your work, they’ll want to work with you again.<\/p>\n<p>Who thrives here? I think the most important thing would be good communication skills. The company currently has three different offices and many different teams. Almost all the projects that I work on involve other team members as well. Therefore, good communication which motivates and encourages them to be on board is super important. It can be the difference between doing something good and doing something awesome.<\/p>\n<p>&nbsp;<\/p>\n<p><em>Want to work with Danielle? <a href=\"https:\/\/fundbox.com\/careers\">Check out our Careers page.<\/a><\/em><\/p>\n<p><em>Want more Humans of Fundbox?<\/em><\/p>\n<ul>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/\">Meet Prashant Fuloria, Chief Operations Officer<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-gibson-holland\/\">Meet Gibson Holland, Sync Support Manager<\/a><\/em><\/li>\n<li><em><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-emad-elshawa\/\">Meet Emad ElShawa, Business Operations Manager<\/a><\/em><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/humans-fundbox-tom-goldschmiedt\/\"><em>Meet Tom Goldschmiedt, HR People Operations Manager <\/em><\/a><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><em>Header image: A city view of Tel Aviv.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space &#8230;<\/p>\n","protected":false},"author":61,"featured_media":12363,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,326],"yst_prominent_words":[11134,11129,2485,11130,838,10087,11136,10091,11135,1521,4268,11133,11128,11127,11131,3673,11132,9929,2490,1473],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Humans of Fundbox: Danielle Shaul | Fundbox Blog","yoast_meta":[{"name":"description","content":"In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, we head to Tel Aviv, Israel, to meet Danielle Shaul. A three-year veteran of Fundbox, Danielle leads the Risk and Compliance Operations Team. In this conversation,"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Humans of Fundbox: Danielle Shaul | Fundbox Blog"},{"property":"og:description","content":"In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, we head to Tel Aviv, Israel, to meet Danielle Shaul. A three-year veteran of Fundbox, Danielle leads the Risk and Compliance Operations Team. In this conversation,"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/humans-fundbox-danielle-shaul\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_1017181504.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_1017181504.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"750"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In our series, Humans of Fundbox, we feature some of the incredible folks within our company and give them space to share their stories. This month, we head to Tel Aviv, Israel, to meet Danielle Shaul. A three-year veteran of Fundbox, Danielle leads the Risk and Compliance Operations Team. In this conversation,"},{"name":"twitter:title","content":"Humans of Fundbox: Danielle Shaul | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/07\/shutterstock_1017181504.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/humans-fundbox-danielle-shaul\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12352"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12352"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12352\/revisions"}],"predecessor-version":[{"id":16306,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12352\/revisions\/16306"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12363"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12352"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12352"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}