{"id":12369,"date":"2019-08-06T08:00:27","date_gmt":"2019-08-06T15:00:27","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12369"},"modified":"2020-10-30T00:00:48","modified_gmt":"2020-10-30T07:00:48","slug":"welcome-new-net-terms-economy","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/welcome-new-net-terms-economy\/","title":{"rendered":"Welcome to the New Net Terms Economy"},"content":{"rendered":"<p>Right now, there is a massive <a href=\"https:\/\/www.pymnts.com\/smbs\/2019\/fundbox-business-trade-credit-b2b-payment-platforms\/\">$3.1 trillion<\/a> net terms economy hiding in plain sight.<\/p>\n<p>Yes, you heard that right. There are more than <i>three trillion dollars<\/i> in business capital held in suspended animation as negotiated net terms and outstanding invoices.<\/p>\n<p>Nearly every U.S. business connects somehow to this enormous ocean of out-of-reach funds.   Let’s explore a bit how this economy came into being and what opportunities exist today for unlocking its value.<\/p>\n<h2>A brief history of net terms<\/h2>\n<p>For decades, B2B commerce has been, in many ways, an alternate universe compared to B2C. Unlike with typical consumer transactions (where customers might pay for groceries with a credit card, for example), the B2B world is one where sellers frequently wait weeks or months to get paid unless they act as a bank and step in to provide short-term credit to buyers.<\/p>\n<p>B2B is a landscape where buyers seeking the necessary materials, inventory, and supplies to run their businesses are typically required to prove they are good credit candidates to each seller. Those buyers must then often abide by non-negotiable payment terms.<\/p>\n<p>In this reality, both sellers and buyers often wind up cash-starved and growth-challenged, with funds hanging in an accounts receivable limbo.<\/p>\n<p>Trade credit, otherwise known as “net terms,” has long driven this alternate universe. With net terms of 30, 60, 90 days or more, sellers front inventory to cash-strapped buyers, giving them a set amount of time to pay for the delivered goods.<\/p>\n<p>Trade credit might sound like a win-win solution, but it’s complicated. Trade credit can become a circular, never-ending cash flow <i>problem<\/i> for both buyers and sellers. We refer to this particular B2B challenge as the Net Terms Economy.<\/p>\n<p>According to <a href=\"https:\/\/www.pymnts.com\/smbs\/2019\/fundbox-business-trade-credit-b2b-payment-platforms\/\">PYMNTS<\/a>, the current Net Terms Economy exists mainly because of the cumbersome process of risk assessment for B2B businesses, coupled with the long waiting times to get paid.<\/p>\n<p>If a new buyer requests net terms from a seller, it puts the onus on the seller to assess the credit risk before they offer net terms.  The risk assessment process for most sellers is highly manual and takes a fair amount of time to complete.<\/p>\n<p>At the end of that assessment, the seller may deny offering terms to the buyer if the risk profile is too high. If the seller does offer terms, the terms might be too restrictive for the buyer to accept. Regardless, each business loses valuable time and opportunities when the trade credit financing process is slow, inefficient, or when the outcomes do not meet the needs of buyers. The status quo does not easily scale to meet the needs of today’s B2B e-commerce.<\/p>\n<p>However, this is all about to change.<\/p>\n<p>New technologies have emerged in the past decade to make it possible to provide credit decisions and on-demand access to business credit in near real-time. All of this enabled by the combined powers of data science, machine learning, and the ability to do business in the cloud. Its this technical confluence that will fuel the rapid acceleration of B2B payment and credit.<\/p>\n<p><strong>Critical factors include:<\/strong><\/p>\n<ul>\n<li style=\"font-weight: 400;\">Dynamic risk assessment<\/li>\n<li style=\"font-weight: 400;\">On-demand access to business capital<\/li>\n<li style=\"font-weight: 400;\">Better repayment terms<\/li>\n<li style=\"font-weight: 400;\">Financing at the point of transaction<\/li>\n<\/ul>\n<p>Let’s examine each of these critical factors needed to unlock the Net Terms Economy by way of faster intelligent B2B transactions.<\/p>\n<h2>1. Dynamic risk assessment at scale<\/h2>\n<p>For buyers to gain trade credit, traditionally a B2B seller must go through a lengthy and time-intensive process to understand the creditworthiness of a new buyer. To provide nearly real-time B2B payments, dynamic risk assessment—so that underwriting happens fast,  yet accurately—is a must.<\/p>\n<p>With the power of machine learning in the background, B2B sellers can extend financing from inside the checkout process, providing a better user experience with payment and credit options, contextualized at the point of need.<\/p>\n<h2>2. On-demand access to business capital<\/h2>\n<p>A key to unlocking the Net Terms Economy requires accessible funds (faster payment) as soon as an order is captured, and the risk assessment process is complete. By paying B2B sellers right way, capital is “unlocked” that would otherwise have remained inaccessible until a buyer pays their invoice off.<\/p>\n<p>Near real-time payments are eliminating the wait for modern B2B companies. Breakthroughs in machine learning technology that allow platforms to connect to cloud-based transactional data and analyze it in real-time, contributing to faster credit decisions, are driving the change.<\/p>\n<h2>3. Better repayment terms<\/h2>\n<p>The net terms of a new, real-time B2B payments solution must provide mutual benefits to both sellers and buyers they serve. Sellers need to get their money quickly, while buyers want the opportunity to capture flexible terms, which means they can make the necessary investments in their business to grow without disruptions to their cash flow.<\/p>\n<p>With today’s platforms, a “net 60” payment option with no interest can be made available during the online checkout process. They may also be able to extend their terms week-by-week (for 52 weeks) for a flat fee, in most US states.<\/p>\n<h2>4. Financing at the point of transaction<\/h2>\n<p>A new B2B e-commerce payment ecosystem requires the ability for buyers to get credit at the time of need, within the context of where they are making the online transaction. If that’s not available, and approval for net terms and trade credit is difficult, more abandoned carts are inevitable.<\/p>\n<p>The latest B2B payments solutions bring credit directly to the point of an e-commerce transaction, with plugins within the workflows of other platforms, marketplaces, portals, and applications.<\/p>\n<h2>Payment platforms for the Net Terms Economy<\/h2>\n<p>Times are changing for the Net Terms Economy. Many industries are taking advantage of technology to offer better, speedier B2B payments and credit.<\/p>\n<p>E-commerce platforms are now integrating with the Fundbox business capital platform to offer their customers a simple, fast, and transparent way to transact.<\/p>\n<p>New payment and credit solutions now allow sellers to be paid very quickly for a small interchange fee, while buyers can receive extremely fast trade-credit decisions. If approved, those buyers can use their credit with multiple vendors as well, with more generous payment terms. With tech-enabled solutions like this, B2B companies can offer payment ease for both buyers and sellers like never before.<\/p>\n<p>However, while <a href=\"https:\/\/www.pymnts.com\/study\/trade-credit-dilemma-report\/\">The Trade Credit Dilemma Report<\/a> findings indicated strong enthusiasm for these platforms, fewer than 14 percent of surveyed businesses currently use them, and nearly 20 percent have never even heard of them. Specifically, 54 percent of surveyed SMBs generating below $10 million in annual revenue report being “very” or “extremely” interested in using immediate payment platforms. A whopping 73 percent of larger firms cite wanting to send “faster payments” as buyers. In addition, companies show almost equal interest in immediate payments as sellers and buyers.<\/p>\n<p>Many survey respondents said that immediate payment platforms would not only ensure they’re paid promptly but also allow them to quickly purchase supplies (particularly helpful when there is no pre-existing trade credit relationship between the parties). Faster payments would then allow them to focus on their core missions and growth opportunities.<\/p>\n<h2>Vast opportunities from faster payments<\/h2>\n<p>The concept of net terms has been around for centuries, but the massive capital tied up in <a href=\"https:\/\/fundbox.com\/blog\/unpaid-invoices\/\">outstanding invoices<\/a> is a bigger problem than it has ever been. Sellers have gotten used to either waiting weeks or months for payment or having to take on the risk of extending trade credit directly to buyers.<\/p>\n<p>At the same time, buyers have become accustomed to being stuck with payment terms that don’t work for their cash flow cycles. It has never seemed like anything could change in the world of B2B payments.<\/p>\n<p>Getting paid right away is very powerful for B2B businesses and the entire small business economy. Now, the opportunity for a new, better Net Terms Economy that provides quicker payments has arrived. Both sellers and buyers can benefit from more timely credit decisions and on-demand funds.<\/p>\n<p>Thanks to the speed of today’s technology, supported by data and machine learning, there no longer needs to be an alternate B2B payments universe. Instead, today’s B2B companies of all sizes can grow to the best of their potential—right here in the real world.<\/p>\n<p>In conclusion, with intelligent risk assessment and on-demand access to payments and business credit, businesses on both sides of the equation are benefiting. The opportunity to create transformational change by unlocking the Net Terms Economy is now a reality.<\/p>\n<h2>More on the New Net Terms Economy<\/h2>\n<p><a href=\"https:\/\/www.pymnts.com\/smbs\/2019\/fundbox-business-trade-credit-b2b-payment-platforms\/\">Download the Trade Credit Dilemma report<\/a>, a PYMNTS publication.<\/p>\n<p><a href=\"https:\/\/oroinc.com\/b2b-ecommerce\/net-terms-economy\">Download the New Net Terms Economy whitepaper<\/a>, our collaboration with OroCommerce.<\/p>\n<p>&nbsp;<\/p>\n<p><em><small>Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal and accounting advisors before engaging in any transaction. Please consult a tax professional for information about tax laws and how they apply to your business.<\/small><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Right now, there is a massive $3.1 trillion net terms economy hiding in plain sight. Yes, you heard that right. &#8230;<\/p>\n","protected":false},"author":57,"featured_media":12371,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72],"yst_prominent_words":[11081,4097,8426,739,11080,3919,2960,11073,11083,11077,11075,11078,11079,3366,3842,11074,2102,11069,11082,11076],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"Welcome to the New Net Terms Economy | Fundbox Blog","yoast_meta":[{"name":"description","content":"Trade credit can become a circular, never-ending cash flow problem for both buyers and sellers. We refer to this particular B2B challenge as the Net Terms Economy. Here, we examine the 4 critical factors needed to unlock the $3 trillion hidden in plain sight."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Welcome to the New Net Terms Economy | Fundbox Blog"},{"property":"og:description","content":"Trade credit can become a circular, never-ending cash flow problem for both buyers and sellers. We refer to this particular B2B challenge as the Net Terms Economy. Here, we examine the 4 critical factors needed to unlock the $3 trillion hidden in plain sight."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/welcome-new-net-terms-economy\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/08\/shutterstock_1068985397.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/08\/shutterstock_1068985397.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Trade credit can become a circular, never-ending cash flow problem for both buyers and sellers. We refer to this particular B2B challenge as the Net Terms Economy. Here, we examine the 4 critical factors needed to unlock the $3 trillion hidden in plain sight."},{"name":"twitter:title","content":"Welcome to the New Net Terms Economy | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/08\/shutterstock_1068985397.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/welcome-new-net-terms-economy\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12369"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/57"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12369"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12369\/revisions"}],"predecessor-version":[{"id":12373,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12369\/revisions\/12373"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12371"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12369"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12369"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12369"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12369"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}