{"id":12384,"date":"2019-08-15T07:19:00","date_gmt":"2019-08-15T14:19:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12384"},"modified":"2019-09-16T11:50:44","modified_gmt":"2019-09-16T18:50:44","slug":"business-benefit-rd-tax-credit","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/business-benefit-rd-tax-credit\/","title":{"rendered":"Could Your Business Benefit From an R&#038;D Tax Credit?"},"content":{"rendered":"<p>Small and medium-sized companies are a significant part of the United States economy, <a href=\"https:\/\/advocacy.sba.gov\/2018\/12\/19\/advocacy-releases-small-business-gdp-1998-2014\/\">creating two-thirds of net new jobs<\/a> and driving innovation and competitiveness. Some <a href=\"https:\/\/www.nsf.gov\/statistics\/2017\/nsf17320\/nsf17320.pdf\">statistics<\/a> show that these businesses perform 12 percent of the nation’s total research and development (R&amp;D). Although the number seems relatively small, these companies have demonstrated the ability for significant job creation.<\/p>\n<p>But innovation comes at a price. Small businesses often face obstacles that their larger enterprise cousins don’t and must overcome barriers with fewer resources.<\/p>\n<p>In light of these challenges, in 2015, the U.S. Small Business Administration (SBA) <a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/advocacy\/FINAL_Innovation_Report.pdf\">advocated<\/a> that “…in order for the United States to obtain the maximum economic and societal benefits from innovation, policies must be in place that allows these small companies to start their firms, innovate, bring new products and services to market, and grow their businesses.”<\/p>\n<p>That same year, Congress took action and passed the <a href=\"https:\/\/www.investopedia.com\/terms\/p\/path-act.asp\">PATH Act<\/a>. The Act made a little-known government incentive—the <a href=\"https:\/\/www.irs.gov\/businesses\/small-businesses-self-employed\/qualified-small-business-payroll-tax-credit-for-increasing-research-activities\">R&amp;D tax credit<\/a>—permanent. It also lowered the eligibility bar, allowing businesses with gross receipts of less than $50 million to take advantage of the credit and reduce their tax liability beginning in the tax year of 2016.<\/p>\n<p>So far, the R&amp;D tax credit has provided <a href=\"https:\/\/www.forbes.com\/sites\/deanzerbe\/2019\/04\/26\/rd-tax-credit-still-the-one-for-small-and-medium-business-owners\/#3c7f8cd22910\">approximately $10 billion in tax savings<\/a> to business innovators. Yet despite making the incentive more accessible to small business owners, many fail to claim it.<\/p>\n<p>To find out more about the tax credit and why it’s so often ignored, we sat down with Tom McDanell, Senior Vice President, and Scott Manoff, Senior R&amp;D Tax Credit Consultant, both of <a href=\"https:\/\/www.leyton.com\/en\/usa\/home\">Leyton USA<\/a>, a consulting group that helps business owners determine their eligibility and apply for R&amp;D tax credits.<\/p>\n<h2>In this article:<\/h2>\n<ul>\n<li>What is the R&amp;D tax credit?<\/li>\n<li>Which businesses qualify for the R&amp;D tax credit?<\/li>\n<li>How is the R&amp;D tax credit calculated?<\/li>\n<li>What are the first steps to claiming the credit?<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2>What is the R&amp;D tax credit?<\/h2>\n<p>“To get to the advances in technology that the country is looking for, people need to spend money on R&amp;D. Ultimately the R&amp;D credit is there to incentivize people to do that,” said McDanell.<\/p>\n<p>However, the <a href=\"https:\/\/www.irs.gov\/businesses\/small-businesses-self-employed\/qualified-small-business-payroll-tax-credit-for-increasing-research-activities\">IRS definition of the R&amp;D tax credit<\/a> is somewhat vague: “As a qualified small business with qualifying research expenses, you can apply up to $250,000 of your research credit against your payroll tax liability.”<\/p>\n<p>“What that boils down to is that around about 10 percent to 15 percent of the money you spend on R&amp;D can be taken back as a tax credit,” explains McDanell. “That can either be offset against your federal income tax or, more interestingly, for startups who are more likely to be pre-revenue, it can be taken as an immediate benefit against their payroll tax.”<\/p>\n<p>The credit is a federal incentive, but many states offer an R&amp;D tax credit as well. For example, California offers an attractive credit that mirrors the IRS tax code.<\/p>\n<h2>Which businesses qualify for the R&amp;D tax credit?<\/h2>\n<p>Unlike other R&amp;D government incentives, the R&amp;D tax credit benefits many companies not just larger firms who specialize in high tech or life sciences.<\/p>\n<p>“A common misconception is that R&amp;D tax credits are limited to large companies with established R&amp;D departments. In reality, any company that develops new or improved products, processes, or software is likely to qualify under the U.S. tax code,” said McDanell.<\/p>\n<p>This encompasses everything from food to software, drugs to textiles, aerospace to agriculture.<\/p>\n<p>“I think last year, around 50 industries claimed the tax credit, and it can be as far-reaching as the pharmaceutical world through to farming, agriculture, architecture, food science, reducing salt content in foods. All this good stuff can potentially qualify for the credit,” said McDanell.<\/p>\n<p>Other notable candidates for the tax credit are engineering firms. “Every commercial project, regardless of whether it&#8217;s a structure, building, bridge, or anything else for that matter, would require engineering. That engineering is all custom, so a lot of that would potentially qualify as well,” said Manoff.<\/p>\n<p>However, as McDanell explains, there are plenty of grey areas when it comes to eligibility.<\/p>\n<p>For example, industries such as construction and architecture are transforming due to advancements in technology. For example, virtual reality, 3D visualization, solar, and green energy are all having an impact. Such projects may be candidates for the tax credit. However, more conventional projects such as conventional housing design by an architect may not.<\/p>\n<h2>How is the R&amp;D tax credit calculated?<\/h2>\n<p>The R&amp;D tax credit is calculated using <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/f6765.pdf\">IRS Form 6765<\/a> and included with your tax return. The IRS has posted <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/i6765.pdf\">instructions for completing your R&amp;D tax credit claim<\/a>. However, the challenge for most business owners and CPAs is determining the total qualified research expenses and attributing a percentage of employee wages to R&amp;D efforts.<\/p>\n<p>Figuring out your R&amp;D tax credit is a complex and potentially painful process. While there’s lots of advice to be found online, each situation is unique. Even if you’re knowledgable about taxes, you might want to enlist some assistance here.<\/p>\n<p>To help ensure your potential tax savings don’t go unclaimed, seek expert help from accounting firms and consultants who specialize in R&amp;D tax credits. They can work alongside those in your company who completed the R&amp;D work to figure out which expenses qualify (equipment, software costs, packaging, surveys, and studies, etc.). An expert can also help you decide whether to claim the credit against <a href=\"https:\/\/www.journalofaccountancy.com\/issues\/2019\/feb\/r-d-tax-credit-against-payroll-tax-amt.html\">payroll taxes or alternative minimum tax (AMT)<\/a>, and determine which calculation method will give you the bigger credit. Finally, an expert can advise on any impact <a href=\"https:\/\/www.thetaxadviser.com\/newsletters\/2019\/tcja-effect-research-development-tax-credit-planning.html\">the Tax Cut and Jobs Act of 2017 might have<\/a> on future tax credit planning.<\/p>\n<h2>What are the first steps to claiming the credit?<\/h2>\n<p>Not all accountants and tax preparers have the necessary expertise in the nuances of R&amp;D to help you in this area. Some accountants may not be able to advise their clients as to whether they can claim the credit.<\/p>\n<blockquote><p><strong>Read more about <a href=\"https:\/\/fundbox.com\/blog\/find-right-accountant-business\/\">how to find the right accountant for your business.<\/a><\/strong><\/p><\/blockquote>\n<p>McDanell recommends that businesses work with a third-party to assess their projects and investments and compile the necessary documentation required by the IRS to substantiate their claim—which can also protect you in the event of an audit.<\/p>\n<p>“A bookkeeper is unlikely to have the capacity to really support a proper R&amp;D study,” says McDanell. “They may just recommend putting a number in the <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/f6765.pdf\">R&amp;D tax form<\/a>, which is a very risky process because the IRS is very stringent on documentation and substantiation. If your business is audited and the IRS wants to know how you arrived at that number, sitting around the table with your CPA for 15 minutes is just not going to cut it. You&#8217;ll get that R&amp;D credit pulled or even face a fine.” Generally, that fine equates to 20 percent of the disallowed credit and may even include interest from the date the tax should have been paid.<\/p>\n<p>“In all seriousness, I think if you want to go down the route of looking into the credit, the best course of action is getting on the phone with someone like Leyton to talk through the project you&#8217;re working on, the business structure, and the employees you have. We can give a quick analysis of whether we think you qualify, what potential benefit could be and then go from there, said McDanell. “Get a second opinion on whether you qualify, and more importantly, to what extent.”<\/p>\n<blockquote><p><strong>Read more about <a href=\"https:\/\/fundbox.com\/blog\/accountant-can-business-cant\/\">what an accountant can do<\/a> for your business (and what they can&#8217;t).<\/strong><\/p><\/blockquote>\n<h2>Don’t overlook this valuable tax credit<\/h2>\n<p>Given the confusion about eligibility, even among the general bookkeeping and accounting industry, the R&amp;D tax credit is most likely massively under-claimed. For instance, in 2011 (the last date for which statistics are readily available) <a href=\"http:\/\/advantataxadvisors.com\/content\/uploads\/The-RD-Tax-Credit-Underclaimed-Misunderstood.pdf\">$9.2 billion R&amp;D credits were claimed<\/a>, but a <a href=\"http:\/\/www.nsf.gov\/statistics\/infbrief\/nsf14307\/\">report<\/a> from the National Science Foundation found that another $3-4 billion could have been claimed but were not. While this data isn’t very recent, and it’s nearly impossible to know for sure, it’s reasonable to guess that billions of dollars could be claimed each year but haven’t been. That’s a lot of money left on the table.<\/p>\n<p>As our conversation shows, you don’t have to be a scientist in a laboratory or run a giant enterprise qualify for the credit. Innovation can happen anywhere—in your garage, on your farm, in a small engineering office. As you bring your innovative products and services to market, don’t overlook this tax incentive.<\/p>\n<p>&nbsp;<\/p>\n<p><small><em>Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal, or accounting advice. You should consult your own tax, legal, and accounting advisors before engaging in any transaction. Please consult a tax professional for information about tax laws and how they apply to your business.<\/em><\/small><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Small and medium-sized companies are a significant part of the United States economy, creating two-thirds of net new jobs and &#8230;<\/p>\n","protected":false},"author":7,"featured_media":12387,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,11504],"yst_prominent_words":[739,3368,4505,3367,3366],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"blue","bw_feature":null,"category_color":null},"yoast_title":"Could Your Business Benefit From an R&amp;D Tax Credit? | Fundbox Blog","yoast_meta":[{"name":"description","content":"Small and medium-sized companies are a significant part of the United States economy, creating two-thirds of net new jobs and driving innovation and competitiveness. Some statistics show that these businesses perform 12 percent of the nation’s total research and development (R&amp;D). Although the number seems"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Could Your Business Benefit From an R&amp;D Tax Credit? | Fundbox Blog"},{"property":"og:description","content":"Small and medium-sized companies are a significant part of the United States economy, creating two-thirds of net new jobs and driving innovation and competitiveness. Some statistics show that these businesses perform 12 percent of the nation’s total research and development (R&amp;D). Although the number seems"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/business-benefit-rd-tax-credit\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/08\/shutterstock_1280781235.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/08\/shutterstock_1280781235.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Small and medium-sized companies are a significant part of the United States economy, creating two-thirds of net new jobs and driving innovation and competitiveness. Some statistics show that these businesses perform 12 percent of the nation’s total research and development (R&amp;D). Although the number seems"},{"name":"twitter:title","content":"Could Your Business Benefit From an R&amp;D Tax Credit? | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/08\/shutterstock_1280781235.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/business-benefit-rd-tax-credit\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12384"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12384"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12384\/revisions"}],"predecessor-version":[{"id":12386,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12384\/revisions\/12386"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12387"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12384"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12384"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12384"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12384"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}