{"id":1246,"date":"2015-03-16T09:00:00","date_gmt":"2015-03-16T16:00:00","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=1246"},"modified":"2022-06-13T06:35:54","modified_gmt":"2022-06-13T13:35:54","slug":"kick-ass-marketing-program","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/kick-ass-marketing-program\/","title":{"rendered":"Don’t Waste $$ on Marketing that Doesn’t Work—Create a Kick-Ass Program in 5 Steps"},"content":{"rendered":"<p>If you’re looking for a one-of-a-kind, step-by-step overview of how to put a repeatable kick-ass marketing program in place for your small business – focused on doing, not theory – then you won’t want to miss the archive recording of one of the most insightful sessions at last year’s <a href=\"http:\/\/www.sba.gov\/nsbw\/\" target=\"_blank\" rel=\"noopener\">National Small Business Week<\/a>.<\/p>\n<p>“<a href=\"https:\/\/www.youtube.com\/watch?v=ZdkQKLLD9_g&amp;feature=youtu.be\" target=\"_blank\" rel=\"noopener\">Practical Marketing – A Five Step Marketing Program for Small Business<\/a>” hosted by Tina Stock, Executive Director of Marketing with <a href=\"http:\/\/www.yellowpages.com\/\" target=\"_blank\" rel=\"noopener\">YP<\/a> (formerly Yellow Pages and now North America’s largest local search, media and advertising company) gives small business users a checklist of things that you can do to immediately grow your business. If you’re an experienced marketer, it will help you to refocus your efforts.<\/p>\n<p>Here’s a recap of Tina’s recommendations of the essential components of any small business marketing program that anyone can implement:<\/p>\n<p><strong>Get Started by Identifying Your Ideal Customer<\/strong><br \/>\nKick-starting any marketing program is hard. But Tina recommends a couple of simple exercises that can help – 1) <strong>identifying your ideal customer<\/strong> so that you can focus your marketing activities where you’re going to get the biggest reward and 2) <strong>developing a 60 second business story<\/strong> that gives customers a compelling reason to do business with you.<\/p>\n<p>What is an ideal customer? Well, this is the person who not only wants to do business with you, but who YOU want to do business with. Finding that customer can help your bottom line by focusing your marketing activities on reaching the most profitable group. To find your ideal customer, start by identifying 5-10 descriptive terms that paint a picture of that person. To speed up the process, pull terms from these four buckets:<\/p>\n<ul>\n<li><strong>Demographic<\/strong>: Male, female, income, age, etc.<\/li>\n<li><strong>Location<\/strong>: Neighborhood, city, state, everywhere, etc.<\/li>\n<li><strong>Interests<\/strong>: Hobbies, affinities, clubs, associations, etc.<\/li>\n<li><strong>Life events and stages<\/strong>: Engaged, married, expecting, retired, etc.<\/li>\n<\/ul>\n<p>Look for patterns and usual suspects and ignore the exceptions. Here’s an example of an ideal customer called “Susie’s Garden Shop.” Her customer is probably a woman between 30 and 50, with a family income of over $75,000 who lives within 20 miles of her shop and enjoys gardening and buys gardening supplies every spring.<\/p>\n<p>Defining your ideal customer is only half of getting started, you’ll also need to talk about your business in a way that’s going to make this customer want to do business with you. You need a 60 second story. Follow the following flow to create yours (Susie’s business story thrown in to demonstrate how it comes together):<\/p>\n<ul>\n<li><strong>What do you do<\/strong>? “<em>I have a garden shop<\/em>” (be simple and concrete as possible).<\/li>\n<li><strong>What problem do you solve?<\/strong> “<em>I sell specialty and exotic plants<\/em>” (focus on the one problem that you solve better than anyone else)<\/li>\n<li><strong>How your business is different?<\/strong> “<em>The plants I sell are not in big box stores<\/em>” (for most small business owners the key difference between you and your competitor is you your personality, years in business, community relationships, and so on)<\/li>\n<li><strong>What is their happily ever after? <\/strong>How is your customer’s life different after doing business with you? “<em>They can have the garden of their dreams.<\/em>”<\/li>\n<\/ul>\n<p>And there’s your 60 second story: “<em>I am Susie, I have a garden shop that sells specialty and exotic plants that aren’t available in big box stores, so that my customers can have the garden of their dreams<\/em>.”<\/p>\n<p>But knowing who your ideal customer is and knowing what you’re going to say to them isn’t enough, this leads us to step two. You need to get your business online so that your ideal customer can find you and learn about your business.<\/p>\n<p><strong>Get Your Business Online<\/strong><br \/>\n97% of Internet users search for local businesses online, but getting online means having more than just a website. Tina stresses three areas to focus your efforts:<\/p>\n<ol>\n<li><strong>Have control of your business listing<\/strong> – This is a free and easy way to get your business online and help customers find you across sites like Google, Bing, and YP as well as review sites like Yelp, and social sites like Facebook. If your business is listed – claim your listing and make sure it’s accurate. If you’re not listed, get on there ASAP. At a minimum, Tina suggests controlling your business listing across the top five publishers – Google+, Facebook, YP.com, Yahoo and Yelp. To do this, go to each site, search for your business, then claim your business listing if it exists or add it if it does not.<\/li>\n<li><strong>Get a mobile responsive website<\/strong> – This means having a site that’s designed to fit and be easy to navigate on a small screen. A responsive site will make it easier for customers to contact you once they find you online. You can easily check whether your site is responsive by visiting your site, and zooming your browser out until you’re looking at your website at 27-33% of your normal size. If your site looks the same as it did at 100% or the content moved around or changed order then it’s likely to be mobile responsive, if it’s just a smaller version, it isn’t – talk to your webmaster about getting it updated.<\/li>\n<li><strong>Optimize your website for search engines <\/strong>– This is a big topic and hard to cover in its entirety, but Tina offered some great tips for determining the following:<\/li>\n<\/ol>\n<ul>\n<li><strong>Is your site optimized?<\/strong> Can Google find your site? Head on over to Google and search for “site:” then your URL, for example: “site:fundbox.com”. If your site doesn’t show up then Google doesn’t know your site exists. If your site does show up, look for how many pages Google indexes (or how many pages of your site are findable). If you’re within a 10% difference, say you have 50 pages and Google finds 45, you’re in a good place. If it’s over a 20% difference, then you have work to do.<\/li>\n<li><strong>Is your site optimized accurately?<\/strong> Does Google think your site is relevant for the terms that your ideal customer is going to use to find you? Think about the words or phrases that customers use to search for businesses like yours and compare these with the words on your website – both in your main content but also in meta-tags and title tags.<\/li>\n<li><strong>Is your site optimized effectively to get you to the top of the results?<\/strong> Does Google think your site is important? This comes down to how unique your content is and how many other sites reference that content (backlinks). It can be hard to perfect this task and an SEO consultant can help, but Tina recommends focusing your efforts on ensuring that when people search for your business by its name, that your site pops up at number one in the search results. This is where your third party business listings, keywords, and tags can help.<\/li>\n<\/ul>\n<p><strong>Getting Leads<\/strong><br \/>\nJust being online isn’t always enough, you may be getting customers but not at the volume needed to grow your business. This in when investing in advertising makes the most sense. Tina suggests starting small (you don’t need a huge budget), making your campaign measurable (tracking clicks, site impressions, etc.), and providing compelling calls to action (downloads, registrations, bookings, etc.). Your campaign should also be reproducible so that you can roll out the same message and actions across multiple media instead of being all over the place. Check out the <a href=\"https:\/\/www.youtube.com\/watch?v=ZdkQKLLD9_g&amp;feature=youtu.be\" target=\"_blank\" rel=\"noopener\">video<\/a> at the 22-minute mark for a deep dive into some smart tactics for getting quality leads, not just traffic to your website.<\/p>\n<p><strong>Get Fans For Your Business<\/strong><br \/>\nFans are repeat customers, but they also recommend your business to other people –a very economical way to grow your business. How do you turn customers into fans? Well you keep in touch on social media, you reward loyalty with volume discounts or membership perks, and you make it easy for customers to refer your business. Check out the <a href=\"https:\/\/www.youtube.com\/watch?v=ZdkQKLLD9_g&amp;feature=youtu.be\" target=\"_blank\" rel=\"noopener\">video<\/a> at the 30-minute mark for some easy-to-implement tips and tricks for doing this.<\/p>\n<p><strong>Get Better<\/strong><br \/>\nMarketing is an investment, to get better at it you need to assess where you are with it versus where you want to be. As you review your program, start by measuring the effectiveness of the source of your leads. You could do this by simply asking new customers how they heard about you. For some rock solid data, consider using unique phone lines for certain campaigns and track how effective the enquiries to that line have been. You can do the same with unique URLs to track the success of digital programs (use Google Tag Manager to create these).<\/p>\n<p>Once you’re tracking your marketing programs you can make smart decisions on how to optimize your marketing spend –whether it’s by improving what you’re already doing, adding new media, new campaigns, or more money, or dropping tactics that don’t work.<\/p>\n<p><strong><em>Tip<\/em><\/strong>: Each of the five steps above is intended to build on each other and work together, although you can use them in the order that makes most sense for you.<strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re looking for a one-of-a-kind, step-by-step overview of how to put a repeatable kick-ass marketing program in place for &#8230;<\/p>\n","protected":false},"author":7,"featured_media":15815,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[10158],"yst_prominent_words":[4629,4628,723,4622,4624,4621,938,4620,4623,1510,4245,4627,4617,4618,4619,3404,4625,712,4626,4616],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"yes","category_color":null},"yoast_title":"Create a Kick-Ass Marketing Program in 5 Steps","yoast_meta":[{"name":"description","content":"If you’re looking for a one-of-a-kind, step-by-step overview of how to put a repeatable kick-ass marketing program in place for your small business."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Create a Kick-Ass Marketing Program in 5 Steps"},{"property":"og:description","content":"If you’re looking for a one-of-a-kind, step-by-step overview of how to put a repeatable kick-ass marketing program in place for your small business."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/kick-ass-marketing-program\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Screen-Shot-2022-04-07-at-11.27.36-AM.png"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Screen-Shot-2022-04-07-at-11.27.36-AM.png"},{"property":"og:image:width","content":"1141"},{"property":"og:image:height","content":"706"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"If you’re looking for a one-of-a-kind, step-by-step overview of how to put a repeatable kick-ass marketing program in place for your small business."},{"name":"twitter:title","content":"Create a Kick-Ass Marketing Program in 5 Steps"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Screen-Shot-2022-04-07-at-11.27.36-AM.png"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/kick-ass-marketing-program\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1246"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=1246"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1246\/revisions"}],"predecessor-version":[{"id":16060,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1246\/revisions\/16060"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15815"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=1246"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=1246"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=1246"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=1246"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}