{"id":1254,"date":"2015-03-24T07:10:00","date_gmt":"2015-03-24T14:10:00","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=1254"},"modified":"2022-06-23T12:15:44","modified_gmt":"2022-06-23T19:15:44","slug":"setting-your-salary-as-a-business-owner","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/setting-your-salary-as-a-business-owner\/","title":{"rendered":"Setting Your Salary &#8211; Why You Must Pay Yourself a Fair Wage"},"content":{"rendered":"<p>The idea of a salary is quite a novelty for many new business owners, particularly sole proprietors and freelancers, who often settle for pocketing whatever’s left over once the bills have been paid. But what should you pay yourself and how do you balance that with the need to pump more money back into your business?<\/p>\n<p>Let’s take a look at some of the key considerations and number-crunching that goes into setting a small business owner’s salary.<\/p>\n<p><strong>Have a Plan<\/strong><br \/>\nIf you’re serious about your business, then you’ll have a plan. According to <a href=\"http:\/\/www.score.org\/resources\/pay-yourself-first\" target=\"_blank\" rel=\"noopener noreferrer\">SCORE<\/a>, salary levels should be figured into the business plan so that your projections for revenue will allow you to reach that salary. Make sure your revenue projections include that. If not, you will be working for yourself at less than what someone else could pay you—and that may not be worth it!<\/p>\n<p><strong>Aim for a Cash Flow Positive Situation<\/strong><br \/>\nYour salary is a function of your business’ cash flow. So make sure you’re doing everything to optimize collections (limit your terms to no more than 30 days), invoice as soon as your work is complete, all that good stuff. If all these work in your favor then you should be able to pay yourself and your bills each month.<\/p>\n<p><strong>Be Prepared for a Variable Salary in the Beginning<\/strong><br \/>\nIf you’re in the start-up phase then setting a consistent salary isn’t going to be easy. While you’re busy building your business, you’ll likely have to settle for what’s left over once all your bills have been paid. But as your business starts to break even and realize a profit, setting yourself a salary has many benefits that can help drive financial stability and the future growth of your business as the next few pointers make clear.<\/p>\n<p><strong>Separate Salary from Returns<\/strong><br \/>\nOne critical mistake that many small business owners make is that they fail to separate the salary they draw from the returns their business has generated.<\/p>\n<p>Look at it this way. Your salary is what you pay yourself for the work you do. Whereas the returns, your business bring in, over and above your salary (kind of like shareholder returns), are there to be invested as you see fit. Don’t confuse the two.<\/p>\n<p>Some business owners might be happy to draw a salary once a month and break even, but if your business is going to grow, you need think strategically at how to maximize your returns for future growth.<\/p>\n<p><strong>Review Marketplace Norms<\/strong><br \/>\nJust as you’d study market, geographic, and industry benchmarks to help determine a new employee’s salary, spend some time looking at this kind of data in light of your role. These <a href=\"http:\/\/www.sba.gov\/content\/income-statistics\" target=\"_blank\" rel=\"noopener noreferrer\">income statistics<\/a> from the U.S. Small Business Administration to help you in your research.<\/p>\n<p>This exercise can also help drive an understanding your business’ profitability – until you can afford to pay yourself a market-based salary and turn a profit, and then your business is clearly losing money.<\/p>\n<p><strong>Consider Your Business Structure<\/strong><br \/>\nHow your business is legally structured also impacts your compensation. Talk to an accountant or tax attorney about the best options for you. Under- or over-paying yourself can raise red flags with the IRS.<\/p>\n<p>If you operate an LLC, S-Corp or C-Corp, avoid taking too great a percentage of total revenue as your salary, you could be hit up for a higher payroll tax liability or double taxation.<\/p>\n<p>If you underpaid yourself during your start-up years, be sure to talk to your tax advisor or attorney about how your business structure might help compensate for that shortfall.<\/p>\n<p><strong>Don’t Underpay Yourself<\/strong><br \/>\nIt’s easy for new business owners to get settled into a habit of underpaying themselves, but many continue doing so even though their company is turning a profit (it’s commonly believed that as many as 90% of small business owners underpay themselves).<\/p>\n<p>It may seem the thrifty thing to do, but underpaying yourself can jeopardize your personal finances, leaving you high and dry if your business ever runs into cash flow issues or worse. It also suggests that you’re not confident in the profitability of your business, or in denial about the true health of your business finances which can detract from efforts to focus on increasing profitability, instead of simply cutting costs.<\/p>\n<p><strong>Set a Salary that Reflects Your Value<\/strong><br \/>\nDon’t forget to factor in the value you bring to your business. The time, skill, and energy you invest in your business could be significantly different from that of your nearest direct report or even your business partner. Your salary should reflect this investment.<\/p>\n<p>Just as you review the value that you bring to your business, use this as an opportunity to evaluate how you’re spending your time. Take a look at the tasks your do day-to-day and the hours you devote to them. Consider delegating more menial tasks to employees so that your time and salary yields a higher return by devoting it to more fruitful tasks, like business development.<\/p>\n<p><strong>Start Simply by Setting a Salary as a Percentage of Profits<\/strong><br \/>\nNow that you’ve stepped back and assessed your finances, market-equivalent salaries, and so on, how do you actually arrive at a number? One of the simplest ways to set your salary is to set it as a percentage of your overall profits (after all your bills and expenses have been paid).<\/p>\n<p>If you want to reinvest cash back into your business, consider a 30\/70 or 50\/50 split, depending on what your budget and lifestyle needs dictate. Use your income \/ P&amp;L statement for the past year as a benchmark.<\/p>\n<p><strong>The Bottom Line<\/strong><br \/>\nFocus on paying yourself what you’re worth – and treat your salary as a close cousin of your profits. A fair wage is an incentive for everyone if you struggle in your personal finances because you aren’t compensating yourself enough then you’ll find that your commitment to your business will quickly wane too.<\/p>\n<p>Above all, set yourself a salary that gives you an incentive to work hard and grow your business, not just as a means to get by.<\/p>\n<p>&nbsp;<\/p>\n<p>Want more updates from Fundbox? Make sure to follow us on <a href=\"https:\/\/www.facebook.com\/Fundbox\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook<\/a>, <a href=\"https:\/\/www.linkedin.com\/company\/2933801\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn<\/a> and <a href=\"https:\/\/twitter.com\/fundbox\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The idea of a salary is quite a novelty for many new business owners, particularly sole proprietors and freelancers, who &#8230;<\/p>\n","protected":false},"author":7,"featured_media":1323,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11532],"yst_prominent_words":[3929,4561,719,1454,713,1714,4563,3037,3713,2163,4562,1157,3040,2935,4564,4560,3598,712,709,3090],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"Setting Your Salary As a Small Business Owner","yoast_meta":[{"name":"description","content":"Let’s take a look at some of the key considerations and number-crunching that goes into setting a small business owner’s salary."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Setting Your Salary As a Small Business Owner"},{"property":"og:description","content":"Let’s take a look at some of the key considerations and number-crunching that goes into setting a small business owner’s salary."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/setting-your-salary-as-a-business-owner\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/03\/shutterstock_262518398.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/03\/shutterstock_262518398.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Let’s take a look at some of the key considerations and number-crunching that goes into setting a small business owner’s salary."},{"name":"twitter:title","content":"Setting Your Salary As a Small Business Owner"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/03\/shutterstock_262518398.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/setting-your-salary-as-a-business-owner\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1254"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=1254"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1254\/revisions"}],"predecessor-version":[{"id":16110,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1254\/revisions\/16110"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/1323"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=1254"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=1254"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=1254"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=1254"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}