{"id":12550,"date":"2019-09-12T08:35:00","date_gmt":"2019-09-12T15:35:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12550"},"modified":"2022-06-24T07:11:53","modified_gmt":"2022-06-24T14:11:53","slug":"create-a-plan-to-finish-your-business-year-strong","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/create-a-plan-to-finish-your-business-year-strong\/","title":{"rendered":"Create a Plan to Finish Your Business Year Strong"},"content":{"rendered":"<p><em>In this article from MyCorporation&#8217;s Deborah Sweeney, 4 tips to help you plan the end of your business year.<\/em><\/p>\n<p>It’s hard to believe we’re nearly done with the year again! As we sail through third quarter, with Q4 right on its heels, you may feel the weight of a very long to-do list. Add the holiday season into the mix, and the pressure is on to get everything wrapped up before January.<\/p>\n<p>The key to ending the year smoothly is to prepare with care by establishing a strategic plan. While most of this plan will probably cover your marketing and sales initiatives for the holiday season, it will also help you conduct a year in review assessment of the business. That review should ultimately lead you right into the New Year—and may even end with a few resolutions for your company.<\/p>\n<p>Ready to get a head start on your plan? Add these items to your agenda for a smooth Q3 and Q4.<\/p>\n<h2>1. Look back at any goals set in previous quarters.<\/h2>\n<p>Sometimes it’s critical to look back in order to move forward. Examine Q1 and Q2 in business, and the goals set in each quarter. Were you able to reach these goals? Which endeavors provided the biggest return on investment for your company? Which initiatives turned out to be flops? Double down on the strategies that performed well. Cut excess work that isn’t yielding results. If you find that you haven’t quite reached certain goals yet, you may want to create bite-sized goals instead. These goals are slightly less intimidating, and ultimately work to help you gradually reach larger, set goals.<\/p>\n<p>Go a bit further and compare and contrast previous quarters from this year to last year. This will help you better define trends and develop an understanding of seasons where your business performs stronger than others. If you find slowdown trends at the same time each year, you may decide to run a special sale or introduce a new product to your existing offerings.<\/p>\n<h2>2. Optimize your website.<\/h2>\n<p>Depending on the type of business you run, it’s highly likely that you spent a considerable amount of time this summer creating holiday campaigns. These campaigns likely cover every seasonal event from back to school to Black Friday, so I won’t add “prep holiday campaigns” to this list. The focus should now be placed on optimizing your website.<\/p>\n<p>Conduct inventory on your existing website. How quickly do its pages load across all devices, from desktop to mobile? Is it easy to navigate? Are customers able to make purchases in a timely manner, or do you find shopping carts are often abandoned?<\/p>\n<p>If you find the answer to these questions is not consistently positive, then it’s time to optimize your website for the final quarters. This will ensure that customers have a seamless shopping experience throughout the remaining months left in the calendar year.<\/p>\n<h2>3. Decide if you will need to hire seasonal employees.<\/h2>\n<p>Whether you’re running a Halloween-themed pop-up storefront or hiring extra help to tackle the Black Friday crowds, many small businesses do <a href=\"https:\/\/fundbox.com\/blog\/are-temporary-employees-right-for-your-business\/\">hire temporary employees<\/a> and interns for the season. During Q3 (if you haven’t done this already), create job postings for seasonal hires. Be direct about the duties required, backgrounds and skillsets you’re specifically looking for, and for how long. Then, you can begin interviewing applicants with backgrounds that match the job listing and hire them to join your team.<\/p>\n<p>What if this is your first hire? Even if you’re hiring a part-time employee, you will still need to <a href=\"https:\/\/www.mycorporation.com\/business-formations\/ein.jsp\">file for an employer identification number<\/a> (EIN) first. An EIN is a federal tax ID that identifies employer tax accounts. It is a requirement by the IRS that businesses must have an EIN before they hire paid employees to work for their companies.<\/p>\n<h2>4. File your annual report.<\/h2>\n<p>This is more of a housekeeping item, but you’d be surprised at how quickly these deadlines can sneak up on small businesses! If you incorporated as an LLC or corporation, your business is required to <a href=\"https:\/\/blog.mycorporation.com\/2019\/08\/business-compliance\/\">file an annual report<\/a>.<\/p>\n<p>It’s less intimidating than it might sound, especially if you have been in business for a while. An annual report simply keeps the Secretary of State updated on your company and its activities. If there have been any major changes, like moving to a new storefront address, you’ll update this information before filing. Additionally, these changes should be noted in the bylaws and operating agreements for <a href=\"https:\/\/fundbox.com\/blog\/sole-proprietor-or-incorporate\/\">your corporation<\/a> and LLC respectively.<\/p>\n<p>Q3 and Q4 are likely to be full of seasonal deadlines your small business must meet, but don’t fall behind with your annual report! Failure to file on time may result in your business subject to paying expensive penalty fees. Companies that do not remain on top of their annual maintenance may even face involuntary dissolution by the state. It’s an entrepreneur’s worst nightmare to end the year in business by being put out of business simply because they did not file their necessary documents in time, so make sure you meet all necessary deadlines throughout the entire year.<\/p>\n<p>&nbsp;<\/p>\n<p><em><small>Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal and accounting advisors before engaging in any transaction. Please consult a tax professional for information about tax laws and how they apply to your business.<\/small><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this article from MyCorporation&#8217;s Deborah Sweeney, 4 tips to help you plan the end of your business year. It’s &#8230;<\/p>\n","protected":false},"author":80,"featured_media":12553,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532,11547],"yst_prominent_words":[3441,11047,5764,723,3848,11049,3037,11050,1660,3439,3368,9746,11051,11048,1126,3259,3436,3367,3366,3300],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"Create a Plan to Finish Your Business Year Strong | Fundbox Blog","yoast_meta":[{"name":"description","content":"The key to ending the year smoothly is to prepare with care by establishing a strategic plan. While most of this plan will probably cover your marketing and sales initiatives for the holiday season, it will also help you conduct a year in review assessment of the business. Here are 4 tips for a smooth end of year."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Create a Plan to Finish Your Business Year Strong | Fundbox Blog"},{"property":"og:description","content":"The key to ending the year smoothly is to prepare with care by establishing a strategic plan. While most of this plan will probably cover your marketing and sales initiatives for the holiday season, it will also help you conduct a year in review assessment of the business. Here are 4 tips for a smooth end of year."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/create-a-plan-to-finish-your-business-year-strong\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/09\/shutterstock_1062070967.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/09\/shutterstock_1062070967.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"The key to ending the year smoothly is to prepare with care by establishing a strategic plan. While most of this plan will probably cover your marketing and sales initiatives for the holiday season, it will also help you conduct a year in review assessment of the business. Here are 4 tips for a smooth end of year."},{"name":"twitter:title","content":"Create a Plan to Finish Your Business Year Strong | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/09\/shutterstock_1062070967.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/create-a-plan-to-finish-your-business-year-strong\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12550"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/80"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12550"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12550\/revisions"}],"predecessor-version":[{"id":16218,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12550\/revisions\/16218"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12553"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12550"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12550"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12550"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12550"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}