{"id":12712,"date":"2019-10-16T07:36:01","date_gmt":"2019-10-16T14:36:01","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12712"},"modified":"2022-06-24T08:42:33","modified_gmt":"2022-06-24T15:42:33","slug":"expand-e-commerce-brick-mortar","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/expand-e-commerce-brick-mortar\/","title":{"rendered":"How to Expand from E-commerce to Brick and Mortar"},"content":{"rendered":"<p>As an e-commerce store owner, one way to grow your business is to expand to brick and mortar. Amazon, Warby Parker, Casper, and many other well-known brands that began exclusively online have transitioned to selling their products in real-world storefronts. You may be thinking about doing the same with your e-commerce business.<\/p>\n<p>Interested in opening a physical store, but not sure how to get started? In this guide, we&#8217;ll show you how to get started with expanding your e-commerce store to physical retail.<\/p>\n<h2>Why online retailers expand to brick and mortar stores<\/h2>\n<p>Wondering if you should expand to a brick and mortar location? There are many reasons why you might want a physical store.<\/p>\n<p>Let&#8217;s look at why some well-known brands have been shifting their merchandise into traditional street-side businesses.<\/p>\n<ul>\n<li><a href=\"https:\/\/www.emarketer.com\/Report\/Worldwide-Retail-Ecommerce-Sales-eMarketers-Estimates-20162021\/2002090\">eMarketer<\/a>, a research provider, shows only 10.1 percent of retail revenue in the U.S. is generated via e-commerce. The rest is generated in-store and offline.<\/li>\n<li><a href=\"https:\/\/brizfeel.com\/consumer-online-retail-shopping-behavior\/\">BrizFeel<\/a>, a water purification maker, surveyed 30,000 consumers aged 18 &#8211; 65 and found that 51 percent said not being able to touch, feel, or try a product was the biggest drawback of online shopping.<\/li>\n<li><a href=\"https:\/\/www.prnewswire.com\/news-releases\/slickdeals-shares-new-survey-data-showing-americans-spend-324000-on-impulse-buys-in-their-lifetime-300601768.html\">Slickdeals<\/a>, a consumer deal-sharing platform, surveyed 2,000 U.S. consumers and found they spend an average of $5,400 annually on impulse buys in stores and at restaurants.<\/li>\n<li><a href=\"http:\/\/possible.mindtree.com\/rs\/574-LHH-431\/images\/Mindtree%20Shopper%20Survey%20Report.pdf\">Mindtree<\/a>, a global technology consulting company, surveyed 600 shoppers in the U.S. and found that when a sales associate assisted in-store, 43 percent were more likely to purchase a product and the transactions had 81 percent more value.<\/li>\n<\/ul>\n<p>To summarize, consumers still enjoy purchasing products in brick and mortar stores. Whether it is for the experience or for the satisfaction of getting what they want immediately without paying for shipping, the answer is clear: brick and mortar is still a solid option for anyone who wants to make sales.<\/p>\n<h2>How to open a brick and mortar store<\/h2>\n<p>While the thought of opening your first retail store may be daunting, it doesn&#8217;t have to be. Here are some easy steps to get you started on your journey to turning your online store into an incredible offline retail experience.<\/p>\n<h3>1. Find the best location for your retail store.<\/h3>\n<p>Choosing the right location for your first store in the real world is crucial to the success of your business expansion. You want to choose a location that’s convenient for your ideal customer. Where do they live, work, and prefer to shop? Bring your store to them.<\/p>\n<p>For example, if you sell luxury fashion online, you may want to lease a storefront in a high-end mall or outdoor shopping center. To help choose the right locations, you can use <a href=\"https:\/\/www.entrepreneur.com\/article\/73784\">location analysis tools<\/a> and work with research firms to uncover insights into market demographics including the area&#8217;s average household income and age range, as well as traffic patterns and lifestyle data.<\/p>\n<p>Additionally, you can do additional research by looking at surrounding retail stores and restaurants in the areas you are considering. Their clientele and popularity will give you an idea of who you can expect to walk into your business and how popular you can expect it to be.<\/p>\n<h3>2. Know what will be in your lease and what you can negotiate.<\/h3>\n<p>Once you find a few locations that may be perfect for your brick and mortar, you will need to figure out what will work for your leasing terms and budget. You may be able to negotiate a better rate based on how long you plan on staying in a particular location (generally, the longer the lease, the better the deal).<\/p>\n<p>You will also want to get the details on what else is included with your lease payment and what you will be expected to pay for on your own. These expenses may include property taxes, insurance, maintenance of your space, common area maintenance, security, and basic utilities.<\/p>\n<h3>3. Get your permits and licenses.<\/h3>\n<p>Before you can start doing business in a retail store, you will need to get any city, state, and federal permits and licenses required in your area. These will vary based on the products and the services you plan to sell.<\/p>\n<p>New York City, for example, offers a two-page <a href=\"http:\/\/www.nyc.gov\/html\/nycbe\/downloads\/pdf\/nycstarter_guide_retail_store.pdf\">retail store starter guide<\/a> and <a href=\"https:\/\/www1.nyc.gov\/nycbusiness\/wizard\">step by step wizard<\/a>. Together, business owners can find the exact documents they need to get together before they have their store&#8217;s grand opening.<\/p>\n<p>Research carefully to make sure you have your legal requirements covered in plenty of time.<\/p>\n<h3>4. Decide on the merchandising and sales equipment.<\/h3>\n<p>Your physical store environment should offer a great experience for your customers. Think about how you can give visitors the chance to touch and feel your products in a unique space that expresses your brand. You’ll probably also want to give customers the chance to get your most popular products and take them home the same day.<\/p>\n<p>With these things in mind, ask yourself:<\/p>\n<ul>\n<li>How much merchandise and inventory do you want on hand for your grand opening?<\/li>\n<li>How many clothing racks, counter displays, display tables, promotional displays, showcases, shelves, signage, slat walls, wall racks, and warehouse storage will you need for your merchandise?<\/li>\n<li>How many POS systems do you plan to have to keep sales moving smoothly?<\/li>\n<\/ul>\n<p>In addition to your merchandising and sales equipment, you will need a system to manage your inventory and sales. If your e-commerce store uses a platform like Shopify, you can use it to manage your physical store&#8217;s point of sale hardware and inventory management.<\/p>\n<h3>5. Consider how many people you will need to hire to run your store.<\/h3>\n<p>Retailers that under-staff their stores can miss out on sales, according to insights provided by <a href=\"https:\/\/www.retaildive.com\/news\/retailers-are-understaffing-stores-and-losing-sales\/513055\/\">RetailDive<\/a>. The last thing you want when creating a new in-store experience is for your customers to feel ignored because they can’t get the attention of a sales associate when they need one.<\/p>\n<p>If you&#8217;re not sure how many people to hire for your brick and mortar store, conduct some research. Take a few trips to similar businesses in the area where you plan to set up shop. Visit during off-hours (like weekday mornings) and peak hours (like Saturday afternoons) to see how many people work on the sales floor and at the registers.<\/p>\n<h3>6. Write your business plan to prepare to apply for funding.<\/h3>\n<p>After you have done the research on your brick and mortar&#8217;s leasing options, permits and licenses, merchandising and inventory, and hiring expenses, you should have a solid idea of the amount of <a href=\"https:\/\/www.fundingcircle.com\/us\/resources\/business-financing\/\">business financing<\/a> you will need to make your brick and mortar store dream a reality. At this point, you are ready to write a business plan to show potential lenders how you plan to put their money to use.<\/p>\n<p>Read our free <a href=\"https:\/\/fundbox.com\/resources\/guides\/funding\/\" target=\"_blank\" rel=\"noopener noreferrer\">guide to business financing<\/a> and learn about your options.<\/p>\n<p>The U.S. Small Business Administration offers a free guide on <a href=\"https:\/\/www.sba.gov\/business-guide\/plan-your-business\/write-your-business-plan\">how to write a business plan<\/a>. You can also find great examples of retail store plans at <a href=\"https:\/\/www.bplans.com\/retail_and_online_store_business_plan_templates.php\">Bplans<\/a> for retailers of everything from art supplies to women&#8217;s shoes.<\/p>\n<p>The goal of your business plan is to describe (in detail) your company, ideal customers, market viability, products and services, marketing and sales strategy, funding requirements, and financial projections. Your business plan will tell lenders <a href=\"https:\/\/fundbox.com\/blog\/todays-retailers-can-compete-giants\/\">what makes your business stand out from the competition<\/a> and how you will use the funds to achieve specific objectives.<\/p>\n<h2>A final word<\/h2>\n<p>Opening a brick and mortar is just one possible avenue for growth, and it’s important to take the time to compare which investment opportunity will have the biggest impact on your bottom line. While having a physical storefront isn’t right for every business, there are a ton of potential benefits that could make the endeavor worthwhile for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As an e-commerce store owner, one way to grow your business is to expand to brick and mortar. Amazon, Warby &#8230;<\/p>\n","protected":false},"author":103,"featured_media":12714,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[10486],"yst_prominent_words":[7317,723,2123,8474,11397,5767],"post-meta-fields":{"stripe_selected":"bottom-left-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How to Expand from E-commerce to Brick and Mortar | Fundbox Blog","yoast_meta":[{"name":"description","content":"As an e-commerce store owner, one way to grow your business is to expand to brick and mortar. Amazon, Warby Parker, Casper, and many other well-known brands that began exclusively online have transitioned to selling their products in real-world storefronts. You may be thinking about doing the same with your"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Expand from E-commerce to Brick and Mortar | Fundbox Blog"},{"property":"og:description","content":"As an e-commerce store owner, one way to grow your business is to expand to brick and mortar. Amazon, Warby Parker, Casper, and many other well-known brands that began exclusively online have transitioned to selling their products in real-world storefronts. You may be thinking about doing the same with your"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/expand-e-commerce-brick-mortar\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/10\/shutterstock_604757411-BW.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/10\/shutterstock_604757411-BW.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"As an e-commerce store owner, one way to grow your business is to expand to brick and mortar. Amazon, Warby Parker, Casper, and many other well-known brands that began exclusively online have transitioned to selling their products in real-world storefronts. You may be thinking about doing the same with your"},{"name":"twitter:title","content":"How to Expand from E-commerce to Brick and Mortar | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2019\/10\/shutterstock_604757411-BW.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/expand-e-commerce-brick-mortar\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12712"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/103"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12712"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12712\/revisions"}],"predecessor-version":[{"id":16295,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12712\/revisions\/16295"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12714"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12712"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12712"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12712"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12712"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}