{"id":12811,"date":"2020-03-11T09:19:20","date_gmt":"2020-03-11T16:19:20","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=12811"},"modified":"2020-11-03T15:13:48","modified_gmt":"2020-11-03T23:13:48","slug":"financial-tips-for-uncertain-times","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/financial-tips-for-uncertain-times\/","title":{"rendered":"Overcoming Financial Challenges in Uncertain Times"},"content":{"rendered":"<p>With the economic impact of the novel coronavirus\/COVID-19, we wanted to help business owners focus on how they can prepare their business during uncertain times. Having worked with and listened to small businesses since our earliest days, we understand that change can be hard, and we’re committed to helping small businesses adapt to a dynamic environment. The good news is that there are a lot of things you can do to stay ready and adapt as you learn new information.<\/p>\n<p><span style=\"font-weight: 400;\">From challenges with remote work to disruptions to your supply chain, small businesses face countless obstacles every day. Financial challenges, however, tend to loom the largest. Not only are business finances a complex, ever-changing entity, but they’re also the engine of any operation. A good financial situation can keep a business running, while too many <a href=\"https:\/\/fundbox.com\/blog\/coping-personal-crisis-small-business\/\" target=\"_blank\" rel=\"noopener noreferrer\">financial hardships<\/a> can cause even the most pristine machine to sputter and stall out.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here are a few of the top financial challenges facing small businesses when times are uncertain—and how to overcome them.<\/span><\/p>\n<h2><b>1. Constrained cash flow<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Managing cash flow is a perpetual struggle for most business owners. According to the <\/span><a href=\"https:\/\/www.guidantfinancial.com\/small-business-trends\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">2019 Small Business Trends report from Guidant Financial<\/span><\/a><span style=\"font-weight: 400;\">, 33 percent of small business owners surveyed cited a lack of cash flow as their greatest challenge.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“This is a constant, regardless of the year,” said Ken Wentworth, owner of <\/span><a href=\"https:\/\/mrbizsolutions.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Mr. Biz Solutions<\/span><\/a><span style=\"font-weight: 400;\">. It doesn’t matter how many assets you might have as a business owner. “Without cash,” Wentworth said, “You have no business.” Beyond covering major recurring costs like payroll and rent, you also have to pay business taxes, fulfill vendor invoices, and purchase supplies and equipment just to maintain operations.<\/span><\/p>\n<p>One way to have a reliable source of funding is to apply for a line of credit. Unlike term loans, which provide a lump sum that you use once and repay once (plus interest), a line of credit is “revolving.” This means that you can tap into it repeatedly, when you need it. Then, as soon as you’ve paid back what you borrowed (plus any fee on that amount), those funds are available for you to borrow again in the future, usually without having to reapply for a new loan (although some banks do require customers to reapply periodically to assure they are still creditworthy).<\/p>\n<p>This flexibility makes it very popular for small businesses. A line of credit makes a great, long-lasting solution for short-term cash shortages—like those that sometimes come from delayed receivables, seasonal business slumps, or unexpected economic conditions.<\/p>\n<p><span style=\"font-weight: 400;\">Another way to <\/span><a href=\"https:\/\/www.fundingcircle.com\/us\/resources\/improve-business-cash-flow\/\"><span style=\"font-weight: 400;\">improve your cash flow<\/span><\/a><span style=\"font-weight: 400;\"> is to experiment with your payment processes. “Work on stretching out when you pay cash for your purchases without being late,” Wentworth said, “and shortening the amount of time it takes to get your invoices paid.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you typically ask clients to pay you in 30 days, for example, consider cutting that window to 15 days. Just make sure you notify your clients and customers of the change before the next payment cycle so they’re not surprised or unprepared.<\/span><\/p>\n<h3><a href=\"https:\/\/fundbox.com\/blog\/how-to-design-invoices-that-get-paid-faster\/\"><b><i>Related: How to Design Invoices That Get Paid Faster<\/i><\/b><\/a><\/h3>\n<p><span style=\"font-weight: 400;\">You may also want to streamline your business’ payment process so clients can pay <\/span><i><span style=\"font-weight: 400;\">you<\/span><\/i><span style=\"font-weight: 400;\"> faster and with less hassle, Wentworth suggested. If you don’t already accept major credit cards, that’s a good place to start, he said. You could also set up an online payment portal or accept payments through <\/span><a href=\"https:\/\/fundbox.com\/blog\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Fundbox<\/span><\/a><span style=\"font-weight: 400;\">, PayPal, or Apple Pay.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“Sending automated payment reminders is another easy-to-implement, yet effective measure you can take,” Wentworth said.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you have clients or customers who regularly pay late, think about how you can incentivize them to pay sooner, said Matthew Ross, co-owner and COO of <\/span><a href=\"https:\/\/www.rizknows.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">RIZKNOWS<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/myslumberyard.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">The Slumber Yard<\/span><\/a><span style=\"font-weight: 400;\">. If “one of your key customers has 40-day payment terms, why not offer a 3 percent discount if they pay within 10 days?” he suggested.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another option is to stretch out when you pay your suppliers. If the invoice says your payment is due in 30 days, pay on day 29, said Wentworth—and do it with a business credit card. “Depending on your billing cycle,” he explained, “that means you have an additional 30 to 45 days before you have to lay out cash to pay your credit card bill.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Make sure you pay off your balance in full each month, though. Carrying a balance and incurring interest on your credit card isn’t advisable, Wentworth added.<\/span><\/p>\n<h2><b>2. Sticking to a budget<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Another common business challenge is budgeting. “Budgets are absolutely key to running a clean operation,” said Ross. “By creating a budget and routinely reviewing actual results versus projections,” he explained, “you can keep a close eye on expense accounts and make timely cuts when needed.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In order to stick to a budget, though, you have to create one that’s realistic for your business’ goals and profit potential. If this sounds daunting, don’t worry; there are many useful <\/span><a href=\"https:\/\/fundbox.com\/blog\/7-free-small-business-budget-templates\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">free budget templates<\/span><\/a><span style=\"font-weight: 400;\"> out there to get you started right.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To create your budget, begin by looking at all your sources of income to get an idea of how much money you’re working with. Include your sales numbers, investment earnings, and any accounts receivable you have. Next, tally all your fixed expenses, like rent, equipment leases, or loan payments.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">From there, make a list of expenses that are subject to change from month to month, like contractor wages, marketing, travel, or office supplies. Finally, include enough money to cover emergencies and expensive one-off purchases like equipment or accounting software—we’ll expand on this later.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">After you’ve created annual and quarterly budgets, start scheduling monthly budget reviews to ensure you’re on track. “Let’s say your revenue goal for the month is $100K and you see on the 15th that you are only at $30K,” Wentworth said. Then “you can motivate your sales team to step up to close the gap during the last two weeks of the month.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Building and reviewing a budget regularly creates accountability, he explained, and also helps you make smarter financial decisions throughout the year.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For detailed guidance on how to create a budget, check out GoodFirm’s <\/span><a href=\"https:\/\/www.goodfirms.co\/blog\/best-free-open-source-business-budgeting-software-solutions\"><span style=\"font-weight: 400;\">blog article<\/span><\/a><span style=\"font-weight: 400;\">. It shows you how to create a budget from scratch using a spreadsheet, and lists some free budgeting tools if spreadsheets aren’t your thing.<\/span><\/p>\n<h2><b>3. Marketing<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">It might seem counterintuitive to spend money on growing your business, but you’ll be well positioned to thrive in the long run if you spend when everyone else cuts their marketing budgets. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, it is important to be smart about how you invest your money and your time. To stay competitive without draining your cash reserves, you need to get creative. Instead of simply advertising, Ross said, try developing valuable <\/span><a href=\"https:\/\/fundbox.com\/blog\/increase-b2b-seo-traffic\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">SEO content<\/span><\/a><span style=\"font-weight: 400;\">. “We’ve found that if you create helpful videos that address related topics in your industry,” you can improve your search ranking <\/span><i><span style=\"font-weight: 400;\">and<\/span><\/i><span style=\"font-weight: 400;\"> attract potential customers looking for similar products or services, Ross explained.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To learn more about how to improve your SEO rankings, check out Shane Barker’s <\/span><a href=\"https:\/\/shanebarker.com\/blog\/small-business-seo-tips\/\"><span style=\"font-weight: 400;\">blog post<\/span><\/a><span style=\"font-weight: 400;\">, loaded with tips and ideas that are straightforward to implement. <\/span><\/p>\n<h2><b>4. Keeping cash in reserves<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">In terms of small business challenges, Guidant Financial ranks <\/span><a href=\"https:\/\/www.guidantfinancial.com\/small-business-trends\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">a lack of capital on par with a lack of cash flow<\/span><\/a><span style=\"font-weight: 400;\">. That’s partly because acquiring funding can be difficult. According to <\/span><a href=\"https:\/\/www.biz2credit.com\/small-business-lending-index\/may-2018\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Biz2Credit’s May 2018 Small Business Lending Index<\/span><\/a><span style=\"font-weight: 400;\">, big banks only grant about one in four small business loan applications. Though the approval rating has gone up slowly since the recession, it still is below 30 percent.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The major limiting factor in approval seems to be tied to business credit. According to <\/span><a href=\"https:\/\/www.nav.com\/insights\/?utm_source=Entrepreneur&amp;utm_medium=content&amp;utm_campaign=american_dream_gap_report\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Nav’s Small Business American Dream Gap Report<\/span><\/a><span style=\"font-weight: 400;\"> from 2015, one in five business owners who applied for funding in the last five years were denied, and 82 percent of all the business owners surveyed didn’t know how to interpret their credit scores. The research also showed that individuals who have a better understanding of their business credit score are 41 percent more likely to be approved for a loan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">That’s why it’s critical to lay out a plan for identifying and improving your business credit score. Then, before you move forward with financing, get clear on how you would use any extra capital and <\/span><a href=\"https:\/\/www.fundingcircle.com\/us\/resources\/business-financing\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">check out your options<\/span><\/a><span style=\"font-weight: 400;\"> to see what makes the most sense to help you <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/funding\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">grow your business<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h2><b>5. Unforeseen expenses<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">When you’re already busy managing a multitude of recurring business expenses, it’s easy to forget about the costs you can’t easily predict. Think: damaged equipment, finding a new source for inventory, or paying workers to stay home when they’re sick. In a <\/span><a href=\"https:\/\/clutch.co\/accounting\/resources\/small-business-accounting-tips-2018\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">2018 small business accounting survey from Clutch<\/span><\/a><span style=\"font-weight: 400;\">, 35 percent of small business owners cited unforeseen expenses as their main financial challenge.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">How much money should you allocate for these unforeseen costs? Wentworth said your past records can help you better predict what you might spend. For example, maybe you operate 10 vehicles for your business and need to gear up for potential repair costs. “Use your expense history—if in the prior three years, you spent $600 per vehicle for these types of expenses, then add $6K in your budget for that,” Wentworth suggested.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Of course, no matter how much you pad your budget, occasional <\/span><a href=\"https:\/\/www.fundingcircle.com\/us\/resources\/prepare-business-disaster\/\"><span style=\"font-weight: 400;\">crises happen<\/span><\/a><span style=\"font-weight: 400;\">. When that’s the case, try to figure out how you can offset that cost and bring your budget back on pace, said Wentworth. Can you ramp up sales for the month, for example? Cancel an upcoming work trip? Unforeseen expenses are inevitable, but the more adept you become at predicting and preparing for them, the more stable your business financials will be.<\/span><\/p>\n<h2><b>Help from government sources<\/b><\/h2>\n<p>On March 27, the government passed the Coronavirus Aid, Relief, and Economic Security Act—<a href=\"https:\/\/fundbox.com\/blog\/covid19-cares-act-explained\/\" target=\"_blank\" rel=\"noopener noreferrer\">the CARES Act<\/a>. This two trillion dollar stimulus package was designed to give financial relief to individuals and businesses that have been negatively affected by the pandemic. The CARES Act includes two loan options for businesses: the Small Business Administration’s (SBA) 7(a) <a href=\"https:\/\/fundbox.com\/blog\/ppp-loan-application-podcast\/\" target=\"_blank\" rel=\"noopener noreferrer\">Paycheck Protection Program (PPP)<\/a>, and the SBA’s Economic Injury Disaster Loan, or EIDL.<\/p>\n<p>In addition to the CARES Act, many states and city municipalities have announced their own COVID-19 relief programs for small businesses. You can check out our current list on our blog here: <a href=\"https:\/\/fundbox.com\/blog\/covid-19-business-update\/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong><em>COVID-19 Resources for Small Businesses<\/em><\/strong><\/a>.<\/p>\n<p><span style=\"font-weight: 400;\">Overcoming common business challenges comes down to education and execution. Taking the time to determine your small business’ pain points and lay out a plan of attack can help set you up for success.<\/span><i><\/i><\/p>\n<p><em>Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal and accounting advisors before engaging in any transaction.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the economic impact of the novel coronavirus\/COVID-19, we wanted to help business owners focus on how they can prepare &#8230;<\/p>\n","protected":false},"author":6,"featured_media":12815,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11532],"yst_prominent_words":[844,723,1721,719,10528,713,724,10649,10650,3368,1529,3040,712,709,1126,3436,3367,3366,10798],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Overcoming Financial Challenges in Uncertain Times | Fundbox Blog","yoast_meta":[{"name":"description","content":"With the coronavirus\/COVID-19 pandemic severely impacting the economy, here is a discussion of a few of the top financial challenges that small businesses face during uncertain times and how to help overcome them."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Overcoming Financial Challenges in Uncertain Times | Fundbox Blog"},{"property":"og:description","content":"With the coronavirus\/COVID-19 pandemic severely impacting the economy, here is a discussion of a few of the top financial challenges that small businesses face during uncertain times and how to help overcome them."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/financial-tips-for-uncertain-times\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/03\/shutterstock_1273341217-scaled.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/03\/shutterstock_1273341217-scaled.jpg"},{"property":"og:image:width","content":"2560"},{"property":"og:image:height","content":"1707"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"With the coronavirus\/COVID-19 pandemic severely impacting the economy, here is a discussion of a few of the top financial challenges that small businesses face during uncertain times and how to help overcome them."},{"name":"twitter:title","content":"Overcoming Financial Challenges in Uncertain Times | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/03\/shutterstock_1273341217-scaled.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/financial-tips-for-uncertain-times\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12811"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=12811"}],"version-history":[{"count":21,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12811\/revisions"}],"predecessor-version":[{"id":13879,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/12811\/revisions\/13879"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12815"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=12811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=12811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=12811"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=12811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}