{"id":13210,"date":"2020-01-26T13:26:34","date_gmt":"2020-01-26T21:26:34","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=13210"},"modified":"2021-04-02T02:09:22","modified_gmt":"2021-04-02T09:09:22","slug":"ppp-loan-forgiveness","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/ppp-loan-forgiveness\/","title":{"rendered":"How to Maximize Your PPP Forgiveness in 2021"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">The potential for 100% loan forgiveness is one of the most attractive benefits of the <\/span><a href=\"https:\/\/fundbox.com\/blog\/ppp-loan-whats-new\"><span style=\"font-weight: 400;\">Paycheck Protection Program (PPP)<\/span><\/a><span style=\"font-weight: 400;\">. The PPP is an SBA-guaranteed 1% interest loan up to $2 million that can convert into a grant—as long as you spend the funds according to the rules. <\/span><b>However, PPP forgiveness is <\/b><b><i>not <\/i><\/b><b>automatic. <\/b><span style=\"font-weight: 400;\">Borrowers have to apply to their PPP lender for forgiveness and supply requested documentation. However, thanks to the <\/span><a href=\"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/7010\/text\"><i><span style=\"font-weight: 400;\">Paycheck Protection Program Flexibility Act<\/span><\/i><\/a><span style=\"font-weight: 400;\"> and the <\/span><a href=\"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/1865\/text\"><i><span style=\"font-weight: 400;\">Further Consolidated Appropriations Act of 2020<\/span><\/i><\/a><span style=\"font-weight: 400;\">, the PPP forgiveness process is now more streamlined than before—especially for PPP loans of $150,000 or less.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you run a small business or are self-employed and have already received a PPP loan or are thinking of <\/span><span style=\"font-weight: 400;\">applying<\/span><span style=\"font-weight: 400;\"> for a first or second draw PPP, here are some things to consider doing to help you get the highest possible amount of your loan forgiven.<\/span><\/p>\n<h3>You can also listen to this information as a <a href=\"https:\/\/fundbox.com\/resources\/podcasts-videos\/fundbox-podcast-maximizing-ppp-forgiveness\/\" target=\"_blank\" rel=\"noopener noreferrer\">podcast<\/a>.<\/h3>\n<p><span style=\"font-weight: 400;\"><em>Please note that this might not be a comprehensive list and these documents may not be applicable to all borrowers.<\/em><\/span><\/p>\n<h2><b>1. Ensure that at least 60% of your PPP loan goes to compensation <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">The<\/span><a href=\"https:\/\/home.treasury.gov\/policy-issues\/cares\"> <i><span style=\"font-weight: 400;\">CARES Act<\/span><\/i><\/a><span style=\"font-weight: 400;\"> established the PPP to help small businesses maintain their employees and their payroll (or replace their own expected income in the case of<\/span><a href=\"https:\/\/www.uschamber.com\/report\/independent-contractors-guide-cares-act-relief\"> <span style=\"font-weight: 400;\">sole proprietors or independent contractors<\/span><\/a><span style=\"font-weight: 400;\">) over a &#8220;Covered Period&#8221; of between 8 weeks and 24 weeks. Even if you previously received a PPP loan, the length of this Covered Period is now your choice—at least 8 weeks following the date of loan disbursement and not more than 24 weeks after the date of loan disbursement. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As the program’s name implies, its intended purpose is to keep employees (and\/or owners) paid and employed, with some allowance for operating expenses like the business’ rent, vehicle payments, and utilities. As a general guideline, your business may be eligible for full loan forgiveness if you allocate <\/span><b>60% of the loan money to keeping all the full-time equivalent staff on payroll<\/b><span style=\"font-weight: 400;\">, with no more than 40% allowed for other qualifying business expenses.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">What if you’re unable to meet those criteria? Fortunately, <\/span><b>partial forgiveness may be available under the 60% payroll threshold<\/b><span style=\"font-weight: 400;\">. Specifically, if a borrower uses less than 60% of the loan amount for payroll costs during the forgiveness Covered Period, they may continue to be eligible for partial loan forgiveness, according to a <\/span><a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/sm1026\"><span style=\"font-weight: 400;\">joint statement<\/span><\/a><span style=\"font-weight: 400;\"> from SBA Administrator Jovita Carranza and Treasury Secretary Steven Mnuchin. <\/span><b>Any amount of the PPP not forgiven simply remains a 1% loan, payable over the remainder of the loan term.<\/b><\/p>\n<h2><b>2. Keep clear records to document how you spend the funds<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Don’t take for granted that the SBA will forgive you simply on the assumption that you used the funds appropriately. Similarly, lenders cannot promise that the government will forgive all or any portion of the loan. The burden of proof will fall on you. Therefore, your best protection lies in the thoroughness of the documentation you maintain during the loan forgiveness period, as well the<\/span><a href=\"https:\/\/fundbox.com\/blog\/ppp-loan-checklist\/\"><span style=\"font-weight: 400;\"> documents you provided when applying<\/span><\/a><span style=\"font-weight: 400;\"> to your PPP lender. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><b>Records Retention Requirement: <\/b><span style=\"font-weight: 400;\">The Borrower must retain all employment records\/payroll documentation in its files for four years and all other documentation for three years after the date the loan forgiveness application is submitted to the lender. Such documents may include:<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><b>Payroll: <\/b><span style=\"font-weight: 400;\">Documentation verifying the eligible cash compensation and non-cash benefit payments from the Covered Period, such as:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Bank account statements or third-party payroll service provider reports documenting the amount of cash compensation paid to employees<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Tax forms such as payroll tax filings, State quarterly wage reports, and unemployment insurance tax filings.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Payment receipts, cancelled checks, or account statements documenting the amount of any employer contributions to employee group insurance and retirement plans that you included in your Requested Loan Forgiveness Amount<\/span><\/li>\n<\/ul>\n<p><b>Nonpayroll: <\/b><span style=\"font-weight: 400;\"> In addition to documentation verifying the existence of your business prior to February 15, 2020, you may also be asked to maintain records of payments for eligible business expenses during your Covered Period, such as:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Business mortgage interest payments receipts or cancelled checks<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Lender account statements<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Business rent or lease payment agreements, receipts, and\/ or cancelled checks verifying eligible payments<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Business utility payment invoices and receipts, cancelled checks, or account statements verifying those eligible payments<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Covered operations expenditures&#8217; invoices, purchase orders, receipts, cancelled checks, or account statements<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Covered property damage repair invoices, receipts, cancelled checks, or account statements and documentation that the costs were related to property damage and vandalism or looting due to public disturbances that occurred during 2020 and such costs were not covered by insurance or other compensation.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Covered supplier contracts, orders, or purchase orders in effect at any time before the Covered Period (except for perishable goods), copy of invoices, orders, or purchase orders paid during the Covered Period and receipts, cancelled checks, or account statements verifying those eligible payments<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Covered worker protection expenditure invoices or purchase orders and receipts, cancelled checks, or account statements and documentation that you used expenditures to comply with applicable COVID-19 guidance. <\/span><\/li>\n<\/ul>\n<p><b>Other Records: <\/b><span style=\"font-weight: 400;\">All records relating to your PPP loan, including documentation submitted with your PPP loan application, documentation supporting your eligibility certifications (including a gross receipt reduction for a second draw PPP loan, if applicable), and records to support other attestations made during your application or forgiveness process.<\/span><\/p>\n<h2><b>3. Setup a separate bank account (optional)<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Once you’re approved by the SBA, the lender has just 10 days to put the money into your account, but usually this happens very quickly. To make it easier to manage, track, and later document your loan’s appropriate usage, some accounting firms recommend that you<\/span><b> open a separate bank account to hold the PPP funds<\/b><span style=\"font-weight: 400;\">. If you do this, remember to switch your payroll withdrawal account to your dedicated PPP account for the 24-week period. While a separate account is not required by the SBA, your alternative is to keep very meticulous records of all your finances and expenses, and that can be a headache.<\/span><\/p>\n<h2><b>4. Upon loan approval, check these three numbers<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">If your loan was approved, you’ll get an email with an SBA loan number and the loan amount. When that happens, immediately do some math, because you’ll need to know these figures to compare later your spending.<\/span><\/p>\n<ul>\n<li aria-level=\"1\"><b>60% of the total loan amount<\/b><span style=\"font-weight: 400;\">. That’s the <\/span><i><span style=\"font-weight: 400;\">minimum <\/span><\/i><span style=\"font-weight: 400;\">you’ll need to spend on payroll over the next 8 to 24 weeks to be eligible for full forgiveness. For example: if your loan is for $50,000, you’ll need to pay at least $30,000 to your employees.<\/span><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Your number of FTE employees.<\/b><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Each employee’s average monthly salary or wage. <\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Numbers 2 and 3 are important because your total <\/span><b>loan forgiveness can be diminished if you reduced employee headcount or compensation<\/b><span style=\"font-weight: 400;\"> during your covered forgiveness period.<\/span><\/p>\n<h2><b>5. Calculate your FTE headcount<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">You&#8217;ll need to determine your number of full-time equivalent (FTE) employees. This isn&#8217;t as easy as just counting full-time employees; you should also factor in your part-time employees. Here&#8217;s how: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">For each employee, enter the average number of hours paid per week, divide by 40, and round the total to the nearest tenth. The maximum for each employee is capped at 1.0. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">A simplified method that assigns a 1.0 for employees who work 40 hours or more per week and 0.5 for employees who work fewer hours may be used at the election of the Borrower.  <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Make sure to keep records that show your work on these calculations.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Any reduction in<\/span><b> loan forgiveness will be based on the <\/b><b><i>difference<\/i><\/b><span style=\"font-weight: 400;\"> between two numbers: <\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your number of FTEs at work during your chosen 8 week to 24-week Covered Period, and  <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your number of FTEs at work during one of these baseline periods (whichever is <\/span><i><span style=\"font-weight: 400;\">lowest<\/span><\/i><span style=\"font-weight: 400;\">):<\/span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">February 15, 2019 to June 30, 2019 (19 weeks)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">January 1, 2020 to February 29, 2020 (8 weeks)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><b><i>If you’re a seasonal business<\/i><\/b><span style=\"font-weight: 400;\">, you also have the option of using either date range above, or any consecutive twelve-week period between May 1, 2019 and September 15, 2019, <\/span><i><span style=\"font-weight: 400;\">whichever yields the lowest FTEs<\/span><\/i><span style=\"font-weight: 400;\">.<\/span><\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">For example, if you had 20% fewer FTE employees during your 8-week to 24-week Covered Period, then your loan forgiveness may be reduced correspondingly by 20%. <\/span><\/p>\n<h2><b>6. Keep layoffs from affecting forgiveness<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Did you have to lay off or furlough employees? If you see you’re going to  come up short in your FTE headcount during your Covered Period, you may still be able to avoid that reduction penalty. As long as you rehired all those employees (or an equivalent number) by December 31, 2020, then they will be included in your FTE count for your forgiveness period. However, with respect to a PPP loan made on or after December 27, 2020, the deadline for restoring FTEs is the last day of your Covered Period for that PPP loan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If those employees chose not to come back to work, there are things you can do or even safe harbors that may protect you.<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">It’s the <\/span><b>headcount<\/b><span style=\"font-weight: 400;\"> that counts—so you could hire new employees to replace them. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Whether you rehire or replace, be sure to pay them <\/span><b>at least 75% of the previous compensation<\/b><span style=\"font-weight: 400;\">, to avoid the forgiveness penalty for reduction in pay. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">In determining FTE headcount, there are <\/span><b>three exceptions<\/b><span style=\"font-weight: 400;\"> that let you claim an individual as a FTE even though they are no longer employed with the company on the date of your forgiveness application. These are: 1) an employee that was “<\/span><b>fired<\/b><span style=\"font-weight: 400;\"> for cause”, 2) an employee who voluntarily <\/span><b>resigned<\/b><span style=\"font-weight: 400;\">, or 3) an employee who voluntarily <\/span><b>requested and received a reduction<\/b><span style=\"font-weight: 400;\"> of his or her hours. In all of these cases, you’re only allowed to claim this individual if the position was not filled by a new employee. Any FTE reductions in these cases do not reduce the Borrower’s loan forgiveness.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>If a former employee refuses to come back to work<\/b><span style=\"font-weight: 400;\"> (at the same hours and pay as before the layoff), document that communication. As long as you keep a written record of your offer to the employee and a record of their refusal, you can submit these later with your loan forgiveness application. Their FTE hours won’t be counted in your comparative averages, and you may still qualify for loan forgiveness. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>If your business could not bounce back<\/b><span style=\"font-weight: 400;\">, you may be exempt from the FTE headcount rule. The<\/span><a href=\"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/7010\/text\"> <span style=\"font-weight: 400;\">PPPFA adds this exemption<\/span><\/a><span style=\"font-weight: 400;\"> if “the employer is able to document an inability to return to the same level of business activity as such business was operating at before February 15, 2020, due to compliance with requirements established or guidance issued by the Secretary of Health and Human Services, the Director of the Centers for Disease Control and Prevention, or the Occupational Safety and Health Administration during the period beginning on March 1, 2020, and ending December 31, 2020, related to the maintenance of standards for sanitation, social distancing, or any other worker or customer safety requirement related to COVID–19.”<\/span><\/li>\n<\/ul>\n<h2><b>7. Consider rehiring even if you can’t reopen yet<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">One common question over the headcount issue is: how can you rehire employees if your business is still closed, even as mandated by stay-at-home orders? If your goal is to maximize forgiveness of the loan, current guidance from the SBA suggests you <\/span><b>pay your employees anyway<\/b><span style=\"font-weight: 400;\">, whether your doors are open or they can work from home or not.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“It’s counterintuitive, but Congress designed this program as a way for small businesses to keep their employees rather than laying them off and putting them on unemployment,”advises Neil Bradley, executive vice president and chief policy officer at the U.S. Chamber of Commerce. “[Congress] anticipated that you might be paying employees who actually physically can’t come to work who aren’t providing services — but they would rather pay you (through the paycheck protection program) to pay those employees rather than you laying them off.”<\/span><\/p>\n<h2><b>8. Keep wage cuts from reducing forgiveness<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Because a pillar of the PPP is to keep workers paid, your <\/span><b>loan forgiveness may be reduced if you cut the average wage of any employee by more than 25%<\/b><span style=\"font-weight: 400;\">. While the SBA has yet to issue guidance on how the amount of loan forgiveness would be penalized, it’s assumed to be on a dollar-for-dollar basis. The SBA form 3508 (<\/span><a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/2021-01\/PPP%20--%20Loan%20Forgiveness%20Application%20and%20Instructions%20--%20Form%203508%20%281.19.2021%29.pdf\"><i><span style=\"font-weight: 400;\">PPP Loan Forgiveness Application<\/span><\/i><\/a><span style=\"font-weight: 400;\">) includes instructions on calculating the forgiveness amount.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">So, for the Covered Period, you need to pay your employees at least 75% of their average wage based on what you paid them in 2019 (or if 2019 data isn’t applicable, based on their gross wages in the first quarter of 2020). This rule does not apply to employees who earned an annual salary of $100,000 or more ($8,333 per month) in 2019.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Note that there is a limit to the cash compensation any individual employee can be paid during this forgiveness window ($100,000 prorated over the number of weeks in your Covered Period). For example, for an 8-week Covered Period, the maximum is $15,385, for a 24-week Covered Period, the maximum is $46,154. Keep this in mind if you’re considering adding bonuses such as “hazard pay” to help reach the 60% threshold for forgiveness.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As part of your PPP loan application process, you should have already calculated your monthly payroll costs according to the<\/span><a href=\"https:\/\/www.uschamber.com\/sites\/default\/files\/023595_comm_corona_virus_smallbiz_loan_final.pdf\"> <span style=\"font-weight: 400;\">guidelines provided for employers<\/span><\/a><span style=\"font-weight: 400;\">. It’s in your best interest to double-check and have those figures and<\/span><a href=\"https:\/\/fundbox.com\/blog\/ppp-loan-checklist\/\"> <span style=\"font-weight: 400;\">supporting documents<\/span><\/a><span style=\"font-weight: 400;\"> at your fingertips.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In the event reductions were made, you have one recourse.<\/span><b> If, by December 31, 2020, you restored the employees’ pay<\/b><span style=\"font-weight: 400;\"> to at least 75% of the same wage that they earned as of February 15, 2020, you can avoid this wage-reduction penalty. However, for PPP loans made on or after December 27, 2020, the deadline for restoring such wages and salaries is the last day of the Covered Period for that PPP loan.<\/span><\/p>\n<h2><b>9. Check your progress in a month or two<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Halfway through your forgiveness period, take a look at how you’ve spent your PPP funds so far. If you notice that 60% of your expenses aren’t going towards payroll, or that your average FTE headcount or employee wages are below your thresholds, you may have time to <\/span><b>make necessary adjustments<\/b><span style=\"font-weight: 400;\"> in how you spend the funds you have left, including considering “hazard pay” bonuses, giving people promotions and raises, or hiring new employees.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re trying to use bonuses or raises to get your payroll spending up to the 60% required for full forgiveness, just remember that there is a total cash cap per employee ($100,000 prorated over the number of weeks in your forgiveness period), so gross payroll costs are not to exceed $8,333 per month per worker. However, you may still be eligible for partial forgiveness if you do not meet this 60% threshold.<\/span><\/p>\n<h2><b>10. Prepare and apply for forgiveness<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Once your Covered Period loan forgiveness window has closed, you can submit a forgiveness request to your lender. <\/span><b>The deadline to apply for <\/b><b><i>interest-free<\/i><\/b><b> forgiveness is 10 months after the last day of the Covered Period<\/b><span style=\"font-weight: 400;\">. If you miss this deadline, you may have to make payments of principal, interest, and fees on the covered loan, beginning on the day that is not earlier than the date that is 10 months after the last day of your Covered Period.<\/span><\/p>\n<p>As the borrower, you’re responsible for documenting how you used the PPP proceeds and to demonstrate that you followed the rules we mentioned earlier.<\/p>\n<p><span style=\"font-weight: 400;\">Even before your forgiveness period is up, it’s a good idea to prepare by organizing what you’ll need. First, <\/span><b>ask your lender if they will require any specific documentation<\/b><span style=\"font-weight: 400;\">. As a general guideline, such documents may include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Payroll reports verifying your number of  full-time equivalent employees and pay rates (during both your baseline period and the forgiveness window)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">IRS and state tax and insurance filings<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Records of benefits payments<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Receipts, canceled checks. or other records of PPP-approved expenses like rent and utilities<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Statements for interest paid for debt obligations<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">You must also certify that the documents are true. Once you submit your request, your lender has 60 days to make a decision on the forgiveness.<\/span><\/p>\n<h2><b>11. Choose the PPP forgiveness application that matches your loan and employee numbers<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">The SBA has simplified the application process by providing shorter forms if your business qualifies. There are now three forms. <\/span><a href=\"https:\/\/www.sba.gov\/document\/sba-form-3508ez-paycheck-protection-program-ez-loan-forgiveness-application\"><span style=\"font-weight: 400;\">Form 3508EZ<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/www.sba.gov\/document\/sba-form-3508s-ppp-loan-forgiveness-form-3508s\"><span style=\"font-weight: 400;\">Form 3508S<\/span><\/a><span style=\"font-weight: 400;\"> are simplified documents for eligible employers and solopreneurs. These forms depend on how much you borrowed ($150,000 or less) and whether you reduced employee salaries and headcount.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The forms differ in the calculations they require you to do. Form 3508 requires the most calculations, Form 3508EZ requires less calculations, and Form 3508S is nearly calculation-free. Unless you qualify to use the EZ or S versions, you must apply with the regular <\/span><a href=\"https:\/\/www.sba.gov\/document\/sba-form-3508-paycheck-protection-program-loan-forgiveness-application\"><span style=\"font-weight: 400;\">Form 3508<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p>Keep in mind that most online lenders have digitized all forgiveness application forms, so ask your PPP lender how the process begins. In most cases, you will be directed to an online form that automatically flows you into the appropriate form based on your initial answers—so you don&#8217;t have to worry about which SBA form to complete or mail into them.<\/p>\n<h2><b>An EIDL no longer reduces PPP forgiveness<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">With the passage of the new Act in December, 2020, receipt of an EIDL (Economic Injury Disaster Loan) advance no longer reduces how much loan forgiveness the SBA reimburses your lender.<\/span><\/p>\n<h2><b>What if you don’t qualify for 100% forgiveness?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">It may be difficult to flawlessly comply with (let alone document) the forgiveness requirements. However, <\/span><b>amounts not forgiven simply convert into a 1% interest loan<\/b><span style=\"font-weight: 400;\">, payable over the remaining term of the loan. There’s even a grace period. No payments would be required until the SBA remits the forgivable amount to your lender or your loan forgiveness application is denied. <\/span><b>If you do not request forgiveness, you will not have to make any payments for 10 months<\/b><span style=\"font-weight: 400;\"> following the date of disbursement of the loan. (However, interest will still accrue from the date loan was disbursed.)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If there is evidence that you tried to manipulate the program, such as by providing false information, the SBA’s<\/span><a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/2020-04\/PPP%20Interim%20Final%20Rule_0.pdf\"> <i><span style=\"font-weight: 400;\">Interim Final Rule<\/span><\/i><\/a><span style=\"font-weight: 400;\"> warns that you could be subject to additional charges for knowing violations or misappropriations. Furthermore, the rule states, “If a shareholder, member or partner uses PPP funds for unauthorized purposes, the SBA may have direct recourse against such shareholder, member or partner for the unauthorized use.”<\/span><\/p>\n<h2><b>Summing things up<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">To maximize your forgiveness, the first and most important step is to <\/span><b>consult with your lender on the process and ask what documents you’ll need<\/b><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s also helpful to remember that the Paycheck Protection Program was passed for the purpose of preserving people’s pay during the primary period of this pandemic. That’s the basic theme behind the forgiveness rules. (We’ll continue to update this post to reflect any new rules or guidance.)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To maximize your potential loan forgiveness, first make sure you’re not reducing headcount or wages. Then make adjustments (through rehiring or increasing pay) to avoid reduction penalties and demonstrate that you’ve dedicated at least 60% of your loan to paying your employees (or yourself, if self-employed). Finally, ensure that what’s left over is spent only on approved business expenses.<\/span><\/p>\n<p><b>Three keys to remember are: 1) follow the PPP’s intent, 2) carefully document, and 3) don’t do anything that makes it look like you’re trying to game the system.<\/b><span style=\"font-weight: 400;\"> Just operate your business like you normally would, and play by the rules.<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: Fundbox and its affiliates do not provide financial, legal or accounting advice. This content has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for financial, legal or accounting advice. You should consult your own PPP lender or your own financial, legal or accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The potential for 100% loan forgiveness is one of the most attractive benefits of the Paycheck Protection Program (PPP). The &#8230;<\/p>\n","protected":false},"author":109,"featured_media":13218,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[10410,21],"tags":[11455,426],"yst_prominent_words":[3030,3857],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How to Maximize Your PPP Forgiveness in 2021 | Fundbox Blog","yoast_meta":[{"name":"description","content":"The PPP loan is a low-interest, potentially forgivable loan from the SBA. But many businesses find the forgiveness conditions vague or contradictory. Here are some clarifications, considerations, and suggested documents that can help your forgiveness."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Maximize Your PPP Forgiveness in 2021 | Fundbox Blog"},{"property":"og:description","content":"The PPP loan is a low-interest, potentially forgivable loan from the SBA. But many businesses find the forgiveness conditions vague or contradictory. Here are some clarifications, considerations, and suggested documents that can help your forgiveness."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/ppp-loan-forgiveness\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/05\/Grant_Forgive_shutterstock_518234893.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/05\/Grant_Forgive_shutterstock_518234893.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"The PPP loan is a low-interest, potentially forgivable loan from the SBA. But many businesses find the forgiveness conditions vague or contradictory. Here are some clarifications, considerations, and suggested documents that can help your forgiveness."},{"name":"twitter:title","content":"How to Maximize Your PPP Forgiveness in 2021 | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/05\/Grant_Forgive_shutterstock_518234893.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/ppp-loan-forgiveness\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13210"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/109"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=13210"}],"version-history":[{"count":63,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13210\/revisions"}],"predecessor-version":[{"id":15287,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13210\/revisions\/15287"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/13218"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=13210"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=13210"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=13210"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=13210"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}