{"id":13400,"date":"2020-07-02T11:06:00","date_gmt":"2020-07-02T18:06:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=13400"},"modified":"2020-07-06T09:07:24","modified_gmt":"2020-07-06T16:07:24","slug":"executive-promotions-at-fundbox","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/executive-promotions-at-fundbox\/","title":{"rendered":"Executive Promotions at Fundbox"},"content":{"rendered":"<p>Fundbox announces some key executive promotions and an addition to our board of directors. In their messages below, Eyal Shinar and Prashant Fuloria share the news of our growth and the evolution of the executive team.<\/p>\n<h2>A message from Eyal:<\/h2>\n<p><span style=\"font-weight: 400;\">I would like to share some exciting news that will lay the groundwork for the next stage of growth for Fundbox.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">First, I have decided to step into the full-time role of <strong>Executive Chairman<\/strong>, where I will pretty much continue to do what I do today &#8211; focus on company strategy, corporate and business development, strategic relationships, and board activities. I am not going anywhere and will remain a full-time employee of Fundbox, going to the office everyday (well, once we are back at the office), but with fewer direct reports and focusing more time on strategy and the future of the company. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Second, I’m happy to announce that <strong>Prashant Fuloria<\/strong> is our new CEO. This shouldn’t come as a huge surprise to those close to the company, as in the last six months I have been acting more like an executive chairman and Prashant more as a CEO; the new titles will just reflect this more accurately.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additionally, we’re expanding our board of directors with the addition of <strong>Melissa Guzy<\/strong> of Arbor Ventures. A fintech veteran, Melissa brings more than 30 years of experience as an entrepreneur and fintech venture investor. She is also an expert on all things Asia. As a member of the Fundbox board of directors, she will leverage deep domain expertise and entrepreneurial experience gained at the helm of Arbor Ventures, Asia’s largest fintech-focused venture firm.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As I look back on the past seven years since we started Fundbox, I am incredibly proud of what we have accomplished. We launched Fundbox at a time when access to credit for small businesses was sparse, and, where available, cumbersome and stifling. We saw a huge need in the market, and we knew we could fill it, leveraging technology to do it better and faster than anyone else. Since then, we have continued to grow, each year providing more value to our community of small businesses, enabling many to grow and thrive. Fundbox today, is better positioned than any other fintech player out there to reach the next level.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For the past four years, I have been fortunate to partner with Prashant in defining and executing Funbox’s long-term strategy. As you know, over the course of his tenure, Prashant has played an integral role in Fundbox’s business, operational, and product success. During this time Prashant has proven to be open-minded, a creative problem solver, a true innovator and great guitar player. His strengths were on full display these past few months, as he helped the organization successfully navigate through the Covid crisis while demonstrating grace under fire.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In stark contrast to many companies, we have not just survived the crisis, but are emerging as the new market leader in our space. Our investments in real-time data access, machine learning, and robust credit management helped us respond quickly, stay open for business, and continue serving our customers. Key portfolio health metrics are now back at, and mostly better than, pre-crisis levels. And, the recent extension of our Series C equity round during the worst of covid was further testament to our strong performance.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I would also like to take this opportunity to announce two other promotions. First, we are promoting <strong>Abbie McBride<\/strong>, our VP Sales and Ops, to Chief Revenue Officer. Since joining Fundbox a year and a half ago, Abbie has been instrumental in building out our sales and operations efforts, which include a large part of our new Dallas presence. She has also recently stepped up to take responsibility for business development. Second, we are promoting <strong>Omer Ben-Bassat<\/strong>, our Head of Product, to VP Product, an executive-level role. Omer has been a mainstay of our product development efforts for three and a half years, first managing our Risk product effort, and then leading our entire Line product management team. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To all the dedicated Fundbox employees, thank you for your continued focus on serving our small business customers, and for everything you do to keep moving our business forward. And please join me in congratulating Prashant, Abbie and Omer on their new roles!<\/span><\/p>\n<h2>A message from Prashant:<\/h2>\n<p><span style=\"font-weight: 400;\">I’m honored by Eyal&#8217;s support and confidence in my leadership. I’ve greatly enjoyed working with him and the rest of the Fundbox team over the last four years and I look forward to continuing to do so for a long time. And yes, I’m excited to lead the company as CEO! More than ever before, I’m confident that we can deliver on our mission &#8211; to help small businesses succeed through innovative credit and payment products. Along the way, we are also building an incredibly successful business of our own, and having fun doing it. 🙂 <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I joined Fundbox because of three reasons &#8211; our mission, our people, and our ability to do big things. (Read about it in the <\/span><a href=\"https:\/\/fundbox.com\/blog\/humans-of-fundbox-prashant-fuloria\/\"><span style=\"font-weight: 400;\">Humans of Fundbox<\/span><\/a><span style=\"font-weight: 400;\">!) Four years in, these factors remain strong and have shone brighter than ever during the last few months. Thanks to these qualities, we have continued to serve our customers in new ways and grow our business during the downturn.   <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I’d like to echo Eyal and congratulate Abbie on her promotion to CRO and Omer on his promotion to VP Product. Abbie’s done a terrific job in building a very strong sales and operations function, and recently led a very successful initiative to deliver PPP funding to our customers. Likewise, Omer has helped shape our product efforts into a well-oiled machine that consistently delivers with quality and speed. Way to go, Abbie and Omer!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">And now, we’ll get back to work!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fundbox announces some key executive promotions and an addition to our board of directors. In their messages below, Eyal Shinar &#8230;<\/p>\n","protected":false},"author":112,"featured_media":13431,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504],"yst_prominent_words":[],"post-meta-fields":{"stripe_selected":"bottom-left-curve","preview_color":"blue","bw_feature":"yes","category_color":null},"yoast_title":"Executive Promotions at Fundbox | Fundbox Blog","yoast_meta":[{"name":"description","content":"Fundbox announces executive promotions effective July 1, 2020, with Eyal Shinar becoming Executive Chairman and Prashant Fuloria ascending to the role of CEO, plus other promotions within the executive team."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Executive Promotions at Fundbox | Fundbox Blog"},{"property":"og:description","content":"Fundbox announces executive promotions effective July 1, 2020, with Eyal Shinar becoming Executive Chairman and Prashant Fuloria ascending to the role of CEO, plus other promotions within the executive team."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/executive-promotions-at-fundbox\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/07\/FundboxOffice2BW.png"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/07\/FundboxOffice2BW.png"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Fundbox announces executive promotions effective July 1, 2020, with Eyal Shinar becoming Executive Chairman and Prashant Fuloria ascending to the role of CEO, plus other promotions within the executive team."},{"name":"twitter:title","content":"Executive Promotions at Fundbox | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/07\/FundboxOffice2BW.png"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/executive-promotions-at-fundbox\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13400"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/112"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=13400"}],"version-history":[{"count":16,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13400\/revisions"}],"predecessor-version":[{"id":13433,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13400\/revisions\/13433"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/13431"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=13400"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=13400"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=13400"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=13400"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}