{"id":13587,"date":"2020-07-30T00:01:48","date_gmt":"2020-07-30T07:01:48","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=13587"},"modified":"2020-11-11T15:17:59","modified_gmt":"2020-11-11T23:17:59","slug":"adjusting-new-normal-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/adjusting-new-normal-business\/","title":{"rendered":"Adjusting to the New Normal: 8 Business Owners Share Their Tips"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">The state of business has been unpredictable this year, but one thing is certain: business owners are adapting at lightning speed. Companies of all sizes and in every industry are grappling with business closures, <\/span><a href=\"https:\/\/fundbox.com\/blog\/business-growth-on-budget\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">tighter budgets<\/span><\/a><span style=\"font-weight: 400;\">, and changing customer behavior due to COVID-19. <\/span><span style=\"font-weight: 400;\">As a result, business owners have had to adopt new skills, processes, <\/span><i><span style=\"font-weight: 400;\">and<\/span><\/i><span style=\"font-weight: 400;\"> perspectives. To <\/span><a href=\"https:\/\/fundbox.com\/blog\/what-business-owners-wish-they-knew-starting-out\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">learn from their mistakes and successes<\/span><\/a><span style=\"font-weight: 400;\">, we spoke with eight business owners about how they’re adjusting to the new normal—and what they plan to do going forward. Here are their tips. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">1. Don’t be afraid to change your business model<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">“Since the COVID-19 outbreak, I’ve had to pivot my operations from a conventional front-facing business to a 100% e-commerce consultancy. <\/span><span style=\"font-weight: 400;\">I offered services traditionally delivered in person via instruction, facilitation, or coaching. <\/span><span style=\"font-weight: 400;\">At first, I missed the personal interactions and connecting with local businesses, but I’ve enjoyed meeting new prospective clients online. My online marketing strategy has allowed me to have a broader reach than my direct market, which means I can connect to customers outside my market and increase my visibility.”<br \/>\n<\/span><em>– Angelique Hamilton, MBA, CEO and founder of <a href=\"https:\/\/www.hrchiquegroup.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">HR Chique Group<\/a>, an organization that provides professional and business development and training services<\/em><\/p>\n<p><span style=\"font-weight: 400;\">“The strategies that have worked well for me and my clients have been those based on an early adopter or risk-taking mentality. Many of my clients have begun to explore how to leverage virtual service delivery to fundamentally change the way their services are bought and sold. For example, I recently worked with a client to develop a new service offering that involves a subscription-based health and wellness coaching package. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">And the clients I have that took the risk to explore telehealth—not just as a survival tool, but as a new component of their clinical service delivery—found themselves at a great advantage over clinics that tried to hunker down and ride out the storm. As we move out of the crisis, many clinicians are beginning to see the potential of leveraging technology to help patients improve their clinical outcomes, increase engagement, and improve course of care completion rates.”<br \/>\n<\/span><em><span style=\"font-weight: 400;\">– <\/span><span style=\"font-weight: 400;\">Rafael E. Salazar II, MHS, OTR\/L, and the principal owner of <\/span><a href=\"https:\/\/rehabupracticesolutions.com\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Rehab U Practice Solutions<\/span><\/a><span style=\"font-weight: 400;\">, a company that advises healthcare organizations on patient retention strategy<\/span><\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Analyze your business model to see if it still makes sense. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work on creating virtual offerings, not as a temporary fix but as a long-term solution. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Explore new forms of <\/span><a href=\"https:\/\/fundbox.com\/blog\/cloud-technology-can-help-business\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">technology<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">2. Pivot your offerings<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">“Not only did we have to pivot internally to a 100% remote team, but we also had to pivot some of our product offerings. In February, we launched our in-real-life Sonder Circles, an immersive self-care and guided journaling experience for our members. During [shelter-in-place], our customers needed the intimacy and support of their peers more than ever, so we ended up transferring the guided journaling experience from IRL to virtual. Not only was this quicker to spin up, but we were able to access a much wider audience versus only specific regions.”<br \/>\n<\/span><em><span style=\"font-weight: 400;\">– Meha Agrawal, the founder and CEO of <\/span><a href=\"https:\/\/www.silkandsonder.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Silk + Sonder<\/span><\/a><span style=\"font-weight: 400;\">, a monthly wellness planner subscription<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">“In May, I launched the No Small Business Left Behind [Virtual] Summit, focused on income generation and providing resources to small business owners—mainly Black and Black women—for survival. On July 1st, we held the second summit, where we focused on opportunities for brick-and-mortar business owners to think creatively about space use and marketing. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">I believe our Summit will continue monthly as we see attendees not just surviving but thriving from the resources, information, and connections made through our platform. The Summits have also benefited our speakers and vendors because they can share their expertise, make new connections, and acquire new clients.”<br \/>\n<\/span><em>– Michelle Y. Talbert, the founder and chief curator of Her Power Space, a coworking space, business event venue, and podcast studio in Broward County, South Florida<\/em><\/p>\n<p><span style=\"font-weight: 400;\">“We were a high-touch boutique digital marketing consultancy. Many businesses cut their budgets significantly and could no longer afford the types of services we offered, but still needed digital marketing support and assistance. So we created a SaaS tool that creates social media content and posts to social channels automatically. The product can do it all: find the content to post, design the imagery, write the caption, and post at an appropriate time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We essentially replicated our social media management offering using machine learning so we could cut out the most expensive elements: the strategy and content creation hours spent by humans. This means we can still offer high quality social media assistance but without paying for humans to do it.”<br \/>\n<\/span><em>– Khaleelah Jones, the founder and CEO of <a href=\"https:\/\/www.carefulfeet.me\/\" target=\"_blank\" rel=\"noopener noreferrer\">Careful Feet Digital<\/a>, a digital marketing agency<\/em><\/p>\n<p><span style=\"font-weight: 400;\">“My company develops event\/experiential technology, and because of COVID-19, all our events and brand activations have been canceled. So we started working with brands to create virtual AR\/VR technology to connect with their audience and amplify their brand voice and music. Reaching out and networking with brands during this time worked well. They were hesitant about what to do next, and they had a lot of time to chat and brainstorm new ideas on how to engage with their audience, which is where we came in.”<br \/>\n<\/span><em>– Chynna Morgan, the founder and CEO of <a href=\"https:\/\/gifsoutloud.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">GIF Out Loud<\/a>, a company that creates experiential technology for brands and musical artists<\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Examine your services and products to see what’s no longer relevant.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Brainstorm new ways to serve customers and clients.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experiment with <\/span><a href=\"https:\/\/fundbox.com\/blog\/update-your-digital-marketing\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">digital<\/span><\/a><span style=\"font-weight: 400;\"> services, events, and communication.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Consider turning your services into products. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">3. Prioritize customer service<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">“Customer service is imperative now more than ever. People are holding on to their income, so you have to work harder to earn it. My office used to use retainers only. Now we’re doing retainers and monthly payment plans to make it easier for clients to pay smaller sums. I’m also providing free online webinars to help potential and current clients.”<br \/>\n<\/span><em>– Maria M. Barlow, an attorney and owner of <a href=\"https:\/\/www.attorneymariabarlow.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Law Offices of Maria M. Barlow LLC<\/a><\/em><\/p>\n<p><span style=\"font-weight: 400;\">“The number one quality I think business owners, especially those in the healthcare space, need to thrive in this new normal is empathy and understanding. You need to understand the needs, desires, and goals of your patients and clients in order to offer services that are seen as meaningfully different and valuable.”<br \/>\n<\/span><em>– Salazar<\/em><\/p>\n<p><span style=\"font-weight: 400;\">“It’s important to appreciate those customers who are still buying from us. Even though our revenues have not bounced back, I gave our monthly paying customers a moratorium on their July invoices. They continued to pay us during the height of the pandemic and I wanted them to know they are appreciated and helped us through a very rough time. Talking to and cultivating relationships with our customers, operating relationally and not transactionally, is a quality to hone in this time and continue once we reach the other side.”<br \/>\n<\/span><em>– Talbert<\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ask customers and clients for feedback.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Put <\/span><a href=\"https:\/\/fundbox.com\/blog\/service-businesses-covid-19\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">customers’ needs first<\/span><\/a><span style=\"font-weight: 400;\"> by offering different solutions to their problems. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Find ways to thank customers and clients for their support.<\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">4. Take advantage of opportunities to innovate<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">“The mindset I hope to carry forward will be to try and cultivate the habit of seeing opportunity in the midst of chaos. Yes, the economy shut down. Yes, many outpatient and ancillary healthcare services were prevented from continuing in-person treatment. And yes, many referral sources dried up. But even in that environment, there remained opportunities to radically change the way the clinic did business, to expand into new service areas, to become real innovators in the healthcare space.”<br \/>\n<\/span><em>– Salazar<\/em><\/p>\n<p><span style=\"font-weight: 400;\">“I think you must continue to learn and implement new and innovative technologies if you want your business to survive, especially in this climate. As a business owner, it’s your job to stay relevant and continue to evolve with the times. Make sure you’re open and able to adapt to the landscape of your current market. You might have to reposition yourself in your industry, but the key is to create opportunities that will allow you to monetize your business during this time and post-COVID-19.”<br \/>\n<\/span><em>– Morgan<\/em><\/p>\n<p>“When I was shifting my makeup line to e-commerce from a brick-and-mortar business model, I didn’t know how to build a community or how people would try on makeup without seeing it physically. But I went through some tech accelerators and grew my knowledge and the windows of opportunity swung open.<\/p>\n<p><span style=\"font-weight: 400;\">Now, I have partnered with Algoface and I’m providing virtual makeup try-ons to people who come to our website wanting to know which product matches their skin tone. We’ve implemented quizzes to give recommendations to customers. My strategy is to utilize experiences that were unique to physical retail and make them applicable to the digital world. My goal is to make it a better experience to buy makeup online than it is in person.”<br \/>\n<\/span><em>– Kim Roxie, the founder of <a href=\"https:\/\/lamikbeauty.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">LAMIK Beauty<\/a>, a vegan makeup line made for multicultural women<\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Look for opportunities within your industry and business to <\/span><a href=\"https:\/\/fundbox.com\/blog\/economic-development-initiatives-reward-innovation-support-small-businesses\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">innovate<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Prioritize learning.<\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">5. Improve internal communication<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">&#8220;The biggest change for me has been increasing communication cadence. As a former software engineer and product manager, I&#8217;ve applied the agile development principles of Sprint Planning and Daily Standups to my team. <\/span><span style=\"font-weight: 400;\">Every week, we sync and discuss: 1) what went well the previous week, 2) what could have gone better, 3) what we hope to achieve this upcoming week, and 4) any pressing questions or blockers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This helps our entire team get crystal clear on what needs to be prioritized and where collaboration is required. In remote team environments, communication is the key ingredient to holding ourselves and others accountable. At the end of every month we also discuss celebrations, challenges, and action steps. This promotes a culture of independence and ownership while simultaneously allowing for mistakes and learnings.”<br \/>\n<\/span><em>– Agrawal<\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Develop a system for sharing team updates and asking questions.<\/span><\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/fundbox.com\/blog\/running-business-remotely\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Communicate frequently<\/span><\/a><span style=\"font-weight: 400;\"> with employees to make sure everyone is on the same page.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Be open to learning. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">6. Collaborate with other business owners<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">“When we took that initial hit of a 95% revenue dip within the first 30 days of quarantine, I became very insular and inward-focused. It was only when I began to focus outward, first by posting daily videos where I highlighted other women business owners and their products and services, and then by launching the Summits, that my own perspective expanded and my income increased. <\/span><span style=\"font-weight: 400;\">Publicly highlighting customers and other members of our community had two benefits: it kept us top of mind without making it all about us, and also endeared us to our community during a time of great uncertainty.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I’d recommend connecting with other business owners to see if there are ways to pool resources, whether that’s raw materials of production or one another’s client bases, and offer bundled services or create affiliate relationships that expose you each to new markets. Also, seek out mentors and peers. Ask folks to meet for virtual coffee on Zoom. Give people you’ve worked with good reviews on LinkedIn. Attend online events and connect in the chats. Add value and share your expertise and ask great questions.”<br \/>\n<\/span><em><span style=\"font-weight: 400;\">– Talbert<\/span><\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Connect with other entrepreneurs to discuss ideas, collaborate on projects, or refer one another.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Find ways to support other business owners in their <\/span><a href=\"https:\/\/fundbox.com\/blog\/5-barriers-to-small-business-growth-and-how-to-break-through-them\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">growth<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">7. Don’t give up    <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">“Don’t give up. It’s one of the most challenging eras of our time, and no one has a quick answer to ending the crisis. Continue to ask your customers what they need, and try to find the answers to solving their problems. And if you’re in need of financial assistance, contact your local Small Business Administration office for available funding, and search for available assistance to help. Most of all, be tenacious and embrace the transformation. Personally, I’m more determined to adapt to change. The crisis has allowed me to become more proactive in my planning instead of reactive to what is occurring around me.”<br \/>\n<\/span><em><span style=\"font-weight: 400;\">– Hamilton<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">“Look at ways to generate income from existing resources in your business that may be underutilized. For instance, if you have a brick-and-mortar business, you can register with an online shopping site, like Wish, and become a pick-up location for local orders. If you can’t fill the space with people then use the unused square footage for inanimate objects, like parcels. Repurpose and rethink anything that isn’t being used to make income because of COVID-19.”<br \/>\n<\/span><em><span style=\"font-weight: 400;\">– Talbert<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">“It’s important that business owners have compassion for themselves right now and take a few days off. It might sound and feel contrary to everything going on around you, but that space can really assist you in thinking more creatively about solutions that can help you thrive now and in the future. <\/span><span style=\"font-weight: 400;\">If a few days isn&#8217;t an option, even a few hours a day for a week can help.<\/span><span style=\"font-weight: 400;\">”<br \/>\n<\/span><em><span style=\"font-weight: 400;\">– Jones<\/span><\/em><\/p>\n<h3><span style=\"font-weight: 400;\">Key takeaways:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work on being resourceful and adaptable. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Look for ways to generate passive income or <\/span><a href=\"https:\/\/fundbox.com\/blog\/ppp-loan-checklist\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">obtain financing<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Prioritize your personal wellbeing.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Running a business in this new normal takes patience, strategy, and resourcefulness, but it’s still possible to thrive. For help, check out our <\/span><a href=\"https:\/\/fundbox.com\/blog\/covid-19-business-update\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">COVID-19 small business resource guide<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: Fundbox and its affiliates do not provide financial, legal or accounting advice. This content has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for financial, legal or accounting advice. You should consult your own financial, legal or accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The state of business has been unpredictable this year, but one thing is certain: business owners are adapting at lightning &#8230;<\/p>\n","protected":false},"author":83,"featured_media":13594,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72],"yst_prominent_words":[],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"Adjusting to the New Normal: 8 Business Owners Share Their Tips | Fundbox Blog","yoast_meta":[{"name":"description","content":"After COVID hit the economy, business owners are adapting at lightning speed, with new skills, processes, and perspectives. To learn from their mistakes and successes, we spoke with eight business owners about how they’re adjusting to the new normal and what they plan to do going forward. Here are their tips. "},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Adjusting to the New Normal: 8 Business Owners Share Their Tips | Fundbox Blog"},{"property":"og:description","content":"After COVID hit the economy, business owners are adapting at lightning speed, with new skills, processes, and perspectives. To learn from their mistakes and successes, we spoke with eight business owners about how they’re adjusting to the new normal and what they plan to do going forward. Here are their tips. "},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/adjusting-new-normal-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/07\/shutterstock_1781439278.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/07\/shutterstock_1781439278.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"After COVID hit the economy, business owners are adapting at lightning speed, with new skills, processes, and perspectives. To learn from their mistakes and successes, we spoke with eight business owners about how they’re adjusting to the new normal and what they plan to do going forward. Here are their tips. "},{"name":"twitter:title","content":"Adjusting to the New Normal: 8 Business Owners Share Their Tips | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2020\/07\/shutterstock_1781439278.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/adjusting-new-normal-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13587"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/83"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=13587"}],"version-history":[{"count":9,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13587\/revisions"}],"predecessor-version":[{"id":14626,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/13587\/revisions\/14626"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/13594"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=13587"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=13587"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=13587"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=13587"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}