{"id":14970,"date":"2019-01-03T09:50:50","date_gmt":"2019-01-03T17:50:50","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=14970"},"modified":"2021-01-15T17:55:52","modified_gmt":"2021-01-16T01:55:52","slug":"small-business-declaring-bankruptcy","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/small-business-declaring-bankruptcy\/","title":{"rendered":"Does Your Business Need to Declare Bankruptcy?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">It’s no surprise <\/span><a href=\"https:\/\/www.reuters.com\/article\/us-health-coronavirus-usa-bankruptcy\/u-s-commercial-bankruptcies-up-33-year-to-date-idUSKBN26Q2ZF\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">U.S. commercial bankruptcy filings<\/span><\/a><span style=\"font-weight: 400;\"> in 2020 were up 33% from the previous year due to the coronavirus pandemic. In September alone, business bankruptcy cases surged 78% over September 2019. There will undoubtedly be more filings as businesses struggle to stay afloat as the COVID-19-spawned economic recession continues. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Declaring bankruptcy is not an easy decision to make. It’s the solution business owners turn to after exhausting all other options. It’s the realization they have to make a major move to pay off outstanding debts and either close or reorganize their companies. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re concerned about the financial stability of your small business and want to know more about the process of filing for bankruptcy, the types of bankruptcies, and what to expect when you enter a business bankruptcy, we’ve put together this helpful guide.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What is Business Bankruptcy?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Bankruptcy is a legal proceeding for businesses (and individuals) to cancel debts and provide creditors a method to receive payment from a struggling business. The legal procedure is outlined in the U.S. Bankruptcy Code and handled in federal courts. Business owners try to avoid bankruptcy because it often means the company’s end and results in a black mark on the company’s (and owner’s) credit report.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">When Should You File a Business Bankruptcy?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Talk to your company’s accountant to make sure you have all the facts about your financial status. What do they think about filing for bankruptcy? Your first step as the business owner is to ask yourself whether you want to try and save your business or if you’re ready to call it quits? If you think you’re just hitting a rough spell and can talk to creditors about delaying payment or creating a temporary repayment plan, you may be able to avoid bankruptcy altogether. However, if the amount of debt is too overwhelming, and you need legal help to erase your debt problem, you have a couple of options depending on how you’ve structured your business.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Types of Bankruptcies<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are three types of bankruptcy (or “chapters”) for small businesses. <\/span><\/p>\n<h4><b>1. Chapter 7: Liquidation<\/b><span style=\"font-weight: 400;\">. <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Chapter 7 bankruptcy is a liquidation option for both individuals and businesses. For businesses, it means you can no longer continue to operate your company and must liquidate the business’s assets to pay off your debts. Once the business is in bankruptcy court, employees are dismissed, and the company ceases to operate. The court then assigns a trustee to take over and handle the liquidation and payments to creditors. Likely, the business has several creditors requesting payments. It is the trustee’s responsibility to divide the assets and pay the creditors. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As a sole proprietor, the business’s liabilities and assets are not legally separate from the business owner’s personal assets. Therefore, sole proprietorships file for personal bankruptcy under Chapter 7. However, if most of your debt comes from the business, you may be able to protect some of your personal assets from liquidation to pay the business’s debts. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Bankruptcy exemptions vary by state, and some let you keep essentials such as your home, car, or professional equipment. Some exemptions protect the entire value of the asset, while others just protect a portion of the asset’s value. However, most business property is not exempt, and you will likely lose it to liquidation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Typically, Chapter 7 enactment takes four to six months from the time you file paperwork with the court. Once your bankruptcy proceedings are approved, you’ll receive a bankruptcy “discharge,” which means you are no longer responsible for the debt. All correspondence and inquiries about payment are then directed to the trustee assigned to your case.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although entities such as corporations, limited liability companies (LLCs), partnerships, and sole proprietorships are all eligible to file for Chapter 7 bankruptcy, only the sole proprietor can receive a formal discharge. Therefore, in some cases, under Chapter 7, creditors can still sue a corporation, LLC, and partnership owners to satisfy a debt.<\/span><\/p>\n<h4><b>2. Chapter 13: Reorganization<\/b><span style=\"font-weight: 400;\">. <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Another option for sole proprietors is to file for Chapter 13. Usually used by individuals and not business owners, very small businesses, or sole proprietors with just a few creditors can use Chapter 13, as well. Chapter 13 allows sole proprietors to reorganize their debts and keep their businesses operating. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Bankruptcy Code sets specific debt limits for Chapter 13 and is set every three years. The current amounts of debt that can be reorganized in a Chapter 13 bankruptcy are $419,275 of unsecured debt and $1,257,850 of secured debt. (Unsecured debt is debt with no collateral backing, and secured debt has specific assets as collateral. Unsecured debt is based on the borrower’s creditworthiness.)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Under Chapter 13, the trustee can access the sole proprietor’s personal and business assets and debts, and personal and business property may be used to pay back the debt. If you choose to file for Chapter 13, you must submit a reorganization plan to the court to show how you intend to pay back the debt—usually for three to five years. <\/span><\/p>\n<h4><b>3. Chapter 11: Reorganization<\/b><span style=\"font-weight: 400;\">. <\/span><\/h4>\n<p><span style=\"font-weight: 400;\">Chapter 11 is for any entity, sole proprietor, LLC, corporation, or partnership, that desires to continue running the business while reorganizing its debts. Struggling businesses typically follow this course when the situation is not entirely hopeless, and they can continue operating with assistance from the bankruptcy court.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Unlike Chapter 7, when the company shuts down and the trustee controls the business’s assets and debts, in a Chapter 11 bankruptcy, the business owner maintains control and can make decisions for the company, as long as the court agrees. The goal is to pay off the debts in a specified time frame and then emerge from bankruptcy as a debt-free operational organization. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To qualify for Chapter 11, the business must still be generating income. As with Chapter 13, you must submit a reorganization plan to the court to show how you intend to pay back the debt. The court and your creditors must review and approve your plan. You can set up a repayment plan with creditors without going to bankruptcy court, but it’s likely creditors will expect payment much sooner. The court can set repayment terms at 20 years or more.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Small Business Reorganization Act<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The <\/span><a href=\"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/3311\/text\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Small Business Reorganization Act of 2019 <\/span><\/a><span style=\"font-weight: 400;\">was signed into law to allow small businesses to file for Chapter 11 bankruptcy quicker and less costly. The SBRA, which took effect in February 2020, applies to companies with secured and unsecured debts of less than $2,725,625. Under the SBRA, the business is ensured a trustee to facilitate the company’s reorganization. The act also eliminates some of the procedural burdens and costs related to reorganization. Also, debts are no longer required to be paid in full to retain ownership of a company. As with any legal proceeding, check with your attorney to see if the SBRA benefits your reorganization situation.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Aftermath of Bankruptcy<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Although bankruptcy stays on your credit report for several years (usually seven-10 years), building back your good credit can start right after discharge. Pay your bills on time—or even multiple times per month—and consider enrolling in autopay.  Also make sure to check your credit reports regularly to look for mistakes.  <\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: This information has been aggregated from external sources. Fundbox and its affiliates do not provide financial, legal or accounting advice. This content has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for financial, legal or accounting advice. You should consult your own financial, legal or accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s no surprise U.S. commercial bankruptcy filings in 2020 were up 33% from the previous year due to the coronavirus &#8230;<\/p>\n","protected":false},"author":18,"featured_media":14973,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,72,11532],"yst_prominent_words":[6639,723,7429,5490,3439,3368],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"Does Your Business Need to Declare Bankruptcy? | Fundbox Blog","yoast_meta":[{"name":"description","content":"Declaring bankruptcy is not an easy decision to make. If you’re concerned about the financial stability of your small business and want to know more about the process of filing for bankruptcy, the types of bankruptcies, and what to expect when you enter a business bankruptcy, we’ve put together this helpful guide."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Does Your Business Need to Declare Bankruptcy? | Fundbox Blog"},{"property":"og:description","content":"Declaring bankruptcy is not an easy decision to make. If you’re concerned about the financial stability of your small business and want to know more about the process of filing for bankruptcy, the types of bankruptcies, and what to expect when you enter a business bankruptcy, we’ve put together this helpful guide."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/small-business-declaring-bankruptcy\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/01\/shutterstock_1738593419.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/01\/shutterstock_1738593419.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Declaring bankruptcy is not an easy decision to make. If you’re concerned about the financial stability of your small business and want to know more about the process of filing for bankruptcy, the types of bankruptcies, and what to expect when you enter a business bankruptcy, we’ve put together this helpful guide."},{"name":"twitter:title","content":"Does Your Business Need to Declare Bankruptcy? | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/01\/shutterstock_1738593419.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/small-business-declaring-bankruptcy\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/14970"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=14970"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/14970\/revisions"}],"predecessor-version":[{"id":14975,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/14970\/revisions\/14975"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/14973"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=14970"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=14970"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=14970"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=14970"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}