{"id":15076,"date":"2021-02-11T14:25:46","date_gmt":"2021-02-11T22:25:46","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15076"},"modified":"2021-02-11T14:25:46","modified_gmt":"2021-02-11T22:25:46","slug":"small-business-marketing-strategy","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/small-business-marketing-strategy\/","title":{"rendered":"How Do You Create a Marketing Strategy for a Small Business?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">In a perfect world, your business would thrive on word of mouth marketing alone. Over time, your business may be able to benefit greatly from the simple act of customers loving your products or services and spreading the word. For that to happen though, you need to make sure people learn about all of your amazing offerings. This is where a marketing strategy comes in.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A good marketing strategy can help a small business build brand awareness and accomplish their goals. So let’s take a look at how you can create a small business marketing strategy that works for your business. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">1. Do a competitive analysis<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A tried and true business strategy that can help you create a solid marketing strategy is to do a competitive analysis. A competitive analysis involves identifying your main competitors and researching their products, branding, and marketing strategies. The point of studying your competitors closely is not to copy them, but to see what is working for them and to consider if a similar strategy may or may not work for your brand. For example, if you’re focused on B2B marketing, social media may seem like a waste of time. But if you see that a competitor has found a savvy way to use LinkedIn to their advantage, you may start to see the social appeal. Ideally, you’ll leverage what you learn about your competitors’ marketing strategies and make yours even better. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2. Analyze your customers<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Who are your customers? Where do they live? How old are they? How much do they earn? Take whatever data you have about your customers and put it to work. Take note of who your current customer base is and what your ideal customer base looks like. If these two align, then great! You know exactly who you’re marketing to and can plan your strategy around what makes them tick. But if you’re trying to shift to a new customer base, you’ll need to create a strategy that can keep your current base happy and begin to attract a new one at the same time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">One great way to learn more about your customers is to create a customer survey and ask for their feedback. Straightforward, simple, and very revealing. Offering customers a coupon or some other sort of incentive for taking the survey is always a good idea. Asking for their honest feedback about what they love and—just as importantly—don’t love about your business can give you major insight into how to improve your business. You can also ask for details about how they like to interact with your business. Are they fans of email updates about new products? Do they prefer to shop online or in-person? Do they like to call to make an appointment or would they be more likely to use an online booking service? Find out what really makes them tick and plan around that. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">3. Watch out for trends<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">While it can be scary to jump off the deep end into a new <a href=\"https:\/\/fundbox.com\/blog\/2021-small-business-trends\/\" target=\"_blank\" rel=\"noopener noreferrer\">marketing trend<\/a>, being a trendsetter has its perks. Mainly, less competition. In 2020, a major digital marketing trend was to utilize TikTok. Plastic surgeons debunk cosmetic surgery myths in fun quick videos on TikTok. Dance studios show off their students’ talent. People are having fun while marketing their businesses at the same time. Pay attention to the cultural zeitgeist and see what trends you can use to your advantage. In 2021, it’s likely a new craze may come along and create room for marketers to make waves. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">4. Create a marketing plan and then change it<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">As you’re fine tuning what type of marketing strategy works for your small business, put your plans in writing. Create a marketing plan that outlines everything you learned in the analysis of your competitors and customers. Then include your marketing plans for the entire year if possible. Break these plans down by quarter and include the benchmarks you hope to meet. Allocate a budget for any marketing expenses and make this plan as thorough as possible. Marketers that document their marketing strategies are <\/span><a href=\"https:\/\/media.coschedule.com\/uploads\/CoSchedule_State-Of-Marketing-2019_Full-Report.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">313% more likely to report success<\/span><\/a><span style=\"font-weight: 400;\"> than those who don’t document their plan!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s where things get exciting. Feel free to change this plan from time to time. The point of documenting your marketing plan is not to force yourself to follow it exactly, but to give you focus and direction. If you realize after six months that content marketing just doesn’t work for your business, you may want to allocate those resources to a different marketing strategy, like paid social ads. It’s okay to alter your marketing plan, as long as you’re thoughtful about it. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">5. Pick a strategy<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There is no one right small business <\/span><a href=\"https:\/\/fundbox.com\/blog\/ecommerce-marketing-strategies\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">marketing strategy<\/span><\/a><span style=\"font-weight: 400;\">. We’re going to look at a few popular strategies, but take them all with a grain of salt. Some may be the perfect fit for your business and others may be a huge mistake. Feel free to combine multiple strategies, there is no need to pick just one! Remember, if you try a marketing strategy that doesn’t work for your small business, you can alway pivot. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Go digital<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">We live in a world that is becoming more and more digital by the minute. In many ways, technology makes our lives easier. Digital marketers know this best. If you need to refresh your small business marketing, consider going digital. There are countless tools and avenues available to you to promote your business in a digital way. You can reach a very wide audience or a super tailored one with the help of data and analytics. You can market your small business digitally for free on Facebook or you can use a budget to fund large digital ad campaigns. The point is, you have choices. Sponsor a podcast. Take out a ton of Google Ads. Create a weekly email newsletter. The digital sky&#8217;s the limit!<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Get social<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">While getting social on social media is a great place to start (<\/span><a href=\"https:\/\/www.statista.com\/statistics\/278414\/number-of-worldwide-social-network-users\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">billions of people are active on social media after all<\/span><\/a><span style=\"font-weight: 400;\">), your social media marketing efforts can extend far past the occasional Tweet. If you are using social media marketing, make sure you’re actually socializing with your customers. Respond to their comments and direct messages. Share their user generated content. Make them feel like your business has a living breathing presence and is listening to them. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Don’t forget, you can get social in ways that don’t involve being glued to your smartphone. Attend virtual networking events or sponsor the high school baseball team. Create opportunities to truly connect with your clients and customers and you can develop some brand loyalty along the way.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Be influential<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">There is a reason influencers are all the rage, they’re very influential. A <\/span><a href=\"https:\/\/influencermarketinghub.com\/influencer-marketing-2019-benchmark-report\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">2019 survey<\/span><\/a><span style=\"font-weight: 400;\"> found that businesses are making $5.20 for every $1 they spend on influencer marketing. Find an influencer whose audience aligns with your customer base and hire them to create marketing assets for you. You’ll gain unique and valuable promotions for your products or services and access to their audience at the same time. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Keep it local<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The beauty of digital marketing is that it can help you connect with new customers or clients from around the world. That being said, global domination isn’t for everyone. If you want your small business to focus on serving your community, then consider creating a marketing strategy that really caters to them. If you run a single restaurant or a dry cleaning business, then coupons in your local paper may bring you much more business than being active on five different social media platforms.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In a perfect world, your business would thrive on word of mouth marketing alone. Over time, your business may be &#8230;<\/p>\n","protected":false},"author":91,"featured_media":15080,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,10158],"yst_prominent_words":[723,933,798,808,944,3464,6420,712,804,794,5259,1389],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"How Do You Create a Marketing Strategy for a Small Business? | Fundbox Blog","yoast_meta":[{"name":"description","content":"A good marketing strategy can help a small business build brand awareness and accomplish their goals. This article discusses five ways you can create a small business marketing strategy that works for your business. "},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How Do You Create a Marketing Strategy for a Small Business? | Fundbox Blog"},{"property":"og:description","content":"A good marketing strategy can help a small business build brand awareness and accomplish their goals. This article discusses five ways you can create a small business marketing strategy that works for your business. "},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/small-business-marketing-strategy\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/02\/shutterstock_1085354030.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/02\/shutterstock_1085354030.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"A good marketing strategy can help a small business build brand awareness and accomplish their goals. This article discusses five ways you can create a small business marketing strategy that works for your business. "},{"name":"twitter:title","content":"How Do You Create a Marketing Strategy for a Small Business? | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/02\/shutterstock_1085354030.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/small-business-marketing-strategy\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15076"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/91"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15076"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15076\/revisions"}],"predecessor-version":[{"id":15079,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15076\/revisions\/15079"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15080"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15076"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15076"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15076"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15076"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}