{"id":15186,"date":"2021-03-23T18:41:39","date_gmt":"2021-03-24T01:41:39","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15186"},"modified":"2021-03-23T18:41:39","modified_gmt":"2021-03-24T01:41:39","slug":"small-business-insurance-considerations","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/small-business-insurance-considerations\/","title":{"rendered":"5 Things to Consider When It Comes to Small Business Insurance"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">No matter what business you operate, your company’s daily existence is subject to numerous risks and liabilities. Small business insurance helps small businesses mitigate some of those risks and keep a <\/span><a href=\"https:\/\/fundbox.com\/blog\/business-growth-on-budget\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">business growing<\/span><\/a><span style=\"font-weight: 400;\"> when unforeseen events can put your company’s survival in peril. Here are five things to consider when it comes to shopping for insurance.<\/span><\/p>\n<h2>1. What Types of Small Business Insurance Do I Need?<\/h2>\n<p><span style=\"font-weight: 400;\">The federal government requires every business with employees to have workers’ compensation, unemployment, and disability insurance. Unemployment insurance (UI) is a federally guided program administered and operated by the state. Each state determines its own UI rate, and employers are required to contribute a percentage of employee wages to the state’s UI fund. Many states also have a disability insurance fund that employers are expected to contribute to. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">After those three main business insurance requirements, the types of insurance you need are based on your industry, the kind of work performed, your physical location, property and equipment, employees and customers, and intellectual property. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The costs vary depending on several factors, including the type of business you own. Likewise, the cost of insurance premiums depends on the same factors. Most small business insurance policies fall into the following categories:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>General liability insurance. <\/b><span style=\"font-weight: 400;\">Covers financial loss due to property damage, bodily injury, medical expenses, court costs associated with defending lawsuits, libel, slander, and judgments.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Product liability insurance<\/b><span style=\"font-weight: 400;\">. Important for manufacturers, wholesalers, retailers, and distributors of products that may cause harm due to product defects.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Professional liability insurance<\/b><span style=\"font-weight: 400;\">. Also called “Errors and Omissions” insurance, this policy covers financial loss due to malpractice, errors, and negligence.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Commercial property insurance<\/b><span style=\"font-weight: 400;\">. Important to cover property and physical assets in case of damage due to a variety of events—from fire to vandalism.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Business owner’s policy (BOP)<\/b><span style=\"font-weight: 400;\">. As a small business owner, you may be able to bundle a general liability policy with a commercial property insurance. A BOP can save your business the cost of having to pay for two different policies.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Other important policies to consider include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Home-based business insurance.<\/b><span style=\"font-weight: 400;\"> Typically, it can be added to the homeowner’s insurance policy to cover business equipment and liability for third-party injuries.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Key person insurance.<\/b><span style=\"font-weight: 400;\"> Especially important for very small businesses where every person working is crucial to the survival of the company. It covers the costs required to carry on or fold the business in case of a key person’s (employee or owner) death.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Check with your broker or trade industry for the insurance policies recommended for your specific type of business. Policies like liquor liability insurance for businesses that serve alcohol and pesticide insurance for landscapers are crucial to protect businesses from damaging lawsuits.<\/span><\/p>\n<h2>2. Cyber Liability Insurance<\/h2>\n<p><span style=\"font-weight: 400;\">Even though you have security precautions in place to make sure your company’s data is protected, you still don’t feel safe. Good, that’s how you should feel. In 2020 alone, over 155.8 million Americans were affected by <\/span><a href=\"https:\/\/www.statista.com\/statistics\/273550\/data-breaches-recorded-in-the-united-states-by-number-of-breaches-and-records-exposed\/\"><span style=\"font-weight: 400;\">data exposures<\/span><\/a><span style=\"font-weight: 400;\">. Most breaches occur due to human error, but nevertheless, investing in cyber liability insurance is a good idea. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">What is cyber liability insurance? Cyber liability insurance covers the costs when your company needs to recover from a data breach, virus, or cyberattack. The policy also covers costs associated with legal claims resulting from the breach. If your business collects and stores sensitive data in the cloud or on electronic devices, you should seriously consider buying cyber liability insurance. And, if your business operations are disrupted due to a data security breach, cyber liability insurance can be crucial to your recovery. <\/span><\/p>\n<h2>3. The Importance of Business Interruption Insurance<\/h2>\n<p><span style=\"font-weight: 400;\">Most businesses have a plan for disasters, such as fire and power outages or (depending on where you live) natural disasters such as tornadoes, hurricanes or earthquakes. Still, it’s a good bet very few business owners were prepared for a global pandemic. Unfortunately, no matter what kind of disaster it is, they generally impact small businesses more than larger ones that often have the financial resources to bounce back. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In fact, according to the <\/span><a href=\"https:\/\/www.investopedia.com\/best-business-interruption-insurance-5075023#citation\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Federal Emergency Management Agency<\/span><\/a><span style=\"font-weight: 400;\">, between 40% and 60% of small businesses affected by a disaster never reopen. And although business interruption insurance could prevent some of these closures, very few small businesses carry it. According to the Insurance Information Institute, business interruption insurance (or business income insurance) covers the operating costs of a business due to a temporary shutdown. Of course, the reasons for the temporary shutdown must be listed in the policy, but for most disasters, the payout could be the lifeline needed to survive.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Business interruption policies are typically used by small to mid-sized businesses and include property, liability, and business income coverage. Covered disasters may include damages from fire, wind, falling objects, lightning, and even civil unrest. Don’t assume anything when looking for a policy. Natural disasters or something as rare as worldwide contagious illnesses may not be covered without an additional charge.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The cost of business interruption insurance varies by industry, property value, and company revenues—obviously the more you have to lose, the higher the cost. However, the security in knowing your business can survive when the universe throws you a curveball may be well worth the price.<\/span><\/p>\n<h2>4. Employer Insurance Considerations<\/h2>\n<p><span style=\"font-weight: 400;\">If you have employees, you need to know if and how the Affordable Care Act mandate affects your small business insurance obligations. In general, the Affordable Care Act (ACA) applies to employers with 50 or more full-time employees. Employers in this category must offer “affordable” health insurance, which means employees should not be spending more than <\/span><a href=\"https:\/\/www.healthcare.gov\/glossary\/affordable-coverage\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">9.83% of their household income<\/span><\/a><span style=\"font-weight: 400;\"> on coverage. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Even if your business has fewer than 50 employees, offering health insurance to employees makes your company more attractive to prospective talent. For current workers, a health care benefit helps retain talent, reduce absenteeism, boost employee satisfaction, and benefits your business with tax incentives.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Worried about affording health insurance? Legally, you have the option to offer health insurance to only certain employees, as long as your policy is not discriminatory. For example, you could provide health insurance only to full-time employees. Typically, small business health insurance options fall under one of the following:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Individual Coverage HRA (ICHRA):<\/b><span style=\"font-weight: 400;\"> The ICHRA is an account-based health plan allowing the employer to provide non-taxed reimbursements to employees for qualified medical expenses, including monthly premiums, copayments, and deductibles. Employees must enroll in their own health insurance coverage before they can be reimbursed. The ICHRA is open to businesses of any size; however, only employees are eligible, not self-employed.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Qualified small employer HRA (QSEHRA):<\/b><span style=\"font-weight: 400;\"> The QSEHRA is similar to the ICHRA. However, QSEHRA is only available to employers with less than 50 employees, and there are caps on the annual reimbursement limits. Employees must be enrolled in their own insurance coverage, or they can be covered under a spouse’s insurance plan and can still receive reimbursements tax-free.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Group coverage HRAs:<\/b><span style=\"font-weight: 400;\"> HRAs are an employer-funded medical reimbursement plan. Employers fund the HRA to offset the high-deductible health plan offered by the company. The business provides workers a monthly allowance of tax-free money (in addition to the group policy) to pay for employees’ out-of-pocket medical expenses. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Traditional group health insurance plan:<\/b><span style=\"font-weight: 400;\"> Here the small business pays the employees’ premiums or passes along part of the premium payment to the employee. Employees are then responsible for the copays and deductibles.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Self-funded health insurance:<\/b><span style=\"font-weight: 400;\"> Instead of paying a specific insurance company, the small business pays for each employee’s out-of-pocket expenses as they occur and the business contracts with a third-party administrator to set up a trust account funded by the business and the employee.<\/span><\/li>\n<\/ul>\n<h2>5. Review carefully<\/h2>\n<p><span style=\"font-weight: 400;\">Finally, your business is not the same as it was a year ago, so your business insurance policies shouldn’t remain the same either. Like the forgotten <\/span><a href=\"https:\/\/fundbox.com\/blog\/create-a-business-plan\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">business plan<\/span><\/a><span style=\"font-weight: 400;\"> stuffed in a file, many small business owners forget to review their policies and don’t find out they’re missing an important aspect until it’s too late. You should immediately review your policies for things you need to add and also for coverage you’re paying for that you no longer need. Are employees working remotely, so there’s less need for on premise protections? Have you purchased new equipment and forgotten to cover it? Have you expanded or shrunk the types of products or services you sell? All of these factors could impact the amount and types of small business insurance you need. Be vigilant and stay on top of the details in your small business insurance policies to give you peace of mind and save your business. <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>No matter what business you operate, your company’s daily existence is subject to numerous risks and liabilities. Small business insurance &#8230;<\/p>\n","protected":false},"author":18,"featured_media":15188,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11547],"yst_prominent_words":[3806,2584,4951,4948,866,3576,4953,2779,4947,712],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"5 Things to Consider When It Comes to Small Business Insurance | Fundbox Blog","yoast_meta":[{"name":"description","content":"Small business insurance helps small businesses mitigate some of those risks and keep a business growing when unforeseen events can put your company’s survival in peril. Here are five things to consider when it comes to shopping for insurance."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"5 Things to Consider When It Comes to Small Business Insurance | Fundbox Blog"},{"property":"og:description","content":"Small business insurance helps small businesses mitigate some of those risks and keep a business growing when unforeseen events can put your company’s survival in peril. Here are five things to consider when it comes to shopping for insurance."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/small-business-insurance-considerations\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/03\/shutterstock_1198622935.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/03\/shutterstock_1198622935.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Small business insurance helps small businesses mitigate some of those risks and keep a business growing when unforeseen events can put your company’s survival in peril. Here are five things to consider when it comes to shopping for insurance."},{"name":"twitter:title","content":"5 Things to Consider When It Comes to Small Business Insurance | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/03\/shutterstock_1198622935.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/small-business-insurance-considerations\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15186"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15186"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15186\/revisions"}],"predecessor-version":[{"id":15190,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15186\/revisions\/15190"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15188"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15186"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15186"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15186"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15186"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}