{"id":15481,"date":"2021-06-01T18:38:07","date_gmt":"2021-06-02T01:38:07","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15481"},"modified":"2022-05-12T07:25:07","modified_gmt":"2022-05-12T14:25:07","slug":"streamline-your-invoice-processing","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/streamline-your-invoice-processing\/","title":{"rendered":"How to Streamline Your Invoice Processing"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">How can I improve invoice processing? That’s the question many small business owners struggle with as they’re growing their businesses. While invoicing and <\/span><a href=\"https:\/\/fundbox.com\/blog\/when-should-you-send-your-invoices\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">getting paid<\/span><\/a><span style=\"font-weight: 400;\"> are vital to a small company’s survival, your business also needs to get a handle on invoice processing for your accounts payable system. Late payments could mean losing key vendors and receiving a lower business credit score for a small business, making it harder to secure funding.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ready to take your accounts payable invoice processing by the reins? Here are several ways to start:<\/span><\/p>\n<h2>1. Dictate the Invoice Processing Procedure<\/h2>\n<p><span style=\"font-weight: 400;\">When dealing with accounts receivables, your business is pretty much at the mercy of the clients or customers who pay you. You can request to be paid in a specific number of days and offer several payment methods, but when and how you get paid is ultimately out of your control.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">For accounts payable, in most cases, you can inform vendors about your accounts payable system and then negotiate from there. For example:<\/span><\/p>\n<ul>\n<li><b>Purchase Order<\/b><span style=\"font-weight: 400;\">. Will your business need a purchase order before the project or sale is completed? For some industries, a purchase order is standard. But, even if your business doesn’t usually receive purchase orders, in some cases, it can be a beneficial first step in the sales relationship. A purchase order contains helpful information, such as a detailed description of the order, including quantity and unit price, as well as payment terms and delivery specifics. Purchase orders help make sales more transparent for the buyer and seller, so there is a smaller chance of misunderstandings later.<\/span><\/li>\n<li><b>Method of Invoicing<\/b><span style=\"font-weight: 400;\">. How and when do you want to be invoiced? For example, do you prefer receiving invoices by mail or email or through an automated invoice processing program? Of course, the seller might have their own preferred way of invoicing, but, as the buyer, you can request invoices to suit your invoice processing.<\/span><\/li>\n<li><b>The Details.<\/b><span style=\"font-weight: 400;\"> What information do you want included on the invoice? Depending on your purchases, you may want more detail on the product or services, such as color, weight, materials for products, and date of services completed. Do you want the name of the person receiving the bill printed right on the invoice? If there is a purchase order number, that should also be included for cross-reference.<\/span><\/li>\n<li><b>Payment Terms<\/b><span style=\"font-weight: 400;\">. It’s essential to have the payment terms included on the invoice, including the due date, discount for early payments, and any potential late fees.<\/span><\/li>\n<\/ul>\n<h2>2. Streamline the Accounts Payable Process<\/h2>\n<p><span style=\"font-weight: 400;\">Whether or not your company is big enough to have an accounting department, the key to streamlining your accounts payable process is to have an official procedure and a system of checks and balances. Without either, you open up your business to costly mistakes, fraud, and possible embezzlement. Many businesses use the following accounts payable steps to streamline invoice processing.<\/span><\/p>\n<ul>\n<li><b>Never have one person in charge of accounts payable<\/b><span style=\"font-weight: 400;\">. To avoid errors and fraud, it’s a good idea to have two or three people in charge of your AP reconciliations and payments.<\/span><\/li>\n<li><b>Set up an approval system<\/b><span style=\"font-weight: 400;\">. One person receives the invoices and checks them to make sure the information is complete and correct. If there’s a purchase order, it should be checked against the invoice. Then a different person should approve the invoice and schedule the payment. In most small businesses, the owner approves the invoice, and then it goes back to the original person for scheduling. If you have enough staff, consider putting one person in charge of final approvals before the payment goes out.<\/span><\/li>\n<li><b>Get automated<\/b><span style=\"font-weight: 400;\">. The easiest way to streamline your invoice processing is to use accounting software to automate most of the processes, eliminating errors due to messy handwriting or the transposition of numbers. Look for a program that’s not only user-friendly but also one with lots of customizable reporting features that can scale as your business grows. Once you get started, you’ll find going paperless makes it easier to stay organized.<\/span><\/li>\n<li><b>Use the program features to their full extent<\/b><span style=\"font-weight: 400;\">. Accounting software systems offer a range of features, so it may take an extensive learning curve to become familiar with the system. However, it’s important to enter as much information as possible because it will save you time in the long run. For example, record as much information about the vendor as you can, including credit terms, due dates, W-9s for 1099s, etc.<\/span><\/li>\n<li><b>Train your staff<\/b><span style=\"font-weight: 400;\">. Being automated doesn’t eliminate human error, so your team should be thoroughly trained about using your invoicing program. Make sure you keep accounting information password protected and only give access to a few people.<\/span><\/li>\n<li><b>Automate some monthly payments<\/b><span style=\"font-weight: 400;\">. If you feel confident about your business’s monthly cash flow, consider automatically scheduling some regular vendor payments. Utility companies make it easy to autopay, but the information needs to be correctly entered into the system. You can cut out a lot of wasted tasks by automating some of your invoice processing.<\/span><\/li>\n<li><b>Supervise accounts aging reports<\/b><span style=\"font-weight: 400;\">. Your accounting system keeps track of what is due when so you can see, at a glance, when you’ll need to have cash on hand to pay bills. If you know you have a big payable coming up, accounts aging reports help you maintain your budget and avoid bounced checks.<\/span><\/li>\n<\/ul>\n<h2>3. Pay Your Invoices on Time<\/h2>\n<p><span style=\"font-weight: 400;\">Late or missing payments negatively affect your <\/span><a href=\"https:\/\/fundbox.com\/blog\/late-payment-credit-score\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">business credit score<\/span><\/a><span style=\"font-weight: 400;\"> more than any other factor. Plus, once your credit score takes a hit, it’s not that easy to build it up again. Vendors may look at business credit scores before deciding to do business with you and neither the vendor nor the credit company has to tell you they requested your score. According to Experian <\/span><a href=\"https:\/\/www.businesscreditfacts.com\/pdp.aspx?pg=faq-03\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">approval is not needed<\/span><\/a><span style=\"font-weight: 400;\"> from the business for someone to order their business credit report. This differs from personal credit reports which are regulated under permissible purposes only. Therefore, you may never know why your business didn’t get the job.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">By taking advantage of early payment discounts, keeping your invoice processing system current, and ensuring you have adequate cash flow, you can avoid missed or late payments. On the other hand, every business owner gets caught short at some point in the life of a business, so it’s essential to have a backup plan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Many business owners turn to factoring (also known as <\/span><a href=\"https:\/\/fundbox.com\/blog\/business-invoice-factoring\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">invoice factoring<\/span><\/a><span style=\"font-weight: 400;\">) to temporarily increase cash flow. With <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/invoice-factoring\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Invoice factoring<\/span><\/a><span style=\"font-weight: 400;\">, you sell your unpaid invoices to the factoring company, and they collect payment directly from your customers and you will likely receive 60-95% of the invoice value, not the entire amount. But using Fundbox’s invoice financing system, if approved, you work directly with your customers and get the full value of the invoice (up to your credit limit) quickly deposited into your bank account. The repayment process is easy, and there’s no prepayment penalty.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another way to stay on top of paying your bills is to have a <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/lines-credit\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">line of credit<\/span><\/a><span style=\"font-weight: 400;\"> ready to access whenever you’re short on cash. A line of credit is a preset amount of funds your business can access when you need it and pay it back later. Unlike a term loan (which has a fixed repayment), with some lenders you can pay back the line of credit in full or in payments without any early repayment fees. The best part of a line of credit is once you’ve paid back the borrowed amount, you have full access to the funds again without having to reapply for a loan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fundbox offers access to invoice financing, term loans, and lines of credit, all of which can help improve your business’s cash flow and make vendor payments on time. Cash flow is an integral part of streamlined invoice processing, so contact us today to get started.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>How can I improve invoice processing? That’s the question many small business owners struggle with as they’re growing their businesses. &#8230;<\/p>\n","protected":false},"author":18,"featured_media":15484,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,11532,677],"yst_prominent_words":[2672,2701,723,1721,1139,713,739,1142,846,1529,1694,7156,1860,2091],"post-meta-fields":{"stripe_selected":"bottom-right-curve","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"How to Streamline Your Invoice Processing | Fundbox Blog","yoast_meta":[{"name":"description","content":"Now is a good time to think about improving your small business’s invoice processing procedures before you lose vendors and damage your business credit score."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Streamline Your Invoice Processing | Fundbox Blog"},{"property":"og:description","content":"Now is a good time to think about improving your small business’s invoice processing procedures before you lose vendors and damage your business credit score."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/streamline-your-invoice-processing\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/06\/shutterstock_237051544.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/06\/shutterstock_237051544.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Now is a good time to think about improving your small business’s invoice processing procedures before you lose vendors and damage your business credit score."},{"name":"twitter:title","content":"How to Streamline Your Invoice Processing | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/06\/shutterstock_237051544.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/streamline-your-invoice-processing\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15481"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15481"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15481\/revisions"}],"predecessor-version":[{"id":15490,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15481\/revisions\/15490"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15484"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15481"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}