{"id":1549,"date":"2015-05-19T08:00:00","date_gmt":"2015-05-19T08:00:00","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=1549"},"modified":"2019-01-28T16:58:29","modified_gmt":"2019-01-29T00:58:29","slug":"5-mistakes-killing-your-business-credit","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/5-mistakes-killing-your-business-credit\/","title":{"rendered":"5 Mistakes Killing Your Business Credit History"},"content":{"rendered":"<p>Business credit history can influence your ability to get <a href=\"http:\/\/www.fundera.com\/business-loans\" target=\"_blank\">business loans<\/a>, trade credit, or even your growth potential. Are you giving your business credit the attention it deserves?<\/p>\n<p>If not, you could be killing your business credit history without even realizing it. Here are 5 business credit history mistakes you need to stop making:<\/p>\n<p><strong>1. Not Understanding How Business Credit Scores are Calculated<\/strong><br \/>\nWhile it’s easy to assume that business credit histories are similar to personal credit histories, they aren’t necessarily calculated the same way, and not understanding the differences can lead to a lower credit score than you thought.<\/p>\n<p>First, unlike personal credit, there isn’t just one main type of score. The three main leading score givers, Dun &amp; Bradstreet, Experian, and Equifax all calculate business scores differently.<\/p>\n<p>Just like your personal credit, your payment habits, number of trade experiences, outstanding balance, and credit utilization are factored in calculations, but there are more factors considered in business credit.<\/p>\n<p>Your business’s public records, such as collections, liens, judgments, and bankruptcies all factor into and hurt your business credit.<\/p>\n<p>There is also evidence that other factors, such as quick, large changes in the number of your company’s employees or sales can impact your score, as large organizational changes make your business appear riskier.<\/p>\n<p>By not understanding what goes into your business credit score, you may think your score is actually higher than it is.<\/p>\n<p><strong>2. Using Personal Credit for Your Business<\/strong><br \/>\nMany small business owners end up using personal credit for business expenses, but failing to separate the two can hurt your business credit history as well as your personal credit history.<\/p>\n<p>Using your personal credit for business loans and credit cards not only risks lowering your personal credit score if things don’t work out for your business, but you also aren’t building a credit history for your business, which makes getting funding later more difficult.<\/p>\n<p>By not building a credit history, you may be unintentionally lowering your business’s growth potential when you need to fund a large purchase, such as additional property.<\/p>\n<p>When opening a new line of credit, it’s important that you utilize your business’s information rather than your personal information when possible.<\/p>\n<p><strong>3. No Correcting Outdated, Missing or Incorrect Information<\/strong><br \/>\nNot updating or correcting your businesses information with credit bureaus can lead to confusing headaches that are more difficult to fix later when you need funding.<\/p>\n<p>They can also hurt your score. Errors and outdated information can make a business look riskier than it is, meaning that your future lending potential is limited.<\/p>\n<p>Missing data can include increases in sales figures, or even the on-time payment of bills that are not reported. When this information isn’t on your business’s credit history, your potential lenders are not getting a full picture of your business’s financial situation, meaning that you may get worse rates than your business should get.<\/p>\n<p>Check your business credit report often, just like you do for your personal credit, and update information with the credit bureaus as needed. Also, having less data can appear riskier to lenders than more data, so make sure you also look for missing data and request that it appear on the report.<\/p>\n<p><strong>4. Not Building Credit<\/strong><br \/>\nWhile it can be tempting to pay in cash to reduce interest payments on purchases, not building business credit is just as bad as being too far in debt.<\/p>\n<p>Low credit scores due to a lack of history can not only end in you being denied a loan or getting a bad interested rate, but you may also get shorter repayment periods, which can hurt your business’s cash flow.<\/p>\n<p>Try to build credit early with a small, easily repayable loan to start moving in the right direction.<\/p>\n<p>Credit card interest rates also tend to be much higher than interest rates on loans, so you may consider building a business credit history through loans instead of business credit cards.<\/p>\n<p><strong>5. Not Reading the Fine Print<\/strong><br \/>\nAssuming your business credit card will work the same as your personal credit card may mean you hurt your business credit.<\/p>\n<p>Business credit cards are not included in the Credit Card Accountability, Responsibility, and Disclosure (CARD) Act passed in 2009 to protect consumers. This means that many of the more recent policy initiatives protecting consumers of personal credit cards are not necessarily extended to business credit.<\/p>\n<p>For example, business credit cards are not protected from steep interest rate increases like personal credit cards are. Make sure you understand your business card’s interest structure to avoid nasty surprises.<\/p>\n<p>You also can’t necessarily gain the same protection just by using a personal credit card. If the company issuing your credit deems your purchases “an extension of credit primarily for a business, commercial or agricultural purposes,” they can take steps to make your personal card exempt from those protections and revoke consumer card rewards.<\/p>\n<p>Your business’s credit history is vitally important to the future growth and success of your business, so stop making these silly mistakes and ensure you have a healthy business credit history.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Business credit history can influence your ability to get business loans, trade credit, or even your growth potential. Are you &#8230;<\/p>\n","protected":false},"author":19,"featured_media":3150,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11547],"yst_prominent_words":[4899,4894,1721,1135,4892,4898,724,789,4900,3065,1142,3069,4896,4893,997,1693,2480,4897,4895,2492],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"5 Mistakes Killing Your Business Credit History","yoast_meta":[{"name":"description","content":"You could be killing your business credit history without even realizing it. Here are 5 business credit history mistakes you need to stop making:"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"5 Mistakes Killing Your Business Credit History"},{"property":"og:description","content":"You could be killing your business credit history without even realizing it. Here are 5 business credit history mistakes you need to stop making:"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/5-mistakes-killing-your-business-credit\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/05\/shutterstock_320467925.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/05\/shutterstock_320467925.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"You could be killing your business credit history without even realizing it. Here are 5 business credit history mistakes you need to stop making:"},{"name":"twitter:title","content":"5 Mistakes Killing Your Business Credit History"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/05\/shutterstock_320467925.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/5-mistakes-killing-your-business-credit\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1549"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/19"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=1549"}],"version-history":[{"count":1,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1549\/revisions"}],"predecessor-version":[{"id":2506,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1549\/revisions\/2506"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/3150"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=1549"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=1549"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=1549"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=1549"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}