{"id":15514,"date":"2022-04-05T11:31:09","date_gmt":"2022-04-05T18:31:09","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15514"},"modified":"2022-05-10T09:50:43","modified_gmt":"2022-05-10T16:50:43","slug":"business-expenses-taxes","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/business-expenses-taxes\/","title":{"rendered":"Small Business Tax Guide on Business Expenses"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">With this year’s tax deadline quickly approaching, small businesses need to get their documents and records in order to make sure they’re not paying more taxes than they need to. Understanding what business expenses are deductible can help you save money and make it easier to take advantage of deductions going forward. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s a quick look at the business expenses that are deductible for tax year 2021, what’s not deductible, and some tips on how to track your business expenses more effectively.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What are tax-deductible business expenses?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The Internal Revenue Service (IRS) makes it relatively easy to determine what is and isn’t a deductible business expense. The key is maintaining good records to keep everything organized accordingly. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Deductible business expenses must be “ordinary” and “necessary.” The IRS defines an ordinary business expense as one that is “common and accepted in your trade or business” and a necessary expense as one that is “helpful and appropriate for your trade or business.” The tax agency further points out that the expense does not need to be indispensable to be considered necessary.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some examples of business expenses include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Fees for professional services (accounting, legal, consulting)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Advertising, promotion, and marketing expenses<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Bank charges, dues, and subscriptions<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https:\/\/fundbox.com\/blog\/fixed-expenses\/\"><span style=\"font-weight: 400;\">Fixed expenses<\/span><\/a><span style=\"font-weight: 400;\"> (rent, insurance, property taxes, employee commissions, and salaries)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Internet costs (web hosting, web design, domain names, WiFi)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Employee education<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Licenses and permits<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Maintenance and repairs<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Office costs, utilities, postage, and supplies<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Office security<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Cybersecurity<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Communications systems<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Car mileage (56 cents a mile for 2021, increasing to 58.5 cents for the 2022 tax year)<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Business travel expenses for the owner or employees<\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Is a business line of credit tax deductible? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">One of the benefits of taking on debt in your business is that this capital is not considered taxable income. For example, if you have a $100,000 line of credit, neither the full amount nor the balance you use is considered business income. The same applies to business loans. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While you cannot deduct your repayment installments as a business expense, you can claim the interest you have paid on the line of credit. However, the interest you’ve paid is only deductible if you have a record of making business purchases with those funds. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Say you pay 10 percent interest monthly on your business line of credit. If you make a $5,000 personal car repair purchase with the line of credit and carry the balance for one month, for example, you cannot claim the $500 in interest you paid on that balance. This is why it’s crucial to keep your business and personal expenses separate. If the car in question can be listed as a business expense — it qualifies as an ordinary or necessary expense related to running your business — then you can deduct the $500. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additionally, if you use the line of credit to make an equipment purchase (a capital expense: costs that are part of your investment in the business), you can <\/span><a href=\"https:\/\/www.investopedia.com\/ask\/answers\/013015\/what-best-method-calculating-depreciation-tax-reporting-purposes.asp\"><span style=\"font-weight: 400;\">deduct depreciation costs.<\/span><\/a><span style=\"font-weight: 400;\"> Repairs are typically considered deductible business expenses.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Be sure to keep track of what you pay for with your business line of credit so you can maintain a record of which expenses are regular business expenses and which are considered capital expenses. Capital expenses are not tax deductible. If you’re just starting your business, many of your startup expenses are considered capital expenses. We’ll talk about capital expenses in more detail in the next section. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Business expenses that are not tax deductible <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Keep in mind that not every expense associated with doing business is fully tax deductible. Nondeductible expenses can include expenses used to cover the cost of goods sold, capital expenses, and personal expenses. <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Cost of Goods Sold (COGS)<\/b><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">If you manufacture products or purchase products for resale, part of running your business will be covering the cost of producing or buying those products. COGS include expenses like the cost of raw materials, including shipping costs, storage, cost of labor to manufacture the product, and factory overhead costs. COGS do not apply if you run a service-based business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As long as your business only has average <\/span><a href=\"https:\/\/www.patriotsoftware.com\/blog\/accounting\/what-are-gross-receipts\/\"><span style=\"font-weight: 400;\">annual gross receipts<\/span><\/a><span style=\"font-weight: 400;\"> (your total revenue) of $26 million or less for the three prior tax years, you are considered a small business taxpayer by the IRS and your COGS are in fact deductible from your gross receipts. This applies to sole proprietorships and single-member LLCs who use Schedule C. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When you are preparing your taxes, you need to separate your COGS-related expenses from other business expenses. These are two different sections of your tax forms. You cannot list COGS-related expenses again as a deductible business expense.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whether your business manufactures products or buys them for resale, the costs associated with this process are not considered deductible business expenses. Instead, the materials, transportation, storage, and labor costs involved are deducted from business income and accounted for separately from deductible expenses. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">For sole proprietors and single-member LLC owners, COGS is accounted for in the <\/span><a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/p334.pdf\"><span style=\"font-weight: 400;\">income section of your Schedule C<\/span><\/a><span style=\"font-weight: 400;\"> (Form 1040). Partnerships and multiple-member LLCs use partnership tax Form 1065. For corporations and <\/span><a href=\"https:\/\/fundbox.com\/blog\/preparing-s-corp-deadline\/\"><span style=\"font-weight: 400;\">S Corps<\/span><\/a><span style=\"font-weight: 400;\">, COGS is included in your corporate tax returns, Form 1120 or Form 1120-S under the income section.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Capital expenses <\/b><b><br \/>\n<\/b><span style=\"font-weight: 400;\">A capital expense is an expense your business incurs for the company’s future benefit instead of an operating cost needed for daily operations. Examples of capital expenses include fixed assets such as equipment, vehicles, property, and franchise rights. Improvements to assets are also capital expenses (for example, renovating an office space). The costs associated with starting your business are considered capital expenses as well. You can capitalize both the direct and indirect costs of these expenses. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">If your company doesn’t qualify as a small business in the eyes of the IRS, COGS are also considered a capital expense. You must capitalize the direct costs and part of the indirect costs associated with COGS. Indirect costs can include rent, interest, taxes, storage, and administrative costs. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">While you cannot deduct a capital expense, you can recover some of the costs through deducting depreciation, amortization, or depletion. <\/span><span style=\"font-weight: 400;\"><\/p>\n<p><\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Personal expenses<\/b> <span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">What you spend on your family and home life is not deductible as business expenses, which is why it’s so important to <\/span><a href=\"https:\/\/fundbox.com\/blog\/dont-mix-business-personal-finances\/\"><span style=\"font-weight: 400;\">keep business and personal finances separate.<\/span><\/a> <span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">Even if you work from home, you can only deduct a percentage of the costs that overlap between your personal use and business operations. For example, while monthly internet costs are considered an ordinary and necessary business expense in an office, the cost of the internet at home is likely a shared business and personal expense. <\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">In this case, you’ll need to calculate what percentage of the time you’re using the internet for business versus your personal usage and calculate the cost accordingly to deduct it as a business expense.<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\">If you pick up gigs to make extra income, the IRS also has a specific microsite for <\/span><a href=\"https:\/\/www.irs.gov\/businesses\/gig-economy-tax-center\"><span style=\"font-weight: 400;\">Gig Economy entrepreneurs<\/span><\/a><span style=\"font-weight: 400;\"> with tax guidance for those with side-hustles like selling goods online, driving a car for food delivery, or providing contract-based creative services.<\/span><span style=\"font-weight: 400;\"> <\/span><\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Some previously deductible business expenses are no longer deductible. You can no longer deduct employee transportation benefits you might provide to subsidize commuting costs, transit pass costs, or parking costs. You’re also unable to deduct business entertainment costs that do not include food and beverages. If entertainment includes food and drinks, you can deduct half of the cost of the meal. If the receipt for the cost of entertainment and meal does not separate the charges, the IRS considers the entire cost entertainment, and none of it is deductible.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">How to track business expenses more effectively <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Staying on top of business expenses is at the core of every successful business operation. Recording and regularly reviewing your company’s expenses helps you identify excessive expenditures, cut costs, and be better prepared when tax deadlines roll around. Try these tips to get your business expenses under control:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Get tech-savvy. <\/b><span style=\"font-weight: 400;\">Investing in accounting software and leveraging it to its full capacity can make managing your business expenses less overwhelming. Many software products offer features that are tailor-made for small business owners. The best accounting programs are customizable to your needs, provide excellent customer support, feature helpful apps and integrations that enable automation, and are cloud-based, so you can update expense information no matter where you are.<\/span><span style=\"font-weight: 400;\">\n<p><\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Create detailed records right away. <\/b><span style=\"font-weight: 400;\">Avoid the headache of trying to track down expenses you made months ago by getting in the habit of recording detailed, consistent records of your expenses when they happen. Keep this information all in one place, preferably your accounting software. Each expense should be recorded with notes, such as “Freelance service, web design” or “Utilities, cell phone” and categorized accordingly. <\/span><span style=\"font-weight: 400;\">\n<p><\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Separate business and personal expenses.<\/b><span style=\"font-weight: 400;\"> Carefully separate your records and maintain different bank accounts to cut down on any possible co-mingling of business and personal expenses. <\/span><span style=\"font-weight: 400;\">Avoid using personal loans<\/span><span style=\"font-weight: 400;\">, lines of credit, and credit cards to cover business expenses. When you are filing your taxes, having business and personal expenses separated ahead of time will save you time and stress. <\/span><span style=\"font-weight: 400;\">\n<p><\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Save receipts.<\/b><span style=\"font-weight: 400;\"> Whether the receipts are paper or digital, set aside a place to keep a copy of all your receipts. Make this a routine that goes along with fully and accurately recording each expense. You never know when your business may be audited. <\/span><span style=\"font-weight: 400;\">\n<p><\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Use business credit cards.<\/b><span style=\"font-weight: 400;\"> Using <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/best-business-credit-card\/\"><span style=\"font-weight: 400;\">business credit cards<\/span><\/a><span style=\"font-weight: 400;\"> could build your business’s credit score, but also streamlines your record keeping since business credit card companies break down spending by category on your statements and usually provide a year-end summary. You can also have your statements directly downloaded into your accounting program.<\/span><span style=\"font-weight: 400;\">\n<p><\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Create a plan for employee reimbursements.<\/b><span style=\"font-weight: 400;\"> In some states, such as California and Illinois, businesses are required to reimburse their employees for work expenses like tools, supplies, and travel expenses. To legally reimburse employees, your business needs to create an <\/span><a href=\"https:\/\/justworks.com\/blog\/expenses-101-expense-reimbursements-taxable-income\"><span style=\"font-weight: 400;\">accountable plan.<\/span><\/a><span style=\"font-weight: 400;\"> You can deduct the reimbursements as expenses as long as you have an accountable plan that adheres to IRS regulations about what is reimbursement and what is considered <\/span><a href=\"https:\/\/www.irs.gov\/pub\/irs-prior\/p15--2022.pdf\"><span style=\"font-weight: 400;\">taxable wages or income for your employees. <\/span><\/a><span style=\"font-weight: 400;\">An accountable plan will help you keep track of all your employee reimbursements and the documents associated, like receipts for meals, airplane tickets, and hotels. <\/span><\/li>\n<\/ol>\n<h2><span style=\"font-weight: 400;\">New tax credit<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In 2021, as part of the American Rescue Plan, small businesses could claim refundable tax credits that reimburse them for any time off they granted employees to recover from COVID-19, receive or recover from COVID-19 vaccinations, or manage family issues related to COVID-19. This program was effective until September 30, 2021. If you haven’t already claimed this credit on your quarterly federal tax return, you can do so when filing your 2021 return. There’s more information available about this credit <\/span><a href=\"https:\/\/www.irs.gov\/newsroom\/tax-credits-for-paid-leave-under-the-american-rescue-plan-act-of-2021-for-leave-after-march-31-2021\"><span style=\"font-weight: 400;\">on the IRS website.<\/span><\/a><\/p>\n<p><span style=\"font-weight: 400;\">Doing your taxes as a small business owner can feel overwhelming. Staying on top of your expenses on an ongoing basis and looking into the IRS regulations that pertain to your business well ahead of time can help you manage the process with confidence. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">Fundbox and its affiliates do not provide tax, legal, or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal, or accounting advice. You should consult your own tax, legal, and accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>With this year’s tax deadline quickly approaching, small businesses need to get their documents and records in order to make &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15830,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232],"yst_prominent_words":[2932,3656,3363,1706,3836,7899,3992,740,1529,8027,3259,3367,3366],"post-meta-fields":{"stripe_selected":"","preview_color":"yellow","bw_feature":"yes","category_color":null},"yoast_title":"Small Business Tax Guide on Business Expenses | Fundbox Blog","yoast_meta":[{"name":"description","content":"With this year’s tax deadline quickly approaching, small businesses need to get their documents and records in order to make sure they’re not paying more taxes than they need to."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Small Business Tax Guide on Business Expenses | Fundbox Blog"},{"property":"og:description","content":"With this year’s tax deadline quickly approaching, small businesses need to get their documents and records in order to make sure they’re not paying more taxes than they need to."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/business-expenses-taxes\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Man-Crossing-Arm-Looking-Forward.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Man-Crossing-Arm-Looking-Forward.jpg"},{"property":"og:image:width","content":"1140"},{"property":"og:image:height","content":"707"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"With this year’s tax deadline quickly approaching, small businesses need to get their documents and records in order to make sure they’re not paying more taxes than they need to."},{"name":"twitter:title","content":"Small Business Tax Guide on Business Expenses | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Man-Crossing-Arm-Looking-Forward.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/business-expenses-taxes\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15514"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15514"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15514\/revisions"}],"predecessor-version":[{"id":15862,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15514\/revisions\/15862"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15830"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15514"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15514"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15514"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15514"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}