{"id":15550,"date":"2021-07-02T07:06:47","date_gmt":"2021-07-02T14:06:47","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15550"},"modified":"2021-07-06T00:23:04","modified_gmt":"2021-07-06T07:23:04","slug":"how-to-cut-expenses","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/how-to-cut-expenses\/","title":{"rendered":"How to Know Where to Cut Expenses When Needed"},"content":{"rendered":"<p>Are you wondering how to save money and keep your business as profitable as possible? You’re not alone, especially after the curveball we faced in 2020. Where should you start? While there are a variety of ways to cut expenses, you’ll need to find the right places to make cuts for your unique business. Here’s a guide to help you learn more about your options and how to get started.<\/p>\n<h2>What does it mean to cut expenses?<\/h2>\n<p>When you want to cut business expenses, it means you want to reduce the amount of money you are spending. For example, if you make $15,000 per month but spend $5,000, you may want to reduce the $5,000 in expenses so you can increase your profit margin. You can do so by completely cutting out something you regularly purchase or by reducing the amount you pay for it.<\/p>\n<p><strong><em>Learn more about how cutting costs and other steps can help you <a href=\"https:\/\/fundbox.com\/blog\/business-growth-on-budget\/\" target=\"_blank\" rel=\"noopener noreferrer\">grow your business on a budget<\/a>. <\/em><\/strong><\/p>\n<h2>How to know where to cut expenses when needed<\/h2>\n<p>If your business is struggling to stay afloat, or if you would just like to maximize your profit margin, it’s probably a good idea to audit your expenses. Here’s how to start.<\/p>\n<h3>Prioritize expenses<\/h3>\n<p>First, you’ll need to take inventory of all of your expenses. Ask your accountant to send you an expense report for the past 90 days (or pull it up in your reporting system). Organize your expenses by type (travel, inventory, payroll, bills, etc.). Then, identify which expenses are critical, helpful but not required, and nice but not necessary.<\/p>\n<h3>Identify negotiables<\/h3>\n<p>From there, identify which of the expenses are negotiable. For example, if you have a business phone plan that you need for your employees, you could contact the service provider and ask if there are any promotional plan offerings. You likely have more negotiable expenses than you think such as rent, internet services, merchant account provider fees, vendor prices, insurance premiums, and more.<\/p>\n<h3>Make cuts accordingly<\/h3>\n<p>Negotiate down all of the expenses you can. Then, go through and analyze which of the non-critical expenses you can cut out or reduce. Continue to make cuts until you reach your target expense amount. If you are finding you have a foggy view of your business financials, check out this resource to easily create a <a href=\"https:\/\/fundbox.com\/blog\/7-free-small-business-budget-templates\/\" target=\"_blank\" rel=\"noopener noreferrer\">business budget with free templates<\/a>.<\/p>\n<h2>Where can I cut costs for my business?<\/h2>\n<p>Below you’ll find some of the top ways to cut expenses for your business along with money-saving tips.<\/p>\n<h3>Hiring<\/h3>\n<p>Finding new employees and onboarding them can be a time-consuming and expensive process. When it comes time to audit costs, many look to hiring as an area to cut back. How can you save? Here are a few ideas:<\/p>\n<ul>\n<li aria-level=\"1\">Double down on an employee referral program<\/li>\n<li aria-level=\"1\">Conduct group virtual interviews to save time<\/li>\n<li aria-level=\"1\">Implement extensive phone screenings<\/li>\n<li aria-level=\"1\">Implement pre-qualifications assessments<\/li>\n<li aria-level=\"1\">Write compelling job postings<\/li>\n<li aria-level=\"1\">Brainstorm how to improve employee retention to reduce the need to hire<\/li>\n<li aria-level=\"1\">Streamline your hiring process with technology like an applicant tracking system<\/li>\n<li aria-level=\"1\">Post your jobs on free platforms like Indeed, Google for Jobs, Hubstaff Talent, and on social media platforms (particularly LinkedIn)<\/li>\n<li aria-level=\"1\">Temporarily pause hiring<\/li>\n<\/ul>\n<p>All of these can help you chip away at the potentially high costs of hiring.<\/p>\n<h3>Marketing and advertising<\/h3>\n<p>The <a href=\"https:\/\/www.sba.gov\/taxonomy\/term\/15051?page=37\" target=\"_blank\" rel=\"noopener noreferrer\">U.S. Small Business Administration<\/a> recommends that you spend 7% to 8% of your budget on marketing if you have revenues of $5 million or less. You could split those expenses between raising brand awareness and promoting your business through advertising, events, or other marketing initiatives. While these expenses are often essential to the success of your business, audit your spending to see what’s working and where you can make cuts.<\/p>\n<p>In crunch times, you’ll want to focus on the channels and strategies that are providing the best results while pulling away from those that aren’t. <em><a href=\"https:\/\/www.entrepreneur.com\/article\/324658\" target=\"_blank\" rel=\"noopener noreferrer\">Entrepreneur<\/a><\/em> suggests ideas such as improving your customer targeting, reducing your active channels, utilizing marketing automation tools, repurposing older content, and considering shifting to a remote team.<\/p>\n<h3>Business travel<\/h3>\n<p>While the pandemic likely helped to reduce this cost for many businesses, life is returning to normal, which means business travel will likely pick up again. Keeping tabs on these costs starts with adopting a cost-saving mindset. Ask if travel is really necessary or if it can be replaced with a virtual interaction. If travel is required, carefully plan a budget for each trip. Look for opportunities to save through business credit cards with travel perks, establishing relationships with preferred vendors, and consider placing strict limits on expenditures.<\/p>\n<h3>Team perks<\/h3>\n<p>When it comes to team perks, be careful not to damage team morale. Many employees would probably rather remain an employee with fewer perks than become an ex-employee that’s been laid off due to the company’s overspending. In tough times, review the perks you provide along with the costs and analyze which cuts would be most profitable to the bottom line while having the least negative impact on employees. You may want to ask the employees which perks are most beneficial to them and which they don’t value quite as much.<\/p>\n<h3>Current staff and payroll<\/h3>\n<p>Payroll is often the largest expense for a business so it’s important to consider it when you are looking to cut costs. While layoffs should be a last resort, you can consider other ways of reducing costs such as temporarily reducing hours, restricting overtime hours, cross-training employees, using payroll software to automate operations, and making adjustments to optimize benefits like retirement plans, health insurance, and flex spending accounts. You may even want to explore <a href=\"https:\/\/fundbox.com\/blog\/small-business-outsourcing\/\" target=\"_blank\" rel=\"noopener noreferrer\">outsourcing tasks<\/a> versus hiring full-time employees (where applicable) and offering salary reductions in exchange for a commission-based payment structure.<\/p>\n<h3>Tools and Services<\/h3>\n<p>Many companies have a laundry list of tools that add to their yearly or monthly expenses. When cutting costs, you’ll want to review all the tools and services you currently use to analyze if they are providing the highest ROI possible. In some cases, you may be able to cancel the subscription to a tool that’s not providing value or replace it with one that’s more effective. For example, payroll automation software may help  businesses <a href=\"https:\/\/www.americanpayroll.org\/\">reduce payroll costs by up to 80%<\/a>, according to the American Payroll Association. Ensure you have the tools you need, and cancel the tools that are no longer serving you.<\/p>\n<h2>What are the biggest costs for a business?<\/h2>\n<p>In most cases, the biggest business costs come from payroll or human labor, which can account for as much as 70% <a href=\"https:\/\/www.paycor.com\/resource-center\/articles\/the-biggest-cost-of-doing-business-a-closer-look-at-labor-costs\/\" target=\"_blank\" rel=\"noopener noreferrer\">of business budgets<\/a>. Included in this category of costs are employee wages, payroll, benefits, and related taxes. Other leading costs for businesses come from overpaying for insurance, overpaying on taxes, and excessive advertising.<\/p>\n<h3>How do you cut expenses drastically?<\/h3>\n<p>To cut expenses drastically,  consider taking a more aggressive approach. This can include only spending money on the line items that are absolutely critical to the continuing operation of your business. Often this requires reducing the largest expenses, which could include payroll. You may need to reduce hours, benefit plans, salaries (including your own), and even, unfortunately, the size of your staff.<\/p>\n<h3>Optimize your budget and grow your business<\/h3>\n<p>The main concept to remember when trying to cut costs is the importance of auditing all of your expenses to ensure you are making the most of every penny you spend. If it’s not essential or not providing ROI, consider cutting it . Sure, making cuts to your budget isn’t fun or easy, but it can give your business the margin it needs to stay afloat and perhaps even grow. In the end, it could benefit you, your employees, and all of your customers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you wondering how to save money and keep your business as profitable as possible? You’re not alone, especially after &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15553,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11532,11547],"yst_prominent_words":[844,723,3941,3836,4435,866,740,1510,742,4258,1668,4050],"post-meta-fields":{"stripe_selected":"bottom-left-curve","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"How to Know Where to Cut Expenses When Needed | Fundbox Blog","yoast_meta":[{"name":"description","content":"While there are a variety of ways to cut expenses, you’ll need to find the right places to make cuts for your unique business. Here’s a guide to help you learn more about your options and how to get started."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Know Where to Cut Expenses When Needed | Fundbox Blog"},{"property":"og:description","content":"While there are a variety of ways to cut expenses, you’ll need to find the right places to make cuts for your unique business. Here’s a guide to help you learn more about your options and how to get started."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/how-to-cut-expenses\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/07\/shutterstock_1983930794.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/07\/shutterstock_1983930794.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"While there are a variety of ways to cut expenses, you’ll need to find the right places to make cuts for your unique business. Here’s a guide to help you learn more about your options and how to get started."},{"name":"twitter:title","content":"How to Know Where to Cut Expenses When Needed | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/07\/shutterstock_1983930794.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/how-to-cut-expenses\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15550"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15550"}],"version-history":[{"count":2,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15550\/revisions"}],"predecessor-version":[{"id":15552,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15550\/revisions\/15552"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15553"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15550"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15550"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15550"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15550"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}