{"id":15607,"date":"2021-09-23T17:51:13","date_gmt":"2021-09-24T00:51:13","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15607"},"modified":"2022-06-14T12:18:25","modified_gmt":"2022-06-14T19:18:25","slug":"how-does-equipment-financing-work","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/how-does-equipment-financing-work\/","title":{"rendered":"How Does Equipment Financing Work?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">As small businesses continue to rise from the ashes of the coronavirus pandemic, all indications point to a bright future for companies that have their priorities in order. Smart investments that add value to a company are paramount to a company’s success, including revenue-building equipment financing purchases. According to the<\/span><a href=\"https:\/\/www.store.leasefoundation.org\/cvweb\/Portals\/ELFA-LEASE\/Documents\/Products\/ELFF.EconomicOutlook.2021Q2.pdf\"> <span style=\"font-weight: 400;\">Equipment Leasing and Financing Foundation<\/span><\/a><span style=\"font-weight: 400;\">, 2021’s resurgence in economic activity should make for “a banner year for equipment and software investment.”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whether you’re obtaining equipment for your startup or upgrading your growing office, it’s essential to define your equipment needs and research your<\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/equipments-loan-financing\/\"> <span style=\"font-weight: 400;\">equipment financing options<\/span><\/a><span style=\"font-weight: 400;\">. For example, do you need equipment for the short-term, such as a specific project you’re currently working on? Or do you think the technology you rely on is changing so quickly that equipment leasing is your best option to keep up affordably?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Or perhaps your needs are longer-term, and you view the equipment you need as something that adds value and has revenue-generating potential? If that’s the case, you may want to consider purchasing the machine (or machines) using equipment financing. In many cases, the investment is well worth the time and cost.<\/span><\/p>\n<h3><b>What Is Business Equipment Financing?<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Small business lenders understand the financial challenges business owners face while trying to grow their businesses. Unfortunately, not all entrepreneurs have the working capital on hand or accessible to purchase the necessary equipment to get their businesses off the ground or to grow. Buying business equipment is a large part of the costs associated with running a business, whether you are financing a machine for your cutting-edge tech company, restaurant, or small manufacturing business. And, since most business owners don’t have access to enough capital to afford these costly purchases, the need to explore financing options is paramount.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">An<\/span><a href=\"https:\/\/fundbox.com\/blog\/3-ways-to-use-equipment-loans-to-improve-your-small-business\/\"> <span style=\"font-weight: 400;\">equipment loan<\/span><\/a><span style=\"font-weight: 400;\"> allows small business owners to obtain the equipment and other machines needed without putting too much strain on the company’s cash flow. Like all small business loans, the business secures financing and then makes payments towards the loan over a predetermined period of time. How long you can finance equipment depends on the terms of the loan. Typically, equipment financing terms run from three to 10 years, although you may be able to secure longer-term loans for larger purchases. Then, once the loan is repaid, you own the equipment.<\/span><\/p>\n<h3><b>How Hard Is It to Get an Equipment Loan?<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Although all equipment financing lenders have their own qualification criteria and application process, typically, you can expect to provide:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Your business’s credit score. (Not sure if you have a business credit score? It is crucial that you check with the top three credit bureaus—Experian, Dun &amp; Bradstreet, and Equifax—to learn your score before applying for financing.)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Your personal credit score (especially if the company is new)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Number of years in business<\/span><\/li>\n<li><span style=\"font-weight: 400;\">A down payment (A down payment is not always needed, but a lender may ask for it.)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Financial statements (Income statement and balance sheet)<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Most equipment financing lenders do not approve loans for startups; however, you may be able to find some lenders willing to lend money to new businesses. These offers often come with stricter terms, a bigger down payment requirement, and higher interest rates.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Business owners may also have to provide collateral as security for repayment of the loan, although, in many cases, the equipment being purchased can be enough collateral. Therefore, if the borrower defaults on the loan, the lender assumes ownership of the equipment. In addition, the lender may require a personal guarantee from the borrower, which means the lender can also procure the borrower’s personal assets, such as their house, cars, and bank accounts.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If the lender asks you to provide a down payment, you can expect to put down between 10 to 30% of the purchase price. In some cases, the lender will finance the total cost of the equipment, again charging higher interest rates and offering tougher terms. As with most things, the devil is in the details, so it is crucial to read the fine print in the loan agreement. Get a fresh set of eyes on the documents from your attorney and accountant to make sure you are not misinterpreting anything that may put your business and personal assets at more risk than you are willing to undertake.<\/span><\/p>\n<h3><b>How Do You Finance Equipment?<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Finding a business equipment financing lender is not as hard as you think. Most banks, alternative lenders, and equipment manufacturers offer equipment financing. The Small Business Administration’s (SBA) 7(a) loan program provides guarantees for equipment financing as well. However, finding a lender with the terms you desire is another story. Qualifications vary by lender, as do the interest rates and terms. For example, Bank of America requires a company to be in business for two years under the same ownership and have at least $250,000 in revenue.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Before you start researching lenders, make sure you have the backup documentation ready to go so there is no delay in the application process. You may not be asked for all this information, but it is smart to have it handy, just in case.<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Business information: Names of owners, company address, website, social security numbers, and Federal Tax ID number. If your company is incorporated or a Limited Liability Company (LLC), you may also be asked to supply your Certificate of Good Standing (available from the Secretary of State’s office in your state).<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Equipment information: Make sure to have a detailed description of the equipment you need financed and a quote for how much it will cost.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Bank statements: Most lenders want to see your company’s cash flow for at least three months.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Business tax returns (1-3 years)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Income statement (most recent)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Balance sheet (most recent)<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Business license and\/or certifications<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Reason for purchase. The lender may ask you what the purpose of the equipment is and how you expect the equipment to help increase sales.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Extra costs associated: Try and tie down the additional maintenance costs, service contracts, storage, parts, repairs, and insurance. The service provider should be able to give you this information.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">If you need to hire a specialist to run the equipment, you should project their expected wages. The lender wants proof your company has done its due diligence before it will loan you any funds.<\/span><\/p>\n<h3><b>Benefits of Equipment Financing<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">For a small business, cash flow is everything. So, if you can obtain crucial business equipment without having to drain your bank account, it is definitely worth exploring. In addition, freeing up working capital allows your company to spend money in other parts of the business, such as hiring employees or expanding your marketing efforts. Here are some other advantages to equipment financing:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">Credit score and financial history. Usually, because the equipment can be used as collateral, the credit scores of the owners and business don’t have to be perfect. If traditional lenders like banks turn you down, look at fintech lenders like Fundbox. Fintech companies typically take on borrowers that banks will not fund.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Less paperwork and faster processing times. While bank loan applications can take weeks or even months to be processed and approved or denied, alternative lenders offering equipment financing can get you an answer relatively quickly, and the fund disbursement is faster as well.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">New business equipment is an asset on your company’s balance sheet. However, if you leased the equipment, the machine is not considered an asset because you do not own the machine.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">Tax write-offs! Business equipment owned by the business can be claimed on the business’s tax return as a depreciation write-off. Depreciation measures the value of an asset over time as its ages from wear and tear. Business equipment qualifies for the write-off if used to generate income, and the equipment’s lifespan is expected to be more than one year.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Finally, most lenders offer equipment financing whether you’re buying new or used equipment, so you are not limited in your search for equipment solutions.<\/span><\/p>\n<h3><b>Can You Afford New Equipment?<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Taking on the burden of equipment financing is a big decision and one not to be made alone. Whether you own a sole proprietorship and seek the advice of your accountant or have a board of directors you need to get approval from, it is always a good idea to evaluate any big investment loan. This evaluation process is referred to as “<\/span><a href=\"https:\/\/fundbox.com\/blog\/capital-budgeting\/\"><span style=\"font-weight: 400;\">capital budgeting<\/span><\/a><span style=\"font-weight: 400;\">” and should be undertaken when assessing if a high-cost purchase actually brings value to the company.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Just as you would not purchase new real estate without weighing all the pros and cons, the same can be said about making a costly equipment purchase. Is there a better use of the money you’re spending on the purchase? How soon after the purchase will the company see a return? What kind of impact will the equipment have on the current team running the business? Will making this investment postpone another purchase with more value?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In a nutshell, the process of capital budgeting involves the following five methods:<\/span><\/p>\n<ol>\n<li><b>Net present value (NPV).<\/b><span style=\"font-weight: 400;\"> When you determine a purchase’s NPV, you are calculating the purchase’s value over a specific time period—specifically the difference between cash inflow and outflow. If the equipment has a positive NPV, it means by obtaining the machine, the company will generate more revenue than the final cost, even after financing.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">2<\/span><b>. Internal rate of return (IRR).<\/b><span style=\"font-weight: 400;\"> The IRR can be used to compare two or more costly investments over one year. Like the NPV, this method helps compare the expected annual returns of different investments over 12 months.<\/span><\/li>\n<li><b>Profitability index.<\/b><span style=\"font-weight: 400;\"> To determine the profitability index, you divide the present value of expected future cash flows by the capital expenditure—the financed equipment. When a purchase has a profitability index over 1, it is most likely a good investment.<\/span><\/li>\n<li><b>Accounting rate of return (ARR).<\/b><span style=\"font-weight: 400;\"> The ARR compares the purchase’s expected average revenue to how much money will be invested—cash flow and specific time periods are not in the equation.<\/span><\/li>\n<li><b>Payback period<\/b><span style=\"font-weight: 400;\">. Finally, the payback period method determines how long it takes to break even on a capital investment such as equipment. For example, if a piece of equipment costs $600,000, and it will earn $200,000 a year, then the payback period is three years.<\/span><\/li>\n<\/ol>\n<h3><b>Using a Business Line of Credit <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">In addition to loans specially designated for equipment purchases, your business may want to investigate getting a business line of credit. A business line of credit is money you can access when you need it—like for purchasing business equipment. Unlike a traditional loan that has set terms of monthly payments, a business line of credit allows you to borrow only the specific amount needed and then repay only that amount. Plus, once the amount borrowed is paid back, it is available to borrow again. That is called a revolving line of credit, much like a credit card.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A business line of credit is not only a viable solution for equipment purchases, but it also comes in handy if you have other bills to pay and you are waiting for payment from clients. Also, when payroll is due, and your bank account is lacking, a business line of credit is a good backup plan to help keep your business operating. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can apply online for Fundbox Line of Credit in two simple steps. Unlike a traditional business loan application, you will not have to complete any paperwork to get started, and you can get a decision right away.<\/span><a href=\"https:\/\/app.fundbox.com\/signup\"> <span style=\"font-weight: 400;\">Contact us today<\/span><\/a><span style=\"font-weight: 400;\">!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>As small businesses continue to rise from the ashes of the coronavirus pandemic, all indications point to a bright future &#8230;<\/p>\n","protected":false},"author":18,"featured_media":15611,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[],"yst_prominent_words":[2305,723,6383,1707,1706,719,713,5689,739,1142,1961,6591,989,1803,1529,3030,712],"post-meta-fields":{"stripe_selected":"","preview_color":"yellow","bw_feature":"yes","category_color":null},"yoast_title":"How Does Equipment Financing Work? | Fundbox Blog","yoast_meta":[{"name":"description","content":"Whether you’re obtaining equipment for your startup or upgrading your growing office or construction business, it’s important to understand your equipment financing needs."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How Does Equipment Financing Work? | Fundbox Blog"},{"property":"og:description","content":"Whether you’re obtaining equipment for your startup or upgrading your growing office or construction business, it’s important to understand your equipment financing needs."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/how-does-equipment-financing-work\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/09\/Equipment-financing-blog-scaled.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/09\/Equipment-financing-blog-scaled.jpg"},{"property":"og:image:width","content":"2560"},{"property":"og:image:height","content":"1707"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Whether you’re obtaining equipment for your startup or upgrading your growing office or construction business, it’s important to understand your equipment financing needs."},{"name":"twitter:title","content":"How Does Equipment Financing Work? | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/09\/Equipment-financing-blog-scaled.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/how-does-equipment-financing-work\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15607"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15607"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15607\/revisions"}],"predecessor-version":[{"id":15665,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15607\/revisions\/15665"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15611"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15607"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15607"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15607"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15607"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}