{"id":15620,"date":"2021-10-05T15:32:45","date_gmt":"2021-10-05T22:32:45","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15620"},"modified":"2022-05-12T07:53:11","modified_gmt":"2022-05-12T14:53:11","slug":"how-flex-pay-helped-corey-lafferty-of-precision-art-design-make-it-through-a-tough-year","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/how-flex-pay-helped-corey-lafferty-of-precision-art-design-make-it-through-a-tough-year\/","title":{"rendered":"How Flex Pay Helped Corey Lafferty of Precision Art Design Make It Through a Tough Year"},"content":{"rendered":"<p>Often, it’s small business owners who feel economic turbulence more strongly than anyone else. That’s a lesson Corey Lafferty learned last year — like every entrepreneur, he was used to the ebb and flow of client work, but what COVID-19 brought on was completely unprecedented.<\/p>\n<p>Uniquely, Corey’s firm Precision Art Design handles both the creative and construction phases of the architectural process. Corey dreams up new buildings for his clients to live and work in, then actually brings them to reality, along with his skilled team of contractors. But in 2020, his firm suddenly needed to weather a near-stoppage of important, income-sustaining projects far beyond normal business ups and downs.<\/p>\n<p>“Most of my construction work last year was in condominiums,” he explains. “They all got shut down, so that brought me into a situation where I had low cash flow. Even getting paid by clients was very difficult last year.”<\/p>\n<h2 id=\"h-weathering-income-ups-and-downs\">Weathering Income Ups and Downs<\/h2>\n<p>While 2020 was an extreme example, this kind of uncertainty is a fact of life for many business owners. Businesses rely on their clients to pay their invoices consistently and on time to run their operations smoothly. When this income is inconsistent compared to fixed expenses like payroll, things can start to feel pretty tight — especially to get bills paid on time.<\/p>\n<p>Typically, business owners don’t have many payment options for these crucial, recurring costs. They’re either paid out of the business owner’s bank account or put onto a credit card. That means if a business has any concerns about cash flow, they are likely to worry about going into overdraft or hitting their limit.<\/p>\n<p>Fundbox Flex Pay is a new tool designed to give small businesses additional flexibility when making payments at no extra cost.<\/p>\n<p>Here’s how Flex Pay helped Corey’s business navigate the economic uncertainty of 2020 and provided peace of mind.<\/p>\n<h2 id=\"h-how-flex-pay-works\">How Flex Pay Works<\/h2>\n<p>Businesses with an eligible Fundbox Line of Credit (LoC) have access to a Flex Account, from which they can pay important business expenses such as payroll or vendor charges.<\/p>\n<p>For example, when a business uses its Flex Account to pay a supplier, Fundbox sends the funds directly to the recipient. The business then has three extra business days to repay the funds. Within this three-day grace period, the business can choose to pay directly from their bank account for free, and soon, by credit card for a small fee.<\/p>\n<p>However, if a business chooses not to pay back their Flex Account during the three days, a draw on their line of credit will simply be automatically created at the standard charge. If there isn’t enough available credit to cover the entire expense, Fundbox debits the difference from their primary business bank account. The benefits to business owners are many — flexibility, more payment options, and the peace of mind of knowing they’re covered.<\/p>\n<p>Flex Pay is designed to give business owners like Corey more options and the additional flexibility they can use to ride out the ebbs and flows of entrepreneurship—whether it’s unexpected economic changes like the pandemic or to take advantage of growth opportunities that come their way.<\/p>\n<blockquote><p>Right now, a lot of people are paying slowly, especially in my field,” says Corey. “When that happens, it becomes a problem because not paying my employees on time is not an option.”<\/p><\/blockquote>\n<h2 id=\"h-how-to-use-flex-pay\">How to Use Flex Pay<\/h2>\n<p>Last year, Corey found himself in a challenging situation when his condo projects stalled, but he couldn’t afford to lose the teams he had working on them.<\/p>\n<p>“They all had to work from home, and even getting invoices paid by clients was very difficult last year,” he says. “Flex Pay definitely gives me that peace of mind. I know I don’t have to worry about making that payroll pivot exactly today.”<\/p>\n<p>Like many other business owners, Corey used Flex Pay for payroll, one of his most important costs. But Flex Pay can do more than just that — it’s a powerful financial resource for businesses to use every day. This could be for inventory, insurance, leases, credit card balances, or vendor invoices.<\/p>\n<h2 id=\"h-how-flex-pay-can-help-your-business\">How Flex Pay Can Help Your Business<\/h2>\n<p>The payment options that Flex Pay offers can provide the agility needed to alleviate a lot of the stress, inconvenience, and unnecessary headaches small businesses regularly face. Expenses will be paid on time, you get three extra business days to repay Fundbox, and you have access to repayment options, like using your credit cards (coming soon). Flex Pay offers businesses peace of mind and a worry-free, fee-free, streamlined payment process.<\/p>\n<p>It certainly helped Corey when the disconnect between his business income and payroll cycle became a major source of stress in 2020. “Flex Pay was key,” he shares. “I would definitely say it was needed for this past year.”<\/p>\n<h2 id=\"h-agile-and-flexible-options\">Agile and Flexible Options<\/h2>\n<p>To thrive in today’s competitive business landscape, small business owners need options. It’s about building an arsenal of payment tools, like Flex Pay, to make running their companies as easy, fast, and stress-free as possible.<\/p>\n<p>If you already have an eligible line of credit with Fundbox, you can access your Flex Account when you log in to Fundbox on your desktop or the mobile web (not yet available in the app). Just look for the Flex Pay tab on your dashboard and try it out.<\/p>\n<p>Interested in a Fundbox Line of Credit and the Flex Pay solution? Sign up <a href=\"https:\/\/app.fundbox.com\/signup\">here<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Often, it’s small business owners who feel economic turbulence more strongly than anyone else. That’s a lesson Corey Lafferty learned &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15622,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[],"yst_prominent_words":[1165,723,719,713,739,724,2596,1529,6063,3040,7857,709],"post-meta-fields":{"stripe_selected":"circle","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How Flex Pay Helped Corey Lafferty of Precision Art Design Make It Through a Tough Year | Fundbox Blog","yoast_meta":[{"name":"description","content":"Like many other business owners, Corey used Flex Pay for payroll, one of his most important costs. But Flex Pay can do more than just that — it’s a powerful financial resource for businesses to use every day."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How Flex Pay Helped Corey Lafferty of Precision Art Design Make It Through a Tough Year | Fundbox Blog"},{"property":"og:description","content":"Like many other business owners, Corey used Flex Pay for payroll, one of his most important costs. But Flex Pay can do more than just that — it’s a powerful financial resource for businesses to use every day."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/how-flex-pay-helped-corey-lafferty-of-precision-art-design-make-it-through-a-tough-year\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/10\/Screen-Shot-2021-10-05-at-3.23.22-PM.png"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/10\/Screen-Shot-2021-10-05-at-3.23.22-PM.png"},{"property":"og:image:width","content":"1660"},{"property":"og:image:height","content":"1162"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Like many other business owners, Corey used Flex Pay for payroll, one of his most important costs. But Flex Pay can do more than just that — it’s a powerful financial resource for businesses to use every day."},{"name":"twitter:title","content":"How Flex Pay Helped Corey Lafferty of Precision Art Design Make It Through a Tough Year | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2021\/10\/Screen-Shot-2021-10-05-at-3.23.22-PM.png"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/how-flex-pay-helped-corey-lafferty-of-precision-art-design-make-it-through-a-tough-year\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15620"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15620"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15620\/revisions"}],"predecessor-version":[{"id":15624,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15620\/revisions\/15624"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15622"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15620"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15620"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15620"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}