{"id":15767,"date":"2022-02-24T07:53:53","date_gmt":"2022-02-24T15:53:53","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15767"},"modified":"2022-05-10T09:51:58","modified_gmt":"2022-05-10T16:51:58","slug":"manage-cash-flow-small-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/manage-cash-flow-small-business\/","title":{"rendered":"How to Manage Cash Flow in Your Small Business"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">If you’re in business, cash flow is a constant companion that shapes your success. Cash flow refers to the amount of cash that comes into and goes out of your business. For example, a sale is a cash inflow while paying business expenses are cash outflows. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Positive cash flow helps you run your business effectively. It allows you to pay your expenses on time and seize opportunities to expand your operations or invest resources back into your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Your <\/span><a href=\"https:\/\/fundbox.com\/blog\/cash-flow-statement\/\"><span style=\"font-weight: 400;\">cash flow statement<\/span><\/a><span style=\"font-weight: 400;\">, along with your balance sheet and income statement, is one of your business’ key financial statements, and it helps you assess the health of your business. Both investors and traditional lenders—like banks—look at your cash flow statement to make informed decisions about providing financing to your business. You can use your cash flow statement to understand how your business is doing and to make strategic choices about how to improve your income streams, minimize your expenses, and run your business better. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Understanding the three types of cash flows <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are three types of cash flows that you’ll see on your cash flow statement: cash flows from operations (CFO), cash flows from financing (CFF), and cash flows from investing (CFI). <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Cash flows from operations<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">CFO includes the cash flow inflow that comes directly from sales. This type of cash flow indicates whether you can afford your operating expenses. Your regular bills, like rent and software subscriptions, as well as payroll and inventory costs, are the cash outflows that fall under ‘operations.’<\/span><\/p>\n<p><a href=\"https:\/\/fundbox.com\/blog\/cash-flow-statement\/\"><span style=\"font-weight: 400;\">Understanding your business’ CFO<\/span><\/a><span style=\"font-weight: 400;\"> helps you run your business successfully, and sustainably, in the long run. Looking at your net income on your balance sheet is the starting point for calculating your operating cash flow: how much cash do you have available to cover your operating costs? If you aren’t making enough net income to cover your costs, it’s important to look into different ways to finance your business in the short term as you grow your sales. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Cash flows from financing <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">CFF is the net flows of cash that are used to finance your business that include debt, equity, and dividends. Understanding your CFF will help you keep track of the ways you’re leveraging financing options such as getting a loan (debt), using a line of credit (debt), or receiving investment (equity). Cash outflows here include interest payments and paying dividends to your investors. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Cash flows from investments <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">CFI is generated cash flow that is used for investments in assets or securities such as stocks and bonds. This type of cash flow is also related to investing in your business. If you’re investing heavily in business development, training, or research, it’s normal to have a negative cash flow in this category. Positive cash flow in this category happens when you make money on your investments.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Maintaining positive cash flow enables you to cover the costs of running your business. Focusing on building positive CFO and CFF allows you to generate the cash flow needed to start creating positive CFI for spending on your business’ growth and investing in strategically chosen securities as you scale your business. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Cash flow vs. profit, cash flow vs. net income<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Profit refers to the amount of money left over after certain expenses have been paid (e.g., gross profit is revenue minus the cost of goods sold). There are usually several types of profit listed on a financial statement. Calculating profit in different areas of the business allows companies to see which expenses have the biggest impact on the bottom line. Large profits do not necessarily indicate that your business has a healthy cash flow. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Net income is referred to as the bottom line and represents your revenue minus all expenses, interest, and taxes. Net income is a single number that encompasses your profits. You can use your net income to calculate cash flow in your business. Understanding your cash flow will help you assess the overall profitability of your business. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Cash flow is challenging for every business<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Cash flow determines whether your business’ doors stay open. Even well-established businesses might struggle with maintaining positive cash flow. <\/span><span style=\"font-weight: 400;\">Different factors can influence cash flow depending on your business model. Small businesses and <\/span><a href=\"https:\/\/fundbox.com\/blog\/cash-flow-for-freelancers\/\"><span style=\"font-weight: 400;\">sole proprietors, like freelancers,<\/span><\/a><span style=\"font-weight: 400;\"> often deal intimately with CFO issues such as late-paid invoices and fronting costs for supplies and inventory. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, you might be charged monthly for expenses like rent and software subscriptions, but you might struggle to ensure that your clients pay their invoices before those bills are due. The project could have generated more than enough revenue to cover those expenses, but if the invoice hasn’t been paid in advance of your bills, you’ll experience negative cash flow. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In a product-based business, the cost of goods sold (COGS) factors heavily into your CFO strategy. You’ll need to have enough capital upfront to produce the product and there’s often a gap of time between investing in the inventory and getting paid for that inventory. Managing this is an ongoing dance between your financing options. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re at a business stage where you haven’t looked at financing or investing options, CFO might be your primary cash flow focus. Looking at your CFO will help you determine what types of financing you need and whether raising outside capital will help you reach your business goals.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">How to Master Cash Flow<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">How much cash flow you need is dependent on how much it costs to run and grow your business. The first step to mastering cash flow is to understand your cash inflows and outflows: assessing what resources you have and whether you’re effectively putting those resources towards activities that generate a return on investment. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s a great idea to check on your cash flow statement on a regular basis. Typically, your cash flow needs to be reported both quarterly and annually. There are several formulas you can use to calculate cash flow, but the formula you’ll want to use to determine the profitability of your business is the <\/span><a href=\"https:\/\/www.investopedia.com\/ask\/answers\/033015\/what-formula-calculating-free-cash-flow.asp\"><span style=\"font-weight: 400;\">free cash flow (FCF)<\/span><\/a><span style=\"font-weight: 400;\">. Free cash flow reveals how much money you have left after covering your costs. That extra capital can be used to expand your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s one of the ways to calculate cash flow using the cash flow from operations listed on your cash flow statement and capital expenditures which you can find on your balance sheet: <\/span><\/p>\n<p><b><i>Free cash flow = cash flow from operations (CFO) &#8211; capital expenditures<\/i><\/b><\/p>\n<p><span style=\"font-weight: 400;\">If your business model includes invoicing clients, one of the ways you can boost your cash flow is to negotiate strict repayment terms with your clients and take the time to understand their repayment habits. Make sure that your contracts lay out payment terms clearly. If you run a product-based business, it’s important to understand your COGS as you may need to cut costs and keep an eye on the time it takes to be repaid for your investment in inventory. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Small business loans and lines of credit can help support your cash flow as you grow your business. A <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/lines-credit\/#h-how-you-could-benefit-from-a-business-line-of-credit\"><span style=\"font-weight: 400;\">line of credit<\/span><\/a><span style=\"font-weight: 400;\"> can provide you with additional working capital to help you with ongoing operational expenses like purchasing or producing extra inventory, hiring more team members, or expanding your location space. A <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/micro-loans\/\"><span style=\"font-weight: 400;\">micro-loan<\/span><\/a><span style=\"font-weight: 400;\"> can help you front the cost of major purchases and enable you to repay that balance slowly over time, making it easier to manage those cash inflows with the cash outflow of paying off the loan.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal and accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re in business, cash flow is a constant companion that shapes your success. Cash flow refers to the amount &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15833,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,11532],"yst_prominent_words":[723,895,2632,2416,1163,5687,1424,2377,7889,3367,3366],"post-meta-fields":{"stripe_selected":"","preview_color":"yellow","bw_feature":"yes","category_color":null},"yoast_title":"How to Manage Cash Flow in Your Small Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"You can use your cash flow statement to understand how your business is doing and to make strategic choices about how to improve your income streams, minimize your expenses, and run your business better. "},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Manage Cash Flow in Your Small Business | Fundbox Blog"},{"property":"og:description","content":"You can use your cash flow statement to understand how your business is doing and to make strategic choices about how to improve your income streams, minimize your expenses, and run your business better. "},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/manage-cash-flow-small-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Mechanic-Man-Wipes-Hands.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Mechanic-Man-Wipes-Hands.jpg"},{"property":"og:image:width","content":"1140"},{"property":"og:image:height","content":"706"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"You can use your cash flow statement to understand how your business is doing and to make strategic choices about how to improve your income streams, minimize your expenses, and run your business better. "},{"name":"twitter:title","content":"How to Manage Cash Flow in Your Small Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Mechanic-Man-Wipes-Hands.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/manage-cash-flow-small-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15767"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15767"}],"version-history":[{"count":1,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15767\/revisions"}],"predecessor-version":[{"id":15768,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15767\/revisions\/15768"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15833"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15767"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15767"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15767"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15767"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}