{"id":15785,"date":"2022-03-11T12:13:08","date_gmt":"2022-03-11T20:13:08","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15785"},"modified":"2022-05-10T09:52:13","modified_gmt":"2022-05-10T16:52:13","slug":"4-things-consider-consolidating-debt-small-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/4-things-consider-consolidating-debt-small-business\/","title":{"rendered":"4 Things to Consider When Consolidating Debt for Your Small Business"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Taking on business debt is an effective strategy for financing business growth. Many small businesses need to take out loans or leverage credit to fund their operations, especially when they first start out. The Small Business Administration (SBA) reports that about <\/span><a href=\"https:\/\/cdn.advocacy.sba.gov\/wp-content\/uploads\/2020\/11\/05122043\/Small-Business-FAQ-2020.pdf\"><span style=\"font-weight: 400;\">25% of small businesses<\/span><\/a><span style=\"font-weight: 400;\"> are financed by loans and credit. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you have multiple debts that you’re repaying to different accounts or institutions, you might consider business debt consolidation. Debt consolidation is the process of taking out a single loan to pay off all of your existing debts. It differs from refinancing in that you’re looking to pay off all of your separate debts at once, rather than taking out a new loan at a lower interest rate to pay off a higher-interest loan. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Consolidating your business debt can save you time, so you aren’t keeping up with different repayment schedules for multiple loans or credit balances. With a single interest rate and the right repayment terms, it can also help you save money.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">How to determine if debt consolidation is right for you<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Consolidating loans is not a magic bullet for your financial challenges. The intention is to make repaying your debt more manageable with a single payment due date, a reliable payment amount, and one interest rate. There are a few things you should think about before choosing to consolidate your business debt. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To start, calculate how much interest you’re currently paying on all of your debt. While interest is not the only factor you need to keep in mind when choosing your consolidation loan, it’s great to save yourself some money with a lower interest payment. Interest rates are dependent on your personal and business credit scores, so take that into account when you’re looking into debt consolidation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Next, figure out if your cash flow will cover your consolidated loan payments. If having multiple repayment dates with differing amounts throughout the month will help ensure that you have enough to cover your bills, it may not make sense to consolidate the loans into one payment that will prohibit you from paying for other expenses on time. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Making sure that you can afford your consolidated repayment is critical to avoid expensive late fees. Late payments can also take a toll on your credit score, preventing you from getting good interest rates on future loans. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When considering business debt consolidation, take stock of your borrowing and spending history. Review your habits and assess whether you need to implement some more effective business spending strategies. Additionally, you should not use loan consolidation to address personal debt. The primary reason for this is tax compliance. Failure to keep your personal and business expenses separate could make it difficult to get financing in the future. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">How to consolidate your business debt <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are several options for consolidating business debt, including bank loans, Small Business Administration (SBA) loans, lines of credit, and funding from online financial platforms. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Bank loans<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">While a bank loan is one of the best ways to consolidate business debt, qualifying for one can be a challenge. You often need to be in business for several years and have a great credit score. You also need to have strong, proven revenue. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you do meet the qualifications, bank loans usually offer interest rates lower than 10% and repayment terms of ten years and under with monthly payments. Be aware that banks typically charge prepayment penalties if you plan to pay your loan off early. Smaller regional banks or banks with great small business advisory programs can help guide your choices and help you determine the most beneficial ways to consolidate and repay your debt. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">SBA loan<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/sba-loans\/#h-1-sba-7a-loans\"><span style=\"font-weight: 400;\">SBA 7(a) loan<\/span><\/a><span style=\"font-weight: 400;\"> is the only SBA loan that you can use to consolidate debt. It’s a flexible funding option you can use for any type of debt. It provides a loan amount of up to $5 million, and repayment terms do not typically exceed ten years (25 years for real estate loans). The interest rate is between 5–10% and you’ll make your payments monthly. There’s no prepayment penalty for loans with repayment terms under 15 years. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are a few restrictions to be aware of with the SBA 7(a) loan option: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The purpose of the loans you want to consolidate has to be eligible under the SBA 7(a) guidelines. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The SBA 7(a) loan payment amount needs to be at least 10% less than that of your current loans. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You have to put together a written explanation for each of your current loans for why they don’t have reasonable terms.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">You can use the SBA 7(a) loan to pay off your business credit cards as part of your debt consolidation. In the wake of the pandemic, the SBA is also offering the <\/span><a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/2021-08\/COVIDEIDL_FAQs-508.pdf\"><span style=\"font-weight: 400;\">COVID-19 Economic Injury Disaster Loan (EIDL)<\/span><\/a><span style=\"font-weight: 400;\"> which enables you to cover your current regular debt or credit card payments. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Loans and lines of credit from online financial platforms<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Outside of traditional financial institutions, other lending options include online financial platforms. These lenders offer loans and lines of credit and are a great choice for businesses that do not qualify for bank or SBA loans. A big plus is online financial platforms make it easy to get a loan or line of credit approved as quickly as possible without jumping through hoops during the application process.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fundbox offers both <\/span><a href=\"https:\/\/fundbox.com\/term-loan\/\"><span style=\"font-weight: 400;\">term loans<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/fundbox.com\/get-credit\/\"><span style=\"font-weight: 400;\">lines of credit<\/span><\/a><span style=\"font-weight: 400;\"> to help you consolidate your business debt. A term loan can be repaid in installments over a 24 or 52-week plan. Lines of credit allow you to take advantage of as much or as little credit as you need with 12 or 24-week repayment plans. Interest rates vary depending on your business history and the payment term you choose. There are no origination fees or prepayment penalties. Fundbox’s structured repayment plans help you stay on track by requiring you to pay equal installments on a regular basis, ensuring that you pay off your consolidated debt as quickly as possible, without compromising your cash flow. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What to look for in a debt consolidation loan<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The first thing is to ensure you can secure a loan that covers all of the outstanding debts you’re looking to consolidate. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">As you compare loan options, make sure you’re aware of any upfront or ongoing costs of your new loan. There may be fees for late payments and paying off the loan early. Other costs could include balance transfer fees, loan origination fees, and annual fees. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Long-term loans allow you to pay your debt slowly in smaller chunks, making it easy for you to make full payments on time and promoting healthy cash flow. Keep in mind that you may end up paying more interest over time than you would with a shorter repayment period. Understand how cash flow works in your business to get the most out of your repayment terms. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Remember that low interest rates aren’t always guaranteed and that a low interest rate doesn’t indicate you’re getting a good deal. Shop around for the lowest interest rate you can find, but take into account what the lender is asking for in terms of collateral and guarantees in the case of default. Will your personal assets be on the line? You can always consider refinancing your consolidated loan in the future to take advantage of lower interest rates. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">An important point to keep in mind is how long you’re planning to take to repay your consolidated loan. A low interest rate over a longer repayment period might cost you the same as a loan with a higher interest rate you’re planning to pay off quickly. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Managing your consolidated loan<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">In many cases, maintaining positive cash flow is more important for business longevity than paying back debt as quickly as you can. If you’ve found a loan with a favorable interest rate for a long-term repayment plan, focus on making your regular payments and ensure that your remaining income can cover all of your other regular expenses. Reinvest anything above that into building your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s paramount that you make your payments on time and in full. The purpose of loan consolidation is to make your life in business easier. Regularly paying down your consolidated loan balance keeps your business healthy, improves your credit score over time, and looks great to potential investors, other lenders, or buyers––if you choose to sell your business in the future.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal, and accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n<p><i><span style=\"font-weight: 400;\">Fundbox makes capital available to businesses through business loans and lines of credit made by First Electronic Bank, a Utah chartered Industrial Bank, member FDIC, in addition to invoice-clearing advances, business loans and lines of credit made directly by Fundbox. <\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Taking on business debt is an effective strategy for financing business growth. Many small businesses need to take out loans &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15839,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,426],"yst_prominent_words":[723,1794,5490,11092,1795,1803,3368,3248,3030,3048,9262,3367,3366],"post-meta-fields":{"stripe_selected":"","preview_color":"yellow","bw_feature":"yes","category_color":null},"yoast_title":"4 Things to Consider When Consolidating Debt for Your Small Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"Debt consolidation is the process of taking out a single loan to pay off all of your existing debts. It differs from refinancing in that you’re looking to pay off all of your separate debts at once, rather than taking out a new loan at a lower interest rate to pay off a higher-interest loan. "},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"4 Things to Consider When Consolidating Debt for Your Small Business | Fundbox Blog"},{"property":"og:description","content":"Debt consolidation is the process of taking out a single loan to pay off all of your existing debts. It differs from refinancing in that you’re looking to pay off all of your separate debts at once, rather than taking out a new loan at a lower interest rate to pay off a higher-interest loan. "},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/4-things-consider-consolidating-debt-small-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Women-Taking-Notes-Using-Laptop.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Women-Taking-Notes-Using-Laptop.jpg"},{"property":"og:image:width","content":"1136"},{"property":"og:image:height","content":"707"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Debt consolidation is the process of taking out a single loan to pay off all of your existing debts. It differs from refinancing in that you’re looking to pay off all of your separate debts at once, rather than taking out a new loan at a lower interest rate to pay off a higher-interest loan. "},{"name":"twitter:title","content":"4 Things to Consider When Consolidating Debt for Your Small Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Women-Taking-Notes-Using-Laptop.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/4-things-consider-consolidating-debt-small-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15785"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15785"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15785\/revisions"}],"predecessor-version":[{"id":15841,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15785\/revisions\/15841"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15839"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15785"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15785"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15785"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15785"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}