{"id":15788,"date":"2022-03-11T12:47:21","date_gmt":"2022-03-11T20:47:21","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15788"},"modified":"2022-05-12T07:15:44","modified_gmt":"2022-05-12T14:15:44","slug":"equipment-financing-can-help-start-small-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/equipment-financing-can-help-start-small-business\/","title":{"rendered":"How Equipment Financing Can Help You Start Your Small Business"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">That old adage, “You need to spend money to make money,” applies directly to leveraging equipment financing for your small business. Whether you’re a restaurateur who needs to outfit a kitchen with commercial appliances and tools, a nail technician looking for salon chairs, or a <\/span><a href=\"https:\/\/fundbox.com\/blog\/how-to-get-equipment-financing-for-your-construction-business\/\"><span style=\"font-weight: 400;\">construction startup<\/span><\/a><span style=\"font-weight: 400;\"> acquiring heavy machinery, fronting the cost of the equipment you need to operate your business — before you have revenue — is a challenge for every entrepreneur. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, there are many <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/funding\/\"><span style=\"font-weight: 400;\">funding options <\/span><span style=\"font-weight: 400;\">to help<\/span><span style=\"font-weight: 400;\"> small businesses<\/span><\/a><span style=\"font-weight: 400;\"> meet this challenge, including commercial equipment loans, general small business loans, and credit. Traditional lenders like banks may be a good choice if you have been in business for more than two years, but for younger businesses, equipment financing companies provide opportunities to acquire the equipment you need, even if you do not  have credit history. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">New equipment can help you optimize and expand your operations. Equipment also helps you earn more revenue, which, in turn, can help you pay down the balance of your equipment loan. In short, equipment financing is the type of debt that allows you to acquire a revenue-generating asset — a strategic decision that can strengthen your business. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What is equipment financing? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Equipment financing is funding specifically designed for purchases of equipment you’ll use to operate your business. This can include anything from laptops and office furniture to vehicles and construction or farming machinery. If you do not have the working capital available to purchase more expensive types of equipment, financing can help front the cost so you can start growing your operations. <\/span><\/p>\n<h4><b>Benefits of equipment financing<\/b><b><\/b><\/h4>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Many lenders use the equipment itself as collateral. If you default on the loan, the lender will repossess the equipment to cover the loss. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">When you leverage equipment loans to buy the equipment you need outright, you may be able to claim the full price of the equipment as a deduction on your taxes under <\/span><a href=\"https:\/\/www.investopedia.com\/terms\/s\/section-179.asp\"><span style=\"font-weight: 400;\">Section 179 of the IRS tax code<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/li>\n<\/ul>\n<h3><b>Equipment leasing <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Another equipment financing option to consider is leasing, an agreement that’s similar to leasing a car, where you essentially rent the equipment you need and pay the lease provider in monthly installments. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some benefits of leasing include: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You typically do not have to provide a down payment or collateral.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You may be able to qualify for a lease even if you have a low credit score. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You may choose to renew your lease agreement when the term ends, continuing with both monthly payments and use of the equipment.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Lease-to-own programs allow you to take possession of the equipment once the initial lease is paid off. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">One of the downsides of leasing is that your equipment will not be considered a fixed asset on your financial statements and will not count towards your business’s net worth. However, <\/span><a href=\"https:\/\/www.wolterskluwer.com\/en\/expert-insights\/tax-implications-of-leasing-business-equipment\"><span style=\"font-weight: 400;\">you <\/span><span style=\"font-weight: 400;\">may be able to <\/span><span style=\"font-weight: 400;\">claim lease payments as a rent expense on your taxes. <\/span><\/a><\/p>\n<h2><span style=\"font-weight: 400;\">What you need to qualify for equipment financing<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">For new business owners, the ability to secure financing through traditional lenders can be a challenge, as most of these lenders are reluctant to take a risk on a business with no credit or established sales history. Many lenders will check your personal credit history if your business doesn’t yet have a credit history. You may also be required to provide a personal guarantee, which means that you’re responsible for repaying the debt with your own money or assets.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To qualify for equipment loans, most lenders will require you to provide information about how the equipment will help you run your business or increase profitability. Therefore, at the outset, it’s a good idea to understand how the equipment will deliver a return on investment and to have a thorough plan that outlines how you will use the loan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You will also need to know how much funding you actually need. Some lenders can offer up to $5 million, while others cap funding at $100,000 or less. Be aware that if you secure a loan for more than you’ll use, you’ll likely be charged a prepayment fee if you want to pay the remainder of the balance off earlier than the agreed-upon time frame — similar to a mortgage. Finally, it’s important to understand what type of repayment terms will work best for your business, as loan payments will affect your cash flow. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When you’re just starting out, it can seem like you need to buy everything you imagine you’ll need right away. Determining which pieces of equipment are essential can help you invest in purchases that will have the biggest impact. You can always combine loans for high-priority equipment with leasing for low-priority equipment to avoid sinking money into items you might not end up using. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Equipment financing options <\/span><\/h2>\n<h3><b>Small Business Administration (SBA) loans<\/b><\/h3>\n<p><i><span style=\"font-weight: 400;\">Accessible Option for Brand New Businesses or Growing Businesses<\/span><\/i><\/p>\n<p><a href=\"https:\/\/fundbox.com\/resources\/guides\/sba-loans\/#h-2-sba-504-loans\"><span style=\"font-weight: 400;\">SBA 504 loans<\/span><\/a><span style=\"font-weight: 400;\"> up to $5 million (with repayment terms up to 25 years) are available through Certified Development Companies (CDCs) and can be used for heavy equipment you plan to use long-term. Here are some of the key requirements for a 504 loan that you should be aware of:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You must have a tangible net worth of less than $15 million and have made under $5 million in the last two years. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You must have proof that you haven’t been able to secure funding from another source.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You must provide a personal guarantee.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The equipment itself must be used as collateral. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">A 3 percent fee will be tacked onto the value of the loan plus the interest rate.<\/span><\/li>\n<\/ul>\n<p><a href=\"https:\/\/fundbox.com\/resources\/guides\/sba-loans\/#h-1-sba-7a-loans\"><span style=\"font-weight: 400;\">SBA 7(a) loans <\/span><\/a><span style=\"font-weight: 400;\">are also a popular choice for small business financing. However, some key differences make this a less desirable option: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The 7(a) loan has a variable interest rate, while the 504 offers a fixed rate, at an increment above the current market rate for 5-year and 10-year U.S. Treasury issues.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The 7(a) loan may require a larger down payment, up to 30 percent of the loan, while only 10 percent is required for a 504 loan. <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">New businesses will find it easier to gain approval for an SBA loan. However, the loan application process can take up to eight weeks, which is something to consider if you need the funds quickly. <\/span><\/p>\n<h3><b>Term loans from banks<\/b><\/h3>\n<p><i><span style=\"font-weight: 400;\">Good Option for Mature Businesses<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Term loans are a good option if you’ve been in business for a while, but they are not the best option for new businesses. To qualify for this type of loan, you need to have proven, consistent revenue and a good credit score. For example, the <\/span><a href=\"https:\/\/www.bankofamerica.com\/smallbusiness\/business-financing\/business-equipment-loans\/\"><span style=\"font-weight: 400;\">Bank of America<\/span><\/a><span style=\"font-weight: 400;\"> requires you to have been in business for at least two years and have a minimum of $250,000 in annual revenue. One of the benefits of term loans is that they don’t necessarily need to be used for commercial equipment or machinery; you can use them to pay for anything your business needs. <\/span><\/p>\n<h3><b>Credit<\/b><\/h3>\n<p><i><span style=\"font-weight: 400;\">Accessible Option for Brand New Businesses <\/span><\/i><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Small business lines of credit and business credit cards are alternatives to equipment loans that enable you to access funds quickly. The benefit of these sources of funding is that once you’ve paid down a portion of the balance, you can use those funds as working capital in your business again. The downside is that they might not be able to provide the amount of funding you need to make larger purchases. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another downside is interest rates. Lines of credit often have higher interest rates than loans. Business credit cards have interest rates that are higher still (up to <\/span><a href=\"https:\/\/www.creditcardsexplained.com\/cards-for\/business?sid=2&amp;gclid=Cj0KCQjwkIGKBhCxARIsAINMioIkt6wM9DjIhv2xMss5Vgxoa9GnnRWNxF1kdL2IPkeiCPkklUuzyukaAtXZEALw_wcB\"><span style=\"font-weight: 400;\">25 percent APR<\/span><\/a><span style=\"font-weight: 400;\">) and often have fees associated with them. Additionally, some equipment vendors do not take credit cards as a form of payment. <\/span><\/p>\n<h3><b>Loans from equipment financing companies<\/b><\/h3>\n<p><i><span style=\"font-weight: 400;\">Accessible Option for New Businesses <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Equipment financing companies often cater to businesses that need certain types of commercial equipment and machinery in specific industries, such as agriculture or construction. A specialized company will understand your business needs. Many of these companies also offer quick approval processes. You may have to shop around for the best available interest rate, and your credit score will affect the interest rate offered to you. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Depending on what you want to use the loan for, these lenders cannot always offer large enough loans to cover your purchases. Also, not all of these companies are willing to lend to new businesses and, similar to banks, may have requirements when it comes to revenue and credit history. However, because equipment loans are secured with the equipment itself, they are much more likely than other lenders to have loans for startups and early-stage businesses.<\/span><\/p>\n<h3><b>Online financial platforms<\/b><\/h3>\n<p><i><span style=\"font-weight: 400;\">Best Option for Growing Businesses <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">Many online lending solutions have flexible financing options that you can use for any business expense, including equipment. Online lenders are more likely to offer term loans and lines of credit even if you do not have business credit history or have a low personal credit score. Typically, you still need to have been in business for more than six months, so they are not the best option for businesses that are not yet established. A key benefit is that online platforms often have quick application and approval processes. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fundbox provides term loans and lines of credit that you can use to finance the purchase of the equipment you need to get your business started. A term loan is the best option for new businesses. Requirements for a term loan include a minimum revenue of $25,000 per year, at least three months in business, and a minimum credit score of 500. <\/span><a href=\"https:\/\/fundbox.com\/term-loan\/#pricing\"><span style=\"font-weight: 400;\">Interest rates for a term loan vary<\/span><\/a><span style=\"font-weight: 400;\"> and you can choose between 24-week and 52-week term repayment options.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The line of credit is best if you’ve been in business for a while, as you do need to have annual revenue of $100,000 or more and have been in business for at least six months. <\/span><a href=\"https:\/\/fundbox.com\/pricing\/\"><span style=\"font-weight: 400;\">Interest rates for a line of credit also vary<\/span><\/a><span style=\"font-weight: 400;\"> and, similar to the term loan, you can choose between 12-week and 24-week repayment terms.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fundbox’s structured repayment plans help you manage your cash flow and pay off your loan reliably, with automatic debiting payments every Wednesday. An added benefit is that there’s no prepayment penalty for paying off your loan in full. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Choose the equipment financing that’s right for your business<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There are plenty of equipment financing options available to you as a new business owner. To start off on the right foot, understand your business goals and map out what you hope to achieve by investing in new equipment. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can learn more about equipment financing in our <\/span><a href=\"https:\/\/fundbox.com\/resources\/guides\/equipments-loan-financing\/\"><span style=\"font-weight: 400;\">Equipment Loans Financing Guide.<\/span><\/a><span style=\"font-weight: 400;\"> <\/span><\/p>\n<p><span style=\"font-weight: 400;\">See if you qualify for a Fundbox Term Loan or Line of Credit to finance the equipment you need to grow your operations: <\/span><a href=\"https:\/\/app.fundbox.com\/signup\"><span style=\"font-weight: 400;\">https:\/\/app.fundbox.com\/signup<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal, and accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>That old adage, “You need to spend money to make money,” applies directly to leveraging equipment financing for your small &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15840,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532,11547],"yst_prominent_words":[723,739,3065,1142,1961,6591,9106,989,1803,3248,3030,3048,3367,3366,2544,2721],"post-meta-fields":{"stripe_selected":"","preview_color":"yellow","bw_feature":"yes","category_color":null},"yoast_title":"How Equipment Financing Can Help You Start Your Small Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"There are many funding options to help small businesses meet this challenge, including commercial equipment loans, general small business loans, and credit."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How Equipment Financing Can Help You Start Your Small Business | Fundbox Blog"},{"property":"og:description","content":"There are many funding options to help small businesses meet this challenge, including commercial equipment loans, general small business loans, and credit."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/equipment-financing-can-help-start-small-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Women-Truck-Driver.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Women-Truck-Driver.jpg"},{"property":"og:image:width","content":"1142"},{"property":"og:image:height","content":"707"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"There are many funding options to help small businesses meet this challenge, including commercial equipment loans, general small business loans, and credit."},{"name":"twitter:title","content":"How Equipment Financing Can Help You Start Your Small Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/Women-Truck-Driver.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/equipment-financing-can-help-start-small-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15788"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15788"}],"version-history":[{"count":2,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15788\/revisions"}],"predecessor-version":[{"id":15790,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15788\/revisions\/15790"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15840"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15788"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15788"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15788"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15788"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}