{"id":15864,"date":"2022-04-19T12:07:30","date_gmt":"2022-04-19T19:07:30","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=15864"},"modified":"2022-04-28T07:59:52","modified_gmt":"2022-04-28T14:59:52","slug":"business-funding-know-options","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/business-funding-know-options\/","title":{"rendered":"Business Funding: Know Your Options"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">For many business owners, funding is the most challenging part of running a business. Whether your business is well established or at the launch stage, ongoing access to funding is a necessity to create the cash flow and liquidity you need to manage unexpected expenses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It’s a good idea to secure capital from a few different sources to create a funding stream that’s sustainable for the long term. While loans from traditional banking institutions are often among the first that come to mind, they’re far from the only option. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">There’s a wide world of funding available, including everything from credit cards to angel investors. But these many options can also feel overwhelming, and it’s not always immediately obvious which option is the best fit. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">In this article, we’ll provide a rundown of some of the primary options for owners to consider when seeking capital for their new business or enterprise, from the most popular to the unexpected. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Self-funding, or loans from friends or family <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Perhaps the most obvious source of funding is either a founder’s own savings, or a personal loan from a family member or other close connection. While few have the cash to fund a new business completely, self-funding doesn’t just refer to the cash in an entrepreneur’s personal bank account. It can include other types of assets, such as investments or property.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In some circumstances, borrowing money from friends and family can be a good option, but this does require caution, as mixing business with personal relationships can be problematic. When borrowing money from a friend or family member, it’s smart to remove as much ambiguity as possible. Mutually agree on terms, then create a written agreement, just as you would with any other loan. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A major advantage of this is that the terms of these loans can be whatever the two parties decide on. For example, the recipient may offer equity in the business in exchange for the funds, or the lender may allow interest-free repayment. The increments in which the loan should be repaid, and the time period to do so, are also up for discussion. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Is it right for your business? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Personal savings or loans from friends and family are best for businesses that are in the earlier stages of their journey, such as launching or preparing to launch. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This option is also a good fit for businesses with low credit scores, or those that aren’t able to meet the qualifying criteria for a bank loan. In these situations, business owners may see friends and family as their only options.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The right amount of personal savings and assets to use to fund a business will also depend on the owner’s risk tolerance. How much in the way of liquid assets does the business need to reserve for emergencies and unexpected costs? Calculating <\/span><a href=\"https:\/\/www.thebalancesmb.com\/what-does-burn-rate-mean-and-how-is-it-calculated-393196\"><span style=\"font-weight: 400;\">burn rates<\/span><\/a><span style=\"font-weight: 400;\"> may also be a good way of determining how much of the owner’s personal savings should be kept easily accessible. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pros: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Accessible<\/b><span style=\"font-weight: 400;\">: There’s no need to go through traditional banks and lenders to access these funds.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Flexible<\/b><span style=\"font-weight: 400;\">: The repayment terms and schedule are completely up to the recipient and lender.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Self-determined<\/b><span style=\"font-weight: 400;\">: This kind of capital comes with much greater freedom than other external funding sources. <\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Cons:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Mixing business and personal:<\/b><span style=\"font-weight: 400;\"> Borrowing from friends and family has the potential to strain relationships.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Not universally available<\/b><span style=\"font-weight: 400;\">: Not all businesses have personal cash available, or family and friends who are willing to provide a loan. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>May drain liquidity<\/b><span style=\"font-weight: 400;\">: Over-emphasizing cash funding may drain a business’ reserves and leave it vulnerable to unexpected or emergency costs. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Line of credit <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A <\/span><a href=\"https:\/\/fundbox.com\/blog\/how-to-choose-a-line-of-credit-for-your-business\/\"><span style=\"font-weight: 400;\">business line of credit<\/span><\/a><span style=\"font-weight: 400;\"> gives you access to a revolving credit line, which is money you can use on an ongoing basis. Depending on your credit score and the lender, lines of credit can give you access to funds ranging from a few thousand dollars to several hundred thousand dollars.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">With a revolving line of credit, the recipient only pays interest on the money borrowed, and they can access the approved funds over and over as long as they continue to pay off their draws. The available credit replenishes as the recipient repays. For example, a business uses its entire $10,000 line of credit to pay for inventory, and repays $2,000 of that borrowed amount. It now will have access to the available credit that’s been repaid, that is $2,000, even with $8,000 outstanding. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Interest rates on lines of credit vary widely depending on the lender; they can range from <\/span><a href=\"https:\/\/www.thebalance.com\/rates-on-a-business-line-of-credit-4153312\"><span style=\"font-weight: 400;\">7 percent to 25 percent<\/span><\/a><span style=\"font-weight: 400;\">, depending on the applicant’s credit history. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Is it right for your business? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">A line of credit is best used for <\/span><a href=\"https:\/\/fundbox.com\/resources\/ebooks\/business-line-credit-work-for-you\/\"><span style=\"font-weight: 400;\">short-term funding needs<\/span><\/a><span style=\"font-weight: 400;\"> and regular operational expenses. This might include utilities, restocking supplies, ordering inventory for an expected busy season, or covering unexpected costs <\/span><a href=\"https:\/\/fundbox.com\/blog\/small-business-disaster-prep\/\"><span style=\"font-weight: 400;\">during a crisis<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A line of credit can also be an effective way to <\/span><a href=\"https:\/\/fundbox.com\/blog\/helpful-strategies-manage-next-cash-flow-crunch\/\"><span style=\"font-weight: 400;\">bridge gaps in cash flow<\/span><\/a><span style=\"font-weight: 400;\">. For example, a business needs to cover payroll by the end of the week, but payments from clients aren’t expected until the end of the month. This is when a line of credit can be used as a temporary solution.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pros: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Versatility<\/b><span style=\"font-weight: 400;\">: Business lines of credit are well suited to a variety of purposes. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Flexibility<\/b><span style=\"font-weight: 400;\">: The recipient only pays interest on the money borrowed‌, saving money if they need less cash than originally anticipated.  <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Higher credit limit<\/b><span style=\"font-weight: 400;\">: Even if a business doesn’t need the extra cash, knowing it’s available as a safety net in a pinch can give business owners peace of mind. <\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Cons:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Variable interest rates<\/b><span style=\"font-weight: 400;\">: Some lines of credit come with interest rates that fluctuate with the market. This can make it harder for borrowers to budget their payments. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Extra fees<\/b><span style=\"font-weight: 400;\">: If the recipient misses a payment, they could end up paying a hefty fee. Plus, many lines of credit come with monthly maintenance or draw fees, which can add up over time. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Bank Loans and Term Loans<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">When many people hear “business funding,” bank loans and traditional term loans are one of the first things that come to mind—simply going to the bank to ask for a loan. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The bank approves the loan of a fixed sum of money that the business agrees to repay within a set time frame. These loans can be secured against collateral such as the applicant’s home, investment portfolio, or business assets.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Bank loans and term loans can also be unsecured. Typically, unsecured loans will come at a higher cost, either in the form of a higher interest rate or stricter repayment terms. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Is it right for your business? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Bank and term loans are best for established, highly profitable businesses that can meet the strict loan qualifications and prove their ability to repay. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Newly launched businesses, those that cannot prove profitability, or those without collateral may not be able to satisfy the often strict terms and need to look elsewhere for funding.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pros: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Affordable<\/b><span style=\"font-weight: 400;\">: Bank and term loans typically offer lower interest rates than other sources of funding. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Flexible<\/b><span style=\"font-weight: 400;\">: Recipients usually have more time to repay these loans. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Widely accessible<\/b><span style=\"font-weight: 400;\">: There are many options available for this kind of funding, through most banks and traditional financial institutions—the hurdle is actually getting approved. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Sustainable repayment<\/b><span style=\"font-weight: 400;\">: Term loans allow you to repay the debt in a steady, predictable way over a moderately long period of time. <\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Cons:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Competitive<\/b><span style=\"font-weight: 400;\">: Strict requirements and a high volume of applicants can make it difficult to qualify for bank and term loans. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Dependent on financial standing<\/b><span style=\"font-weight: 400;\">: A business needs to have available collateral and be able to prove its profitability before it can be considered for a loan. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Small Business Administration (SBA) Loans <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Managed by the SBA, these desirable, but competitive, U.S. government loans are designed specifically for the needs of small businesses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">SBA loan programs are drafted in agreement between lenders and the SBA, as the SBA shoulders some of the risks for the lender by guaranteeing a portion of the loan amount. This arrangement benefits both lenders and small businesses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The lower risk for lenders means they can offer more flexible payment terms and lower interest rates than most small businesses would otherwise be able to secure.<\/span><span style=\"font-weight: 400;\"> <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Is it right for your business? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">SBA loans are highly desirable, which means there is a lot of competition for them and that makes them hard to qualify for. This kind of funding is best for businesses with a good credit history, a clear business plan, and the ability to make a strong case for their profitability.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pros: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Designed especially for small businesses<\/b><span style=\"font-weight: 400;\">: Unlike traditional bank loans, SBA loans target small businesses. The SBA, in partnership with lenders, created guidelines with the aim of aiding small business expansion and growth. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Multiple uses for the funds<\/b><span style=\"font-weight: 400;\">: SBA loans can be used for a wide range of expenses. According to the SBA, you can use these loans for “most” business purposes, including start-up, expansion, equipment purchases, working capital, inventory, or real estate purchases.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Secured loans<\/b><span style=\"font-weight: 400;\">: SBA loans are secured, meaning that the SBA reduces the lender’s risk by guaranteeing a percentage of the loan amount. However, if the business is unable to pay what it owes, the bank can still seize its assets.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Access to more lenders<\/b><span style=\"font-weight: 400;\">: Because the federal government guarantees SBA loans, more lenders are willing to offer financing to small businesses through this channel. Many lenders even lower their qualification criteria for small businesses that apply for SBA loans.<\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Cons:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Personal credit scores required<\/b><span style=\"font-weight: 400;\">: In order to qualify for an SBA loan, applicants must have a high personal credit score as well as good business credit. If either score is low, they may not be eligible. <\/span><span style=\"font-weight: 400;\">Keep in mind that this is also a requirement for the other types of business funding listed.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Over two years in business<\/b><span style=\"font-weight: 400;\">: Businesses must be at least two years old to qualify for an SBA loan. That can be a problem for the over 400,000 new businesses that start up every year in the U.S. and need operational capital to run.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Some restrictions on expenses<\/b><span style=\"font-weight: 400;\">: Some SBA loan programs have restrictions regarding ‌capital, meaning the money the SBA provides can only be used for specific purposes. The way a business plans to use the funds may have an impact on its loan terms, so applicants should consider their expenses carefully when selecting the appropriate program and before applying for the loan.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Specific eligibility requirements<\/b><span style=\"font-weight: 400;\">: Even though it’s generally easier to get approved for SBA loans than for traditional bank loans, the eligibility criteria can still prove tough for many small businesses. The SBA determines eligibility based on factors such as the nature of the business, where the business operates, and the character of its principals. You can find more details about eligibility requirements for SBA loans on the <\/span><a href=\"https:\/\/www.sba.gov\/funding-programs\/loans\"><span style=\"font-weight: 400;\">official government website<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\"> <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Equity Investors<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Angel investors and venture capital (VC) firms are the two major sources of this type of funding. Angel investors are individuals who invest in companies they believe in, in exchange for equity in and partial ownership of the business. VC firms are larger companies instead of individuals, but like angel investors, they make their money by investing in promising companies for a stake in the business. They both provide valuable expertise, connections, and a wealth of experience to the business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Is it right for your business? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Equity-based funding sources are best for startups and companies with very high growth potential. They aren’t a typical funding route for small businesses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, venture capitalists and angel investors will sometimes invest in businesses with disruptive, unproven business models that may be seen as too high-risk for traditional banks. Businesses that fit those parameters should definitely consider equity investors as part of their funding strategy. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pros: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Support and mentorship<\/b><span style=\"font-weight: 400;\">: When businesses choose equity investors, they get leadership and guidance along with business funding. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Higher funding ceiling<\/b><span style=\"font-weight: 400;\">: These options come with the potential to secure more funding, ranging from <\/span><a href=\"https:\/\/www.guidantfinancial.com\/small-business-funding-guide\/equity-based-financing\/\"><span style=\"font-weight: 400;\">$25,000 – $150,000 for angel investors to much larger amounts for VC firms<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Cons:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Not universally available<\/b><span style=\"font-weight: 400;\">: Equity investors expect serious returns, so they’re only suitable for businesses planning on dramatic growth trajectories and gaining a very large market share.<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Sharing control<\/b><span style=\"font-weight: 400;\">: While the experience and connections may be well worth it, sharing equity does mean giving up some degree of control over the business and how it is run. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">Online Lenders <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Today, businesses seeking funding aren’t limited to bank, family, or government-backed loans. Online lenders, including peer-to-peer lending platforms, balance sheet lenders, and lender marketplaces, have emerged as a solution to make business funding more easily and widely accessible. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fintech companies like <\/span><a href=\"https:\/\/fundbox.com\/\"><span style=\"font-weight: 400;\">Fundbox<\/span><\/a><span style=\"font-weight: 400;\"> are leveraging algorithms, predictive modeling, data aggregation, and electronic payment technology to streamline ‌loan applications and increase the efficiency of the approval process to make funding more accessible for small businesses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Through Fundbox, a business owner can secure flexible funding with a line of credit without needing to collect extensive documentation or undergo a rigorous approval process. This way, a business can access funds at a moment’s notice and take advantage of growth opportunities.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Is it right for your business? <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Online lenders are an excellent option for viable, established businesses that may not yet be able to qualify for a bank loan. They are also a great fit for businesses with a slightly lower credit rating. While credit history is a consideration, online lenders won’t place the same level of emphasis on it that a traditional financial institution would. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Pros: <\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Ease of access<\/b><span style=\"font-weight: 400;\">: Online lenders use an application process that is faster, easier, and more streamlined, which is especially good for urgent or unexpected expenses. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Less competitive<\/b><span style=\"font-weight: 400;\">: This kind of funding can be easier to access than an SBA or bank loan. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Lower barrier to entry<\/b><span style=\"font-weight: 400;\">: Collateral is typically not required to be approved for funding from online lenders. <\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">Cons:<\/span><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Not universally available<\/b><span style=\"font-weight: 400;\">: Businesses will still need to be at least somewhat established to qualify. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>Must have credit history<\/b><span style=\"font-weight: 400;\">: The applicant’s business and personal credit history is still a consideration. <\/span><\/li>\n<\/ul>\n<h2><span style=\"font-weight: 400;\">The Wide World of Business Funding<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Seeking business funding can feel overwhelming, but there are enough options out there that whatever your business&#8217; unique structure, needs, and goals, you will be able to find the right funding fit. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Business owners now have greater options beyond the obvious choices of bank loans, lines of credit, and credit cards, and can take advantage of multiple funding sources to create a multi-stream, sustainable business funding strategy. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fundbox is trusted by hundreds of thousands of small businesses. We’re committed to connecting small businesses to the working capital they need to grow and thrive.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Learn more about our <\/span><a href=\"https:\/\/fundbox.com\/get-credit\/\"><span style=\"font-weight: 400;\">Line of Credit<\/span><\/a><span style=\"font-weight: 400;\"> and our <\/span><a href=\"https:\/\/app.fundbox.com\/signup\"><span style=\"font-weight: 400;\">easy application process<\/span><\/a><span style=\"font-weight: 400;\"> today.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><i><span style=\"font-weight: 400;\">Disclaimer: Fundbox and its affiliates do not provide tax, legal or accounting advice. This material has been prepared for informational purposes only, and is not intended to provide, and should not be relied on for, tax, legal or accounting advice. You should consult your own tax, legal, and accounting advisors before engaging in any transaction.<\/span><\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For many business owners, funding is the most challenging part of running a business. Whether your business is well established &#8230;<\/p>\n","protected":false},"author":6,"featured_media":15865,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11532,11546],"yst_prominent_words":[869,723,6380,1132,739,8049,1205,1529,3248,3048,867,2613,1126,3366,2721],"post-meta-fields":{"stripe_selected":"","preview_color":"yellow","bw_feature":"yes","category_color":null},"yoast_title":"Business Funding: Know Your Options | Fundbox Blog","yoast_meta":[{"name":"description","content":"In this article, we’ll provide a rundown of some of the primary options for owners to consider when seeking capital for their new business or enterprise, from the most popular to the unexpected."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Business Funding: Know Your Options | Fundbox Blog"},{"property":"og:description","content":"In this article, we’ll provide a rundown of some of the primary options for owners to consider when seeking capital for their new business or enterprise, from the most popular to the unexpected."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/business-funding-know-options\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/blog_12.jpeg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/blog_12.jpeg"},{"property":"og:image:width","content":"1240"},{"property":"og:image:height","content":"768"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In this article, we’ll provide a rundown of some of the primary options for owners to consider when seeking capital for their new business or enterprise, from the most popular to the unexpected."},{"name":"twitter:title","content":"Business Funding: Know Your Options | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2022\/04\/blog_12.jpeg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/business-funding-know-options\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15864"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=15864"}],"version-history":[{"count":1,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15864\/revisions"}],"predecessor-version":[{"id":15866,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/15864\/revisions\/15866"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/15865"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=15864"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=15864"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=15864"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=15864"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}