{"id":1881,"date":"2015-06-29T06:40:00","date_gmt":"2015-06-29T13:40:00","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=1881"},"modified":"2019-01-29T14:10:26","modified_gmt":"2019-01-29T22:10:26","slug":"how-to-win-and-secure-a-great-retainer-agreement","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/how-to-win-and-secure-a-great-retainer-agreement\/","title":{"rendered":"How to Win and Secure a Great Retainer Agreement"},"content":{"rendered":"<p>You often hear about retainer agreements in the context of big firm lawyer-client or accountant-client relationships, but these lucrative contracts can be applied to almost any service business, particularly freelancers and consultants.<\/p>\n<p>But what makes a retainer agreement different than any other contract? When you set up a retainer agreement with a client, your services are literally “retained” or booked for a certain amount of time, usually so many hours per month or per quarter. As such, retainers are a great cash flow asset because the client pays a pre-agreed amount for your services each month.<\/p>\n<p>Retainers also provide anxious business owners with several benefits, including clear definition (i.e. you can plan your time better around particular clients), a consistent source of income, and stability – all of which can help you sleep a lot better at night!<\/p>\n<p>That’s not to say that retainer agreements aren’t without risk. We’ve all experienced clients who go awry half-way through a regular contract or start introducing scope creep, the same can be true of retainers.<\/p>\n<p>Here are a few tips for winning a retainer contract and ensuring it works for both you and your client.<\/p>\n<p><strong>Target your Most Important Clients<\/strong><br \/>\nThe best place to start looking for retainer clients is among your most important ones. This takes time, so don’t expect to quit your nine to five and walk straight into a relationship like this. It can take several years to establish your business, your value, and your reputation. However, once you have a solid base of one or two notable clients for whom you find yourself doing more and more work (and you’re kicking it out of the ball park each time), it might be time to think about having a retainer discussion.<\/p>\n<p><strong>Position Yourself as Invaluable <\/strong><br \/>\nAnother target for a retainer is that client for whom you are proving invaluable – often these clients are over-tasked, under-resourced and desperate for help. As a result, they turn to you frequently to help them out.<\/p>\n<p>As the projects add up, so do your billable hours. Now is a great time to talk to them about how moving to a retainer model could save them money and reassure them that you can provide them dedicated bandwidth on-tap, as and when they need it.<\/p>\n<p>Which leads me to our next point.<\/p>\n<p><strong>Consider Dropping your Rate <\/strong><br \/>\nRetainers are worth a tradeoff and dropping your rate may be one of them. Think about it – you’re getting a fixed amount of work, you don’t have to spend time marketing yourself, and you may earn a figure equivalent to a salary (minus the benefits). In exchange, it’s customary to offer your services at a discounted rate – anywhere in the range of 65-85% off what you normally charge is expected. This isn’t always the case, but you be the judge and, if necessary, keep this incentive in your back pocket if your client starts to balk at such a commitment.<\/p>\n<p><strong>Don’t Skip the Proposal Part<\/strong><br \/>\nRetainers are a big deal, treat it as such by pitching your services with a well-thought-out proposal that really focuses on your client’s goals and challenges and how you can make life so much easier for them. Check out this article for tips: <a href=\"http:\/\/blog.fundinggates.com\/2014\/09\/write-a-business-proposal\/\" target=\"_blank\">How to Write a Kickass Proposal (and Win More Business)<\/a>.<\/p>\n<p><strong>Shoot for a Retainer that’s Time-Bound<\/strong><br \/>\nRetainers work best when over a longer period, for example, 12 months. This gives you and your client the opportunity to get into a rhythm and measure success. Make a point of including goals and milestones in your contract so that you can chart deliverables and progress. For example, if you’re a freelance writer and your client is looking to develop a series of case studies – set a goal of delivering 2-3 case studies per quarter. Alternatively, a web designer tasked with an ongoing re-branding project might offer a staged approach with several phases.<\/p>\n<p>As with any time-bound contract, include an exit strategy in your contract – usually 30-days’ notice will suffice. If things don’t’ work out, you may need it and your client will appreciate the option.<\/p>\n<p><strong>Be Clear About the Work you Do Under the Retainer<\/strong><br \/>\nBeing specific about the scope of work you do can help mitigate scope creep, but it’s not always that easy. If you expect to get pulled in several directions, use your retainer agreement to define and limit what these requests might be and use your experience to gauge how much of your time they’ll take. For example, if you’re a freelance accountant, there’s a good chance that you’ll get calls, emails and requests that extend beyond the scope you thought you’d signed up for. Use your contract to define clearly what is and what isn’t included in the retainer and your fees for anything that falls outside the scope (usually your normal hourly rate should suffice).<\/p>\n<p><strong>Add the Details<\/strong><br \/>\nOther important details to include in your agreement are your monthly fee, invoice date and payment due date, and how any expenses will be handled.<\/p>\n<p>It’s also useful to include the details of how you’ll work with the client. Who’s your main point of contact? Will there be a monthly or weekly meeting to discuss the work they want you to do? All these details can help you keep on track and delivering value.<\/p>\n<p><strong>Track Time<\/strong><br \/>\nOnce you start working within the retainer, track your time. This will ensure that you aren’t doing more work than you thought you’d signed up for and help you gauge your worth per hour. If any of these two indicators start becoming problematic, then it’s time to renegotiate your agreement.<\/p>\n<p><em>Have you negotiated a retainer agreement? What did you learn? Share your experience in the comments below.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You often hear about retainer agreements in the context of big firm lawyer-client or accountant-client relationships, but these lucrative contracts &#8230;<\/p>\n","protected":false},"author":7,"featured_media":3139,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[10158],"yst_prominent_words":[1298,1701,723,1248,773,2703,5149,3037,4234,2329,5148,5150,5152,5153,5151,1097,4522,3300,3998,3090],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"How To Win and Secure a Great Retainer Agreement","yoast_meta":[{"name":"description","content":"Retainers are a great cash flow asset because the client pays a pre-agreed amount for your services each month."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How To Win and Secure a Great Retainer Agreement"},{"property":"og:description","content":"Retainers are a great cash flow asset because the client pays a pre-agreed amount for your services each month."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/how-to-win-and-secure-a-great-retainer-agreement\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/06\/shutterstock_270646853.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/06\/shutterstock_270646853.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"641"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Retainers are a great cash flow asset because the client pays a pre-agreed amount for your services each month."},{"name":"twitter:title","content":"How To Win and Secure a Great Retainer Agreement"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/06\/shutterstock_270646853.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/how-to-win-and-secure-a-great-retainer-agreement\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1881"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=1881"}],"version-history":[{"count":1,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1881\/revisions"}],"predecessor-version":[{"id":3331,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1881\/revisions\/3331"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/3139"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=1881"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=1881"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=1881"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=1881"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}