{"id":1917,"date":"2018-07-03T08:29:19","date_gmt":"2018-07-03T15:29:19","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=1917"},"modified":"2019-01-29T15:08:52","modified_gmt":"2019-01-29T23:08:52","slug":"why-owning-a-small-business-is-the-best-independence-there-is","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/why-owning-a-small-business-is-the-best-independence-there-is\/","title":{"rendered":"Why Owning a Small Business is the Best Independence There Is"},"content":{"rendered":"<p>If you started a small business because you sought independence, then this Independence Day week is an extra special reason to celebrate your achievements.<\/p>\n<p>Personal independence in the form of business ownership is core to the American dream. Choosing what you want to do and being free to pursue those goals are close to the principles of the Founding Fathers. And let’s not forget the desire for independence that drives more and more Americans into freelancing or to become independent contractors.<\/p>\n<p>So, whether you’ve already “gone it alone” or are thinking of becoming your own boss, let’s take a moment today to hear from a few business owners on why owning a small business is the best kind of independence there is.<\/p>\n<h2>In Divisive Times, Small Business Owners Have a Heightened Sense of Purpose<\/h2>\n<p>When you dictate your own schedule and are your own boss, control is in your hands. For many, this equates to greater personal happiness, but control also brings with it opportunity. Juliana Slye, CEO of<a href=\"http:\/\/www.govbizresults.com\/\"> Government Business Results<\/a>, a San Francisco Bay area-based government sales and marketing enablement agency, feels this acutely:<\/p>\n<p>“In a country where the common threads increasingly touch on the lack of control we feel in the events that occur around us (and the profound disconnect we feel with our elected leaders), as a business owner, I can directly create powerful, positive change in my company, and in the lives of my employees,” said Slye.<\/p>\n<p>“I am able to create jobs, and I am able to take pride in knowing that I strive to be a good leader. Those three things are incredibly meaningful to me. They fuel my sense of purpose and of pride. I am directly contributing to the health of our community, and to their families.”<\/p>\n<h2>Entrepreneurship is a Ticket to Freedom (with a Big Dose of Responsibility)<\/h2>\n<p>We all know that owning a business gives you certain lifestyle advantages, most notably being able to control your work experience – hours, career path, work environment, etc. And this advantage is a big factor in small business owner happiness.<a href=\"https:\/\/www.infusionsoft.com\/business-success-blog\/business-management\/small-business-owner-profiles-2\"> Infusionsoft<\/a> finds that 68% of small business owners rated “living the life I want” as their top success metric.<\/p>\n<p>For Leah Wilkinson, founder and principal of<a href=\"http:\/\/wilkinson.associates\/\"> Wilkinson + Associates<\/a>, a PR and marketing services company in Arlington, Virginia, that flexibility is critical.<\/p>\n<p>“As a foreign-service spouse who is often based overseas, my career flexibility is critical. I&#8217;m a small-business owner and employ a virtual team around the world, which allows me to be creative with my work-day hours. That allows me the time during the day to be a wife, mother and friend (as well as take of myself personally),” said Leah. “The balance isn’t always ideal, but it is far better than if I was stuck in an office working hours that someone else set for me. The ability to succeed professionally without sacrificing my family or myself brings me great joy, and I recognize that I am incredibly fortunate to have that independence.”<\/p>\n<p>But freedom also carries the burden of responsibility. As Slye explains, “I am free from the shackles of corporate politics and toxic cultures. But at the same time, like all freedom, it comes with the responsibility of keeping my company ‘politic-free’ and ensuring we try to build the most empowering culture we can. It’s not an easy thing, some days we do it better than others.”<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9474\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_1035051211.jpg\" alt=\"\" width=\"600\" height=\"400\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_1035051211.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_1035051211-768x512.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2>You Get to Be Part of Your Client’s Success<\/h2>\n<p>First-rate customer care is critical to the success of any business, but when you run that business customer satisfaction takes on another meaning. Successful small business owners are as much invested in their client’s success as their own.<\/p>\n<p>“As a small business with a balance of services offerings and embedded consulting that hits right at the field sales level, we get to be a part of our client’s successes.  We see the direct impact our efforts make on their business results, and that’s pretty powerful,” said Slye.<\/p>\n<h2>You Can Inwardly Flex Your Creative Muscles<\/h2>\n<p>Running a small business requires you to where many hats. Some are hard to wear (401k administration, taxes, managing employees, etc.) but other hats bring new opportunities for self-growth and development.<\/p>\n<p>Slye’s company is in the creative field helping high tech companies market and sell to government agencies, but she didn’t expect to find herself flexing those muscles on her own business: “To think about new services and offerings, and how we package things up for our customer – the technology companies. I love it and it feeds both the left and right sides of my brain.”<\/p>\n<h2>You Can Set Your Own Rhythm<\/h2>\n<p>Unshackled by corporate cultures and processes, small business owners can set their own pace.<\/p>\n<p>“I love the ability to fine tune and manage my company’s delivery rhythm,” said Slye. “We can have a particularly rough period of delivery – and I’m able to add a breather by setting aside a day for teambuilding, and a break.  I’m also able to deliver spot bonuses, on the spot. Along with this is the ability to add new benefits and make systemic changes to make things easier. Plus, I get to do this without bureaucracy or begging. It allows me to really balance and hone our total operational tempo, and our fun factor.”<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9475\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_578493865-1.jpg\" alt=\"\" width=\"600\" height=\"400\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_578493865-1.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_578493865-1-768x512.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2>You Define How you Give Back to the Community<\/h2>\n<p>If your business supports social and philanthropic causes then you’ll know that it can have a positive effect on PR, sales, and customer loyalty. Many corporations have philanthropic causes, but once you step into business ownership you get to define where and how you give back to the community.<\/p>\n<p>“I don’t have to dock into someone else’s way of thinking on how, when, or how much. I have the ability to lay out my own path forward on this – which is to crowdsource ideas from my employees and invest in their causes.  Which is wonderful,” said Slye.<\/p>\n<h2>Your Work-Life Balance Rocks<\/h2>\n<p>Work-life balance is often touted as a compelling reason to go-it-alone and is also key for a happy business. However, balancing work and life in the U.S is notoriously difficult (we currently<a href=\"https:\/\/familylivingtoday.com\/work-life-balance-modern-era\/\"> rank<\/a> 30th out of 38 countries who have a positive work-life balance, in the bottom 20%).<\/p>\n<p>Some of the biggest factors that affect work\/life balance are those that come with working for someone else – bad bosses, too much work, inflexible schedules, long commutes, etc.<\/p>\n<p>But, look what happens when you own a business – a whopping<a href=\"https:\/\/blogs.windows.com\/business\/2017\/11\/09\/new-report-reveals-biggest-trends-small-businesses-2018\/\"> 80%<\/a> report a good work\/life balance, and most small business owners work a traditional work week.<\/p>\n<p><b>These are just some of the reasons to celebrate your small business this Independence Day. So, as you celebrate America’s birthday, now is a great time to reflect on your freedom’s and success. Happy July 4<\/b><b>th<\/b><b>!  <\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you started a small business because you sought independence, then this Independence Day week is an extra special reason &#8230;<\/p>\n","protected":false},"author":7,"featured_media":9476,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72],"yst_prominent_words":[1148,723,875,719,5130,8997,8998,4872,5131,5132,1157,8999,8994,8995,712,709,940,3090,1536],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"Why Owning a Small Business is the Best Independence There Is","yoast_meta":[{"name":"description","content":"If you started a small business because you sought independence, then this Independence Day week is an extra special reason to celebrate your achievements."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Why Owning a Small Business is the Best Independence There Is"},{"property":"og:description","content":"If you started a small business because you sought independence, then this Independence Day week is an extra special reason to celebrate your achievements."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/why-owning-a-small-business-is-the-best-independence-there-is\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_199249334.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_199249334.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"597"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"If you started a small business because you sought independence, then this Independence Day week is an extra special reason to celebrate your achievements."},{"name":"twitter:title","content":"Why Owning a Small Business is the Best Independence There Is"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/07\/shutterstock_199249334.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/why-owning-a-small-business-is-the-best-independence-there-is\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1917"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=1917"}],"version-history":[{"count":3,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1917\/revisions"}],"predecessor-version":[{"id":9477,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/1917\/revisions\/9477"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9476"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=1917"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=1917"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=1917"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=1917"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}