{"id":358,"date":"2013-12-17T18:30:19","date_gmt":"2013-12-18T02:30:19","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=358"},"modified":"2020-11-11T13:06:54","modified_gmt":"2020-11-11T21:06:54","slug":"facing-challenges-small-accounting-firms","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/facing-challenges-small-accounting-firms\/","title":{"rendered":"How to Face the Challenges of Small Accounting Firms"},"content":{"rendered":"<p>Small accounting firms face multiple ongoing challenges. A new study, however, reveals what concerns them most: attracting new clients, client retention and succession planning. Here are some tips to help with all three.<\/p>\n<p><strong>Retaining Clients<\/strong><br \/>\nClient retention isn’t some great mystery – it&#8217;s simply showing you care. For example, many big firms are too busy to take client calls and too slow to return them. If a client calls, answer them or call back quickly. Your availability will be greatly appreciated. Spending time beyond the standard 60 minutes with a client also demonstrates personal attention. And be proactive. If you know a client is having problems, call them before they call you.<\/p>\n<p>Frequent and frank communication is critical to keeping customers happy. Rather than sending clients a short questionnaire every year, visit them personally and spend time finding out how you can improve service and better help them. Customer advice is gold for any business, so make sure to follow up and make changes based on their recommendations. Also don’t &#8220;bill and duck&#8221;. If you have to charge for extra work, speak to the client prior to doing the work.<\/p>\n<p>Become your customers&#8217; trusted adviser – Business owners are seeing you as an authority when it comes to financial reporting. Leverage your position to educate and advise your customers and expand your authority to adjacent financial management practices. Can you advise your customers how to take advantage of tax returns, how to grow their business or how to improve their cash flow or save time and effort? If you do so, not only will you gain the loyalty, trust and esteem of your customers, but you may also be able to increase your revenues by reselling additional services (as long as you follow the disclosure rules).<\/p>\n<p>The rule is simple: think of your idea of great service, be it in a hotel, a restaurant or a flight and think of your customers as your guests. You should strive to provide them with same standards of quality, service and customer experience that you would expect yourself. Remember – customers won&#8217;t stay with you forever just because they&#8217;re used to you. After all, you won&#8217;t go to a restaurant just because you ate there a couple of times. But you&#8217;ll definitely come back to dine there time and again if the service was much better than in other restaurants.<\/p>\n<p><strong>Attracting New Clients<\/strong><br \/>\nAs the economy shows some signs of recovery, many small accounting firms are thinking it may be a good time to grow their businesses. Here are some pointers to help you focus your efforts.<\/p>\n<p><strong>Know Your Market<\/strong> &#8211; As in any other marketing effort, you should start by performing market research. Ask existing and potential customers what&#8217;s important for them and what their needs are. If you don&#8217;t assume that you know your clients needs better than they do, you&#8217;ll be surprised to learn what customers consider as valuable. This will help you focus your effort in creating an offer that will increase the likelihood of attracting new customers.<\/p>\n<p><strong>Differentiate<\/strong> – As your market research will probably reveal, price is only one factor in choosing a CPA firm. Define and articulate what sets you apart from the competition: maybe it&#8217;s your expertise in a specific industry or a specific jurisdiction, or it&#8217;s your value-added services. Make sure you take advantage of the knowledge you&#8217;ve gained through your market research to communicate the differentiation points that your customers care the most about.<\/p>\n<p><strong>Ask for Referrals<\/strong> – Referrals are a proven way to attract new clients. If you&#8217;ve provided great service, ask your customer to share the love and tell other business owners who just started a business or just aren’t happy with their accountant about you. Your clients will be more than happy to provide referrals.<\/p>\n<p><strong>Specialize<\/strong> – Do you have a lot expertise in one or two special areas? Deepen your understanding of these subjects and advertise yourself as a specialist in specific niches: company size, transaction types or even deep knowledge of a specific accounting or billing software can all make you become invaluable in the eyes of your future customers and give you an unfair advantage vis-à-vis your competition.<\/p>\n<p><strong>Participate in Online Forums<\/strong> – Helping business owners and fellow accountants by sharing information and experience, answering questions and giving advice online is a great way to create long-lasting relationships. Treat these relationships with respect and people will consider you as an opinion leader, which will later lead them to count on you for service, information and advice.<\/p>\n<p><strong>Succession Planning<\/strong><br \/>\nLess than half of all CPA firms have a succession plan in place. Here is how to begin making one.<\/p>\n<p>Transitioning takes time. Since you generally only see clients once a year (likely at tax time), four years is a proper period for transitioning in the event of succession. If you are a partner in a firm, make sure the partnership agreement details what happens in the event of a death or retirement. A good succession plan takes into consideration the possibility of multiple retirements in a short period of time and ensures that junior partners are not stuck with impossible cash flow problems or capacity issues.<\/p>\n<p>If an internal succession is not possible, you must consider a sale or merger. Here you should make sure the two firms are a good fit. You must be open and upfront about negative issues that will eventually surface. Consider a two-stage deal, whereby you work alongside your successor firm for a specified period to ease the transition. You should also limit the amount that can be paid out in partner retirement benefits.<\/p>\n<p>Following these tips will help small accounting firms gain a foothold on the challenges that accountants may face throughout the year.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Small accounting firms face multiple ongoing challenges. A new study, however, reveals what concerns them most: attracting new clients, client &#8230;<\/p>\n","protected":false},"author":6,"featured_media":949,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,72],"yst_prominent_words":[2537,3864,3865,723,719,713,1248,3867,3869,773,798,3872,3863,1542,3870,3862,3871,3866,3868,3300],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"Facing the Challenges of Small Accounting Firms","yoast_meta":[{"name":"description","content":"Small accounting firms face multiple ongoing challenges. A new study reveals three things that concern them most. Here are some tips to help with all three."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Facing the Challenges of Small Accounting Firms"},{"property":"og:description","content":"Small accounting firms face multiple ongoing challenges. A new study reveals three things that concern them most. Here are some tips to help with all three."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/facing-challenges-small-accounting-firms\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/11\/chess-316658_1280.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/11\/chess-316658_1280.jpg"},{"property":"og:image:width","content":"1280"},{"property":"og:image:height","content":"847"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Small accounting firms face multiple ongoing challenges. A new study reveals three things that concern them most. Here are some tips to help with all three."},{"name":"twitter:title","content":"Facing the Challenges of Small Accounting Firms"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/11\/chess-316658_1280.jpg"},{"name":"twitter:creator","content":"@Fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/facing-challenges-small-accounting-firms\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/358"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=358"}],"version-history":[{"count":7,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/358\/revisions"}],"predecessor-version":[{"id":14257,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/358\/revisions\/14257"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/949"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=358"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=358"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=358"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=358"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}