{"id":3829,"date":"2015-12-17T08:00:00","date_gmt":"2015-12-17T15:00:00","guid":{"rendered":"https:\/\/blog.fbx.im\/blog\/?p=3829"},"modified":"2020-11-11T14:30:36","modified_gmt":"2020-11-11T22:30:36","slug":"7-places-business-bleeding-money-fix","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/7-places-business-bleeding-money-fix\/","title":{"rendered":"7 Places Your Business is Bleeding Money—and How to Fix it"},"content":{"rendered":"<p>Day after day, you wake up, get dressed, go to work, and put in long hours of hard work to build your business. You’re increasing revenues, bringing in more clients, generating more sales, and constantly looking for new ways to grow.<\/p>\n<p>After all the effort you put into bringing sales in the door—are you working equally hard to make sure the money you’ve made is put to good use?<\/p>\n<p>No matter how profitable your business may be on paper, if the amount of cash coming in doesn’t match what’s going out of your business, you can’t survive in the long term.<\/p>\n<p>Here are seven areas where your business may be losing money fast, along with seven ways to plug the leaks before they can destroy your future profitability.<\/p>\n<p><strong>1) Accounts Receivable<\/strong><br \/>\nBefore we can even talk about the many areas where your business may be bleeding money—let’s take on the biggest financial hemorrhage of all: accounts receivable. Are your clients paying their invoices on time? Is the money coming into your business reflecting the work that you do?<\/p>\n<p>If your clients don’t know for sure they’ll hear from you the moment a payment is late, you’re at high risk to be taken advantage of by customers, and you’ll fail to get paid on time.<\/p>\n<p>Set clear policies with your customers for penalties and consequences when payments are late, such as a 5% late penalty after five days and work stoppage after 30 days past due.<\/p>\n<p>Internally, create a timeline for when you’ll send the initial invoice, when payment reminders will go out, and when you’ll make collections phone calls or when you’ll cut off services if past invoices aren’t paid. Auto-schedule each of these events through a software tool like <a href=\"https:\/\/www.fundinggates.com\/\">Funding Gates<\/a>, or just set a weekly appointment on your calendar to review your receivables and send out any needed invoices or reminders.<\/p>\n<p>In order to stop your business from bleeding money, you first have to make sure the money is coming in the door. Clean up your receivables and deal with clients who have long outstanding invoices before you address any other item on this list.<\/p>\n<p><strong>2) Fines, Fees, and Interest<\/strong><br \/>\nDo you know what your debt is costing your business? Whether from interest on business credit cards, loans and <a href=\"http:\/\/www.fundera.com\/business-loans\/lines-of-credit\">lines of credit<\/a>, or even late payment fees on vendor invoices—it’s incredible how much being in the red can put you, well, even further in the red.<\/p>\n<p>Take the time to do a careful audit of all your costs of current debt, and look for ways to get those debts paid and off your plate. If you have a high interest <a href=\"http:\/\/www.fundera.com\/resources\/small-business-loans\">small business loan<\/a>, or even a few, research ways to refinance or consolidate those debts into a lower interest option.<\/p>\n<p>If you use a business credit card, make sure that you are paying it off every month to avoid paying interest, or consider using a debit or check card instead to avoid interest and fees. The difference of avoiding a few percentage points of interest may seem minor, but you’ll be surprised how quickly it adds up to big savings for your bottom line.<\/p>\n<p><strong>3) Petty Cash<\/strong><br \/>\nIndividually, those five, ten, and twenty dollar purchases seem like no big deal. An office supply here there, some extra print services or packages mailed, even taking a client or two out for a casual lunch. But if you&#8217;re not paying attention, those small expenses add up quickly to become a significant drain on your budget.<\/p>\n<p>Take back control of your petty cash expenses by creating clear processes for managing receipts and tracking purchases. Then, set a monthly appointment to review purchases made, and evaluate whether that’s really how you want to be spending your hard earned revenue. You may be surprised when you see how quickly the dollars add up, and having those figures in black and white is a great motivation to make changes and improve your bottom line.<\/p>\n<p><strong>4) Office Space<\/strong><br \/>\nYour swanky corner office with a view of the downtown skyline is nice and all, but do you know how that valuable real estate is affecting your profit margins?<\/p>\n<p>As more and more business endeavors go online, the cost of pricey office space is making less and less sense for many business owners. Not only could you be saving overhead on renting space, but studies show that your <a href=\"https:\/\/hbr.org\/2014\/01\/to-raise-productivity-let-more-employees-work-from-home\">employees may actually be happier and more productive<\/a> if allowed to work from home. And with the growing proliferation of internal communication tools like <a href=\"https:\/\/slack.com\/\">Slack<\/a>, <a href=\"https:\/\/www.sococo.com\/\">Sococo<\/a>, and HipChat, you may hardly notice a difference in not having your team members just a few feet away.<\/p>\n<p><strong>5) Unproductive Time<\/strong><br \/>\nEvery minute you spend doing work that the customer is not willing to pay for is another cost against your bottom line. That means time you spend checking invoices, paying bills, tallying timecards or processing payroll? Yep, those are all dollars falling right out of your pocket.<\/p>\n<p>If you review your calendar or think about an average week in your life as a business owner, that is probably <em>a lot <\/em>of time. Obviously, these are all tasks that need to get done, but could there be a more productive way to complete these managerial tasks?<\/p>\n<p>With some research, you’ll find there are many tools available that can drastically reduce your time spent on menial management tasks. Save time processing paper timecards with an employee time tracking tool like <a href=\"https:\/\/www.tsheets.com\/\">TSheets<\/a>, expedite payroll and benefits processing with <a href=\"https:\/\/gusto.com\/\">Gusto<\/a>, or avoid the back and forth of scheduling employees’ shifts with <a href=\"http:\/\/wheniwork.com\/\">WhenIWork<\/a>.<\/p>\n<p>Each of these tools does involve some upfront cost, but in many cases that cost is far lower than the value of your precious time spent doing extra work by hand.<\/p>\n<p><strong>6) Marketing Spend<\/strong><br \/>\nOf all the line items on your balance sheet, marketing spend may be the area with the highest likelihood of scope creep—or the subtle addition of unexpected costs adding up over time. Particularly in the age of content marketing, that addition of costs will often come from drains on employees’ time, as hours spent maintaining social media profiles, updating the company blog, or creating marketing materials can escalate faster than one might expect.<\/p>\n<p>And if you’re not closely monitoring the return on your marketing dollars spent, you may be spinning your wheels on marketing efforts that do little or nothing to improve your revenue—meaning you’re bleeding cash in both directions.<\/p>\n<p>Whether you’re handling marketing internally or working with an outside agency, create clear parameters with your team for how you spend your marketing dollars, and what kind of return you expect. Stay focused on your website analytics and other metrics to determine what’s working, and cut costs that don’t show an impact on your revenue.<\/p>\n<p>Of course, not every marketing effort will result in an immediate return. Some efforts take time to pay off, and that doesn’t mean they’re not worth pursuing. But if you can’t see some evidence of a positive result, or your team can’t offer a data-based reasoning for pursuing a particular strategy, it may be time to reevaluate and reign in your cash.<\/p>\n<p><strong>7) Sloppy Accounting<\/strong><br \/>\nIn reality, there are an endless number of ways your business could be losing money—even if just a few dollars at a time—but you’ll never know exactly where those costs are coming from unless you stay on top of your accounting.<\/p>\n<p>If you’re not already, start making use of a simple accounting tool like <a href=\"http:\/\/www.freshbooks.com\/\">Freshbooks<\/a>, <a href=\"http:\/\/quickbooks.intuit.com\/\">Quickbooks<\/a>, or <a href=\"https:\/\/www.waveapps.com\/\">Wave<\/a>. Be sure you’re tracking the money coming into your business as well as what’s going out, and regularly keep your balance sheets and profit and loss statements up to date.<\/p>\n<p>The less you know about where your money is going, the more likely it is that you’re wasting it, and fast. If you hope to maintain a successful business well into the future, it’s essential that you keep a firm eye on your bottom line—and all the other lines along the way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Day after day, you wake up, get dressed, go to work, and put in long hours of hard work to &#8230;<\/p>\n","protected":false},"author":19,"featured_media":4087,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532],"yst_prominent_words":[1683,723,1721,3202,6059,3836,1797,785,3499,808,6060,6061,841,6058,4740,6062,3846,3300,4828,3090],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"7 Places Your Business is Bleeding Money—and How to Fix it | Fundbox Blog","yoast_meta":[{"name":"description","content":"Day after day, you wake up, get dressed, go to work, and put in long hours of hard work to build your business. You’re increasing revenues, bringing in more clients, generating more sales, and constantly looking for new ways to grow. After all the effort you put into bringing sales in the door—are you working equally"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"7 Places Your Business is Bleeding Money—and How to Fix it | Fundbox Blog"},{"property":"og:description","content":"Day after day, you wake up, get dressed, go to work, and put in long hours of hard work to build your business. You’re increasing revenues, bringing in more clients, generating more sales, and constantly looking for new ways to grow. After all the effort you put into bringing sales in the door—are you working equally"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/7-places-business-bleeding-money-fix\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/12\/shutterstock_138793661.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/12\/shutterstock_138793661.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Day after day, you wake up, get dressed, go to work, and put in long hours of hard work to build your business. You’re increasing revenues, bringing in more clients, generating more sales, and constantly looking for new ways to grow. After all the effort you put into bringing sales in the door—are you working equally"},{"name":"twitter:title","content":"7 Places Your Business is Bleeding Money—and How to Fix it | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2015\/12\/shutterstock_138793661.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/7-places-business-bleeding-money-fix\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/3829"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/19"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=3829"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/3829\/revisions"}],"predecessor-version":[{"id":14392,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/3829\/revisions\/14392"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/4087"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=3829"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=3829"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=3829"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=3829"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}