{"id":432,"date":"2014-03-12T08:49:00","date_gmt":"2014-03-12T15:49:00","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=432"},"modified":"2019-01-29T15:58:37","modified_gmt":"2019-01-29T23:58:37","slug":"9-year-end-tax-tips-for-small-business-owners","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/9-year-end-tax-tips-for-small-business-owners\/","title":{"rendered":"9 Year-End Tax Tips for Small Business Owners"},"content":{"rendered":"<p>The April 15 tax deadline is rapidly approaching and the blogosphere is lit up with advice and tax tips for small business owners.<\/p>\n<p>But it was a live Google+ Hangout – <a href=\"http:\/\/university.tutelarymarketing.com\/2014\/02\/11\/localsmall-business-2013-tax-hangout-live-google-hangout-on-air-22114-9am-cst\/\">Local\/Small Business 2013 Tax Hangout &amp; Q&amp;A<\/a> – hosted by the <a href=\"http:\/\/university.tutelarymarketing.com\/\">Local Business Internet Marketing University<\/a> back in February, which got our attention. During the Hangout, CPA and tax expert Greg Lemons (of <a href=\"http:\/\/pbsfranklintn.com\/\">Padgett Business Services<\/a>) covered a ton of topics and answered questions from new and established small business owners alike.<\/p>\n<p>If you’ve got questions about your small business tax return or tax strategies in general, you can bet Greg covered them.<\/p>\n<p>In summary, here are some of Greg’s top tips:<\/p>\n<p><strong>1. Were there any tax changes in 2013 that impact my small business?<\/strong><br \/>\n“It’s really hard to stay up to date on what’s going on out there, …without getting too technical the best thing is to get with a professional because they’re aware of these changes, as they happen. On the business side, other than <a href=\"https:\/\/fundbox.com\/blog\/obamacare-mean-business-cash-flow\/\">Obamacare<\/a>, there are really not a lot of big changes out there for 2013,” explains Greg. “However, there are several personal tax credits that are set to expire.” When in doubt, consult a pro.<\/p>\n<p><strong>2. How can a small business set itself up for a hassle-free tax season?<\/strong><br \/>\n“The most important thing is to maximize your deductions…and, in order to do that, you&#8217;ve got to maintain a proper set of books and records,” explains Greg. “This means using financial software, reconciling your bank account every month …it’s not an annual or tax season event, it’s a monthly event.” An accountant or tax advisor can help with this.<\/p>\n<p><strong>3. Who can help me maintain a solid set of small business books?<\/strong><br \/>\n“There are a lot of small business accounting firms out there. Interview them, talk to them, gauge costs. Depending on the size and complexity of your business you can pay as low as $200 a month for basic accounting and book keeping services.”<\/p>\n<p><em><strong>Tip:<\/strong><\/em> Greg stresses the importance quality of service. For example, his firm offers monthly financial statements as well as advice on how to use these tools to run your business. “I want my clients to manage their business … over the year’s businesses change, different challenges present themselves, and understanding how those impact you financially is going to make you a better business owner and more profitable.”<\/p>\n<p><strong>4. What are the pros and cons of using DIY tax software?<\/strong><br \/>\n“Do it yourself software is actually pretty good, I used it myself for a lot of years. But the big difference is I know what I’m looking for, I know what to enter, and I know how to find the information to enter. The problem with someone who doesn&#8217;t know what they’re doing is that the software can’t tell you what numbers to put in,” said Greg.<\/p>\n<p>“Every time I have a new or existing client walk in, I sit down and interview them and dig down into what has happened in their life (or business) during the year. This can help determine their eligibility for certain deductions. There’s no way a piece of software is going to be able to do that for you. You have to have that understanding, going into it.”<\/p>\n<p><em><strong>Tip:<\/strong><\/em> Greg offered this case scenario as an example where having a tax pro on hand can really save you money:<br \/>\n“The other day a lady walked in who’d used a DIY piece of software, it was showing that she owed $2,500 and she didn’t feel that was right. She came in and I got it down to $1,000 because I saw some things she was missing. We’re also in the process of filing an amended return for the last couple of years and are getting her some more money back because it was a repeated error that she had made.”<\/p>\n<p><strong>5. What are some typical tax deductions errors that small businesses make?<\/strong><br \/>\nOne of the most abused (and error-ridden) deductions that small businesses make, explains Greg, is business use of the automobile and associated record keeping, or lack of:<\/p>\n<p>“The IRS wants you to have a mileage log to track business miles. You can either do a <a href=\"https:\/\/turbotax.intuit.com\/tax-tools\/tax-tips\/Small-Business-Taxes\/Business-Use-of-Vehicles\/INF12071.html\">mileage deduction or do an actual deduction<\/a>, based on those miles. The problem is that most people will try and estimate it at the end of the year… if you’re estimating and guessing you’re probably going to cheat yourself out of a tax deduction.”<\/p>\n<p><b><i>Tip<\/i><\/b>: Mileage costs can be expensed for all manner of business travel reasons – whether it’s travelling to a conference, training venue, or client meeting. You can also deduct tolls and parking as a business expense. Use your odometer to calculate your exact mileage. There are also numerous smart phone apps that make the per-trip mileage calculation a breeze.<\/p>\n<p><strong>6. What do I need to know about claiming the small business home office deduction?<\/strong><br \/>\nWith this one you really need to understand the IRS definition of a home office, explains Greg: “The area has to be used exclusively for business…it could be a separate room or a desk in the corner of an office. The reason for the exclusivity rule is so that you can’t write-off the bonus room with the ping pong table and the big screen TV just because you’ve got a desk in there!”<\/p>\n<p><em><strong>Tip:<\/strong><\/em> To calculate the deduction, take the square footage of the house and the square footage of the office space, then take a percentage of your expenses (rent, insurance, utilities, etc.). Read more in our blog: <a href=\"https:\/\/fundbox.com\/blog\/how-to-claim-small-business-tax-deductions-for-your-home-based-business\/\">How to Claim Small Business Tax Deductions for your Home-Based Business<\/a>.<\/p>\n<p><strong>7. What tax deductions might get you into trouble?<\/strong><br \/>\n“Meals and entertainment… are some of the more commonly abused deductions that we see. Basically, anytime you have a meal and you’re talking business, whether with a client, employees or a professional advisor – that would be a valid deduction. Some of the problems we see are with family businesses, who claim that every meal involves a business discussion! Well, I go back to the IRS definition of business deduction – is it “<a href=\"http:\/\/www.irs.gov\/Businesses\/Small-Businesses-&amp;-Self-Employed\/Deducting-Business-Expenses\">reasonable and necessary<\/a>”? It’s not reasonable to claim that every lunch is a business meal,” said Greg.<\/p>\n<p><strong><em>Tip:<\/em><\/strong> The only time a personal meal, where it’s just you, qualifies as a deduction is if you’re on overnight business travel and are grabbing a bite to eat. But keep your receipts (and for business meetings, make a note of who you dined with, the business purpose and date).<\/p>\n<p><strong>8. What happens during a tax audit?<\/strong><br \/>\n“First of all you’ll get a nastygram from the IRS! You’ll be told when you need to respond or pay the difference by. Audits can go from one line on a tax return to the whole thing,” explains Greg.<\/p>\n<p><em><strong>Tip:<\/strong><\/em> In the event of an audit, your best defense is to ensure you have accurate books and records in the first place. Then, if you’re targeted for an audit, you should be covered. Greg recommends keeping tax records for seven years.<\/p>\n<p><strong>9. Does every business need to file a business tax return?<\/strong><br \/>\nAs Greg explains, if you&#8217;ve earned more than the <a href=\"http:\/\/www.irs.gov\/publications\/p334\/ch01.html#en_US_2013_publink1000313173\">IRS-defined minimum income threshold<\/a> during the business year, you’ll need to file a return. Likewise, if you receive a 1099 form in the mail from a client, you’ll definitely need to file.<\/p>\n<p>“Even if you have very little income, or no income, you may have some expenses, especially if you’re a start-up. Let’s say you start a business on December 1<sup>st<\/sup>, you’ll have a whole load of expenses even though your revenue has started coming in and should file a return.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The April 15 tax deadline is rapidly approaching and the blogosphere is lit up with advice and tax tips for small &#8230;<\/p>\n","protected":false},"author":7,"featured_media":435,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232],"yst_prominent_words":[3940,723,719,3937,3935,3941,3945,3938,3038,3374,3943,712,709,3939,3942,3259,3936,1391,3434,3944],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"9 Year-End Tax Tips for Small Business Owners | Fundbox Blog","yoast_meta":[{"name":"description","content":"As April 15 tax deadline is rapidly approaching here are our top 9 tax tips for small business owners. Can you add to the list?"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"9 Year-End Tax Tips for Small Business Owners | Fundbox Blog"},{"property":"og:description","content":"As April 15 tax deadline is rapidly approaching here are our top 9 tax tips for small business owners. Can you add to the list?"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/9-year-end-tax-tips-for-small-business-owners\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/03\/file00086093967.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/03\/file00086093967.jpg"},{"property":"og:image:width","content":"1024"},{"property":"og:image:height","content":"768"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"As April 15 tax deadline is rapidly approaching here are our top 9 tax tips for small business owners. Can you add to the list?"},{"name":"twitter:title","content":"9 Year-End Tax Tips for Small Business Owners | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/03\/file00086093967.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/9-year-end-tax-tips-for-small-business-owners\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/432"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=432"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/432\/revisions"}],"predecessor-version":[{"id":2752,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/432\/revisions\/2752"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/435"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=432"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=432"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=432"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=432"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}