{"id":488,"date":"2019-05-28T08:00:11","date_gmt":"2019-05-28T15:00:11","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=488"},"modified":"2022-06-23T12:07:29","modified_gmt":"2022-06-23T19:07:29","slug":"how-to-improve-your-small-business-cash-conversion-cycle","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/how-to-improve-your-small-business-cash-conversion-cycle\/","title":{"rendered":"How to Improve Your Cash Conversion Cycle"},"content":{"rendered":"<p>Do you know what your business’ cash conversion cycle (CCC) is?<\/p>\n<p>If you operate a retail-based business or one that maintains inventory and you want to do a better job of managing cash flow, this is the one important metric that you’ll need to understand and manage.<\/p>\n<p>In this article, we&#8217;ll address these common questions:<\/p>\n<ul>\n<li>What is a cash conversion cycle?<\/li>\n<li>Why does your cash conversion cycle matter?<\/li>\n<li>What’s the difference between the cash conversion cycle and operating cycle?<\/li>\n<li>What if you have no physical inventory?<\/li>\n<li>How do you calculate your cash conversion cycle?<\/li>\n<li>How should you analyze your CCC number?<\/li>\n<li>What does a positive CCC say about your business?<\/li>\n<li>What are some financial strategies for improving your cash flow and CCC?<\/li>\n<\/ul>\n<p>By the end of this guide, you should feel a whole lot more confident about working with this critical financial concept. Let&#8217;s go!<\/p>\n<hr \/>\n<h2>What is a cash conversion cycle?<\/h2>\n<p>Simply put, your CCC is the time it takes to convert resources, such as investments in production and sales, into cash flows. In an ideal world, this cycle should be as short as possible (45 days is a good benchmark) so that your money isn’t tied up in inventory or accounts receivable for too long resulting in cash flow problems.<\/p>\n<p>Many things impact the duration of the CCC. For example, businesses that have negotiated longer payment terms with their suppliers will have a shorter CCC since cash doesn’t have to be paid out as fast. On the other hand, if you <a href=\"https:\/\/fundbox.com\/trade-credit\/\">extend trade credit terms<\/a> to your customers your CCC will be extended since they have longer to pay you. Slow sales and economic downturns can also increase your CCC.<\/p>\n<h2>Why does your cash conversion cycle matter?<\/h2>\n<p>The CCC is a useful, and often overlooked, metric of your business’ cash efficiency and overall financial health. The quicker you can convert cash inlay into a dollar of cash flow (i.e. sell faster and collect payments quicker), you’ll shorten the window for reinvesting that cash back into the business. On the flip side, if your business has a long CCC, cash flow can become problematic and you may need to find<a href=\"https:\/\/fundbox.com\/blog\/6-ways-get-working-capital-financing\/\"> working capital<\/a> to fund both your operations and growth.<\/p>\n<h2>What’s the difference between the cash conversion cycle and operating cycle?<\/h2>\n<p>Your business’ operating cycle is similar to its CCC because both of these measure how effective you are at managing cash. The two terms are often used interchangeably, but there’s a difference.<\/p>\n<p>While the CCC measures the days it takes to convert resources to cash, the operating cycle is more specific in that it represents the time it takes from the initial outlay of cash to acquire inventory to receiving payment against those sales from your customers. The operating cycle is, therefore, an indicator of your operating efficiency, while the CCC provides insight into how you’re managing cash flow. Although slightly different, both cycles overlap. For example, a short operating cycle can reduce your CCC and vice versa.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-600 wp-image-12007\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/04\/shutterstock_1095658961.jpg\" alt=\"Professional woman on the phone\" width=\"600\" height=\"400\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/04\/shutterstock_1095658961.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/04\/shutterstock_1095658961-768x512.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2>What if you have no physical inventory?<\/h2>\n<p>If you sell most of your goods online, chances are you don’t have physical inventory. That’s because most online retailers fulfill orders via their suppliers after they receive a payment from their customers. This can result in a very short or even negative CCC.<\/p>\n<p>Don’t discount the importance of calculating your CCC since it will help account for any resources you invested in making those online sales happen, such as sales, marketing, packaging, etc.<\/p>\n<h2>How do you calculate your cash conversion cycle?<\/h2>\n<p>Calculating your business’ CCC is an important exercise that supports any cash flow analysis and is a key indicator of how your company is managing its working capital. To calculate your CCC, you’ll need to gather data from your financial statements.<\/p>\n<p>Let’s assume you’re calculating your CCC over a quarter. Here’s the data that you’ll need:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>Revenue and cost of goods sold (COGS). <\/b>COGS or cost of sales (COS) is a calculation of all the costs involved in manufacturing or selling a product and can be found on your income statement.<\/li>\n<li style=\"font-weight: 400;\"><b>Inventory at the beginning and end of the quarter<\/b>. Find it on that quarter’s balance sheet.<\/li>\n<li style=\"font-weight: 400;\"><b>Accounts receivable and payable at the beginning and end of the quarter. <\/b>Again, refer to your balance sheet.<\/li>\n<li style=\"font-weight: 400;\"><b>The number of days in the period to be calculated. <\/b>90 in the case of this example.<\/li>\n<\/ul>\n<p>The formula for calculating CCC, is as follows: <strong>DIO + DSO – DPO = Cash Conversion Cycle.<\/strong><\/p>\n<p>Here’s an explanation of what these acronyms mean:<\/p>\n<ul>\n<li style=\"font-weight: 400;\"><b>DIO = Days Inventory Outstanding<\/b>. The number of day it takes to sell your entire inventory. The goal is to keep this number low. To arrive at this calculation, divide your average inventory (i.e. your starting inventory and ending inventory for the period divided by two) by the COGS per day.<\/li>\n<li style=\"font-weight: 400;\"><b>DSO = Days Sales Outstanding<\/b>. The number of days it takes to collect payments on sales. If you sell cash-only, your DSO is zero, if you extend credit to include terms such as 30-, 45-, or 90-days this number will be higher. This practice is very common among businesses that serve other businesses (B2Bs) &#8211; 60% use formal or informal systems of trade credit. And for good reason. <a href=\"https:\/\/fundbox.com\/trade-credit\/\">Trade credit<\/a> enables a small business to gain additional revenue from cash-starved businesses that cannot pay immediately. To calculate your DSO, divide your average accounts receivable (again, this is your starting and ending number for the period divided by two) by revenue per day.<\/li>\n<li style=\"font-weight: 400;\"><b>DPO = Days Payable Outstanding (DPO)<\/b>. The number of days it takes to pay your bills. To calculate this figure, divide your average accounts payable number by COGS per day.<\/li>\n<\/ul>\n<p>If you prefer not to do the calculation yourself, Money-Zine offers a useful online <a href=\"http:\/\/www.money-zine.com\/calculators\/investment-calculators\/cash-conversion-cycle-calculator\/\">cash conversion cycle calculator<\/a> that simplifies the process.<\/p>\n<h2>How to analyze your cash conversion cycle number?<\/h2>\n<p>As with most business numbers, one number doesn’t alone won’t tell you much. You’ll need to track your CCC number over time to see whether it’s improving (getting smaller) or getting worse. Tracking quarterly is useful, but plan on annual tracking and building comparisons to get a true picture of how any sales or operational changes are impacting your numbers.<\/p>\n<p>Of course, there are several other financial indicators that your business should be tracking and different methodologies for sourcing the raw data upon which your CCC is based. For this reason, some advisors, including Fortune 500 financial officer, David K. Waltz, suggest exercising some restraint in the conclusions we draw from the CCC calculation. Check out Waltz’s article, <a href=\"http:\/\/treasurycafe.blogspot.com\/2012\/02\/cash-conversion-cycle-good-measure.html\">Cash Conversion Cycle – A Good Measure<\/a>, for some insights into the “potholes in the road” you may encounter as you attempt to employ the cash conversion cycle calculation.<\/p>\n<h2>What does a positive CCC say about your business?<\/h2>\n<p>A positive CCC gives several positive signals about your business, so if you&#8217;ve got one, congratulations. For example, a positive CCC can mean:<\/p>\n<ul>\n<li><strong>You’re smart about your inventory.<\/strong> Businesses with positive cash conversion cycles move inventory quickly. It also means you’re getting a good price for your product—you aren’t selling at a steep discount just to move it. You make intelligent decisions when it comes to customer demands and pivot quickly with changes in customer taste.<\/li>\n<li><strong>You collect what you&#8217;re owed.<\/strong> Your company is top-notch when it comes to collecting on accounts receivable. Maybe you even provide incentives to get your clients to pay on time. Once an invoice goes past due, it gets more expensive and time-consuming to chase the money down. Your positive cash conversion cycle means you probably don&#8217;t have a large amount of uncollectible debt, which can weigh down an operation.<\/li>\n<li><strong>You pay vendors responsibly.<\/strong> A positive CCC indicates that you pay your vendors on time, but maximize the time it takes to transfer payment. Having available cash is important. Once you pay a supplier, those funds are unavailable to buy inventory or meet payroll. A positive cash conversion cycle may mean that you’ve negotiated the due dates on all of your payments so you have extra time to put your cash to work for you.<\/li>\n<li><strong>Lenders might love you.<\/strong> Lenders take cash flow into consideration when making decisions regarding a company’s interest rates and loan amount. A positive cash conversion cycle shows lenders you collect most of your profits.<\/li>\n<\/ul>\n<p>Read on for more on <a href=\"https:\/\/fundbox.com\/blog\/cash-conversion-cycle\/\">why your cash conversion cycle matters<\/a>.<\/p>\n<p>All of these things are great indications about the health of your business. Of course, having a positive cash conversion cycle doesn’t automatically mean you’re in the clear. It&#8217;s just one of many important indicators to keep an eye on.<\/p>\n<h2>Financial strategies for improving your cash flow and cash conversion cycle<\/h2>\n<p>Improving your CCC involves a number of general cash flow management techniques. This includes looking for ways to shift inventory faster, maximizing the amount of time it takes to pay your suppliers, expediting the accounts receivable process, and, of course, reducing expenses and improving revenues where possible.<\/p>\n<p>It’s also important to consider the <a href=\"https:\/\/fundbox.com\/blog\/\">financial strategies<\/a> available to you that can help remedy some of the causes of lengthy cash conversion cycles and cash flow issues such as the challenges of <a href=\"https:\/\/fundbox.com\/blog\/announcing-fundbox-pay-new-payment-credit-solution-smb2b\/\">extending trade credit<\/a> and dealing with <a href=\"https:\/\/fundbox.com\/blog\/late-payments\/\">late paying customers<\/a>. If you find that your CCC isn’t as healthy as it should be, review your <a href=\"https:\/\/fundbox.com\/blog\/6-ways-get-working-capital-financing\/\">working capital financing options<\/a> so that you can keep your business rolling while you address the underlying issues with your CCC.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you know what your business’ cash conversion cycle (CCC) is? If you operate a retail-based business or one that &#8230;<\/p>\n","protected":false},"author":7,"featured_media":12006,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11532],"yst_prominent_words":[11274,11268,3202,1673,1671,11266,713,11265,1679,1672,11271,11267,4064,11272,11275,6083,11269,7843,7842,11270],"post-meta-fields":{"stripe_selected":"bottom-left-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How to Improve Your Small Business Cash Conversion Cycle","yoast_meta":[{"name":"description","content":"Improving cash conversion cycle can do wonders to your small business cash flow. Can you suggest other ways to improve cash flow?"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Improve Your Small Business Cash Conversion Cycle"},{"property":"og:description","content":"Improving cash conversion cycle can do wonders to your small business cash flow. Can you suggest other ways to improve cash flow?"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/how-to-improve-your-small-business-cash-conversion-cycle\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/04\/shutterstock_1182144046.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/04\/shutterstock_1182144046.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Improving cash conversion cycle can do wonders to your small business cash flow. Can you suggest other ways to improve cash flow?"},{"name":"twitter:title","content":"How to Improve Your Small Business Cash Conversion Cycle"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/04\/shutterstock_1182144046.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/how-to-improve-your-small-business-cash-conversion-cycle\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/488"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=488"}],"version-history":[{"count":9,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/488\/revisions"}],"predecessor-version":[{"id":16103,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/488\/revisions\/16103"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/12006"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=488"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=488"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=488"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=488"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}