{"id":508,"date":"2014-05-20T19:32:25","date_gmt":"2014-05-21T02:32:25","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=508"},"modified":"2019-01-29T13:54:09","modified_gmt":"2019-01-29T21:54:09","slug":"small-business-financial-planning-prepare-for-a-dry-spell","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/small-business-financial-planning-prepare-for-a-dry-spell\/","title":{"rendered":"How to Prepare For A Dry Spell in Your Business"},"content":{"rendered":"<p>Preparing for dry spells is a critical component in small business financial planning. While these dry spells are inevitable and for seasonal businesses they are anticipated and accounted for, if you rely on a steady stream of business year-long and suddenly find yourself in the middle of an un-planned for dry spell, the financial impact can be devastating.<\/p>\n<p>We dedicated this blog to help you ensure your next dry spell doesn’t turn into a financial crisis for your small business:<\/p>\n<p><strong>Anticipate and Plan For Dry Spells<\/strong><br \/>\nHaving a reliable sense of your future cash flow and a strategic plan in place can provide the tools needed to manage or avoid any potential problems should your business pipeline dry up. These are also smart business practices – just as you plan for success, plan for the alternative too:<\/p>\n<ul>\n<li><b>Set Up a Cash-Flow Management Structure <\/b>–<b> <\/b>Anticipating and managing cash flow is your first line of defense against a crisis. For freelancers, a simple spreadsheet tracking predicted income and outgoings (expenses) as well as the payment cycles of your clients, is often sufficient to help you stay on top of the movement of cash in and out of your business.<\/li>\n<\/ul>\n<p style=\"padding-left: 30px;\">If you have employees, suppliers, and a growing client base, you’ll need to put more controls and systems in place. A cash flow projection, which can be done with accounting software or the help of your accountant, can help you manage your cash position and anticipate any problems.<\/p>\n<p style=\"padding-left: 30px;\">The exercise will show when cash is due to come in and what your financial obligations are in the meantime (payroll, utilities, suppliers, tax, etc.). Plan on a 12 week cash flow forecast, at a minimum, revisit it weekly to gauge how you’re doing in actuality, and use your data to help you anticipate and prepare for potential dry spells. Read more about <a href=\"https:\/\/fundbox.com\/blog\/making-sense-cash-flow-statement-part-1\/\">Making Sense of Your Cash Flow Statement<\/a>.<\/p>\n<ul>\n<li><b>Talk to Your Bank<\/b> – Understand and explore your emergency funding options. Do you qualify for a business credit card? While you don’t want to run up huge credit card debt, it might serve as an emergency line of credit. As banks will be reluctant to offer you a credit card when you&#8217;re already in the middle of the dry spell, it is wise to secure this option in advance.<\/li>\n<\/ul>\n<ul>\n<li><b>Manage a Lean Business<\/b> – Let’s dispel one myth quickly, there’s a definite difference between being lean and being cheap. Lean thinking lets you identify areas of your business that don’t bring value to your operations or your customers. Think about areas where you are wasting time and money. Where can those hard-earned assets and resources be better deployed, or trimmed entirely? Regularly assess your business in this way and with time you’ll start to see improved productivity, cost savings and a more competitive market position for your business as value is delivered more seamlessly and efficiently to the end customer. Read more about lean business practices in our earlier blog: <a href=\"https:\/\/fundbox.com\/blog\/how-to-be-a-lean-yet-high-growth-small-business\/\">Learn How to Be a Lean, Yet High Growth Small Business<\/a>.<\/li>\n<\/ul>\n<ul>\n<li><b>Save<\/b> –As soon as your business starts to show a profit try to put 10% of every client check into a savings account. Aim to have at 3-6 months’ worth of cash reserves set aside so that you can cover your ongoing expenses and keep your business afloat until operational cash starts flowing again.<\/li>\n<\/ul>\n<p><strong>What To Do If a Dry Spell Is Imminent<\/strong><br \/>\nIf your cash flow forecasts, sales data, or market forces suggest that you’re teetering on the brink of a dry spell, act quickly and put measures in place to minimize the impact:<\/p>\n<ul>\n<li><b>Get Out There and Find More Work<\/b> – Fire up your networks. Reach out to clients who haven’t used you for a while and remind them that you’re there. Another tried and tested tactic is to contact former colleagues, customers, or partners who&#8217;ve made a career move and joined a new company. With access to a new budget and different organizational needs and goals, now is the time to remind them of your services.<\/li>\n<\/ul>\n<ul>\n<li><b>Start a Collections Campaign<\/b> – When times are good, we tend to look leniently on late payments. Now is the time to change that. Check your receivables regularly and chase past due and almost due invoices so that you have a clear view of when the money will hit your bank account. Now is also the time to tackle clients who have a habit of paying you indiscriminately – payments might come in under 30 days one month, but 45 the next. See if you can get them to stick to your invoice terms.<\/li>\n<\/ul>\n<p style=\"padding-left: 30px;\">You could also consider offering shrinking discounts for on-time or early paying clients (for example, 5% off for on-time payments, 10% off for early payments). Don’t feel you have to offer this on a regular basis, treat it like any limited-time offer that you offer for through the month- or quarter-end.<\/p>\n<ul>\n<li><b>Speed Up Payment Transactions<\/b> – If you run a service-based business, look for ways to expedite payments into your bank account such as PayPal or direct deposit arrangements.<\/li>\n<\/ul>\n<ul>\n<li><b>Invoice Early and More Frequently <\/b>–<b> <\/b>Many business owners and freelancers stick to a regular billing cycle, and there’s nothing wrong with that. But in times like these look for opportunities to invoice early. Bill clients as soon as work is completed or consider changing your billing cycle so that you’re billing clients more frequently. For example, if you billed once a month, propose changing that to twice a month. If the work is regular and already budgeted for, most clients won’t balk at this.<\/li>\n<\/ul>\n<ul>\n<li><b>Cut Costs<\/b> – When cash flow really does start to hit hard, look for manageable ways to immediately tighten your belt. Cut your salary (before you make any staff cuts). Freelancers – look for a way to reduce your personal expenditures.<\/li>\n<\/ul>\n<ul>\n<li><b>Clear Invoices<\/b> – If you’re struggling to pay your bills and invoices, consider low-fee invoice clearing services such as those offered by <a href=\"https:\/\/fundbox.com\/blog\/\">Fundbox<\/a>. These services allow you to get paid in advance when you need cash earlier, and some of them also allow you to repay early without penalties when you get out of the dry spell.<\/li>\n<\/ul>\n<p><strong>In Summary<\/strong><br \/>\nAs with all things in life, planning is essential. Just as you plan for business success, plan for the flip side and be prepared to make it as temporary and pain-free as you possibly can.<\/p>\n<p>Over time, these periods can get easier, if properly planned and managed. They might even bring about a welcome opportunity to step back from the day-to-day craziness of being a small business owner. If that’s the case, plan on using the time to take care of long overdue business development or admin tasks, you might even take that vacation you&#8217;ve been longing for. Now that’s something to look forward to!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Preparing for dry spells is a critical component in small business financial planning. While these dry spells are inevitable and &#8230;<\/p>\n","protected":false},"author":7,"featured_media":512,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532,11547],"yst_prominent_words":[1165,4202,723,4204,3202,713,773,724,4201,2621,4200,3198,3949,3953,3928,3050,712,4205,4203,3300],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"How to Prepare For A Dry Spell in Your Business","yoast_meta":[{"name":"description","content":"Preparing for dry spells is a critical aspect of small business financial planning. This blog will help you ensure they don&#039;t turn into a financial crisis"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Prepare For A Dry Spell in Your Business"},{"property":"og:description","content":"Preparing for dry spells is a critical aspect of small business financial planning. This blog will help you ensure they don&#039;t turn into a financial crisis"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/small-business-financial-planning-prepare-for-a-dry-spell\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/05\/tumblr_n5e0d0qDIW1st5lhmo1_1280.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/05\/tumblr_n5e0d0qDIW1st5lhmo1_1280.jpg"},{"property":"og:image:width","content":"220"},{"property":"og:image:height","content":"200"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Preparing for dry spells is a critical aspect of small business financial planning. This blog will help you ensure they don&#039;t turn into a financial crisis"},{"name":"twitter:title","content":"How to Prepare For A Dry Spell in Your Business"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/05\/tumblr_n5e0d0qDIW1st5lhmo1_1280.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/small-business-financial-planning-prepare-for-a-dry-spell\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/508"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=508"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/508\/revisions"}],"predecessor-version":[{"id":2777,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/508\/revisions\/2777"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/512"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=508"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=508"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=508"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=508"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}