{"id":526,"date":"2014-06-03T15:07:42","date_gmt":"2014-06-03T15:07:42","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=526"},"modified":"2021-04-27T14:01:01","modified_gmt":"2021-04-27T21:01:01","slug":"5-ways-to-find-fix-small-business-cash-flow-problems-before-its-too-late","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/5-ways-to-find-fix-small-business-cash-flow-problems-before-its-too-late\/","title":{"rendered":"5 Ways to Find &#038; Fix Small Business Cash Flow Problems Before it’s Too Late"},"content":{"rendered":"<p>Businesses fail for many reasons yet, year-after-year, market research proves that the dominant reason why most small business ventures go pear-shaped is cash flow. In fact, 60 percent of small businesses close their doors for this reason alone while one in three small businesses experience a continuing cash flow problem. So what can you do to ensure your business doesn’t travel down the same path as those unfortunate 60 percent? If you’re experiencing cash flow issues, chances are it’s for one of the reasons below. This blog takes a look at these problem areas and offers up some remedies for dealing with them head-on before it’s too late!<\/p>\n<p><strong>1. Low-Profit Margins- The Small Business Cash Flow Killer<\/strong><br \/>\nSmall businesses can be profitable yet still suffer cash flow issues. In this regard, profits have little impact on your ability to pay your bills. However, if your profit margins are precariously low, whether due to competitive or manufacturing pressures, your gross income will take a hit, as will your small business cash flow, especially if your cost of doing business remains unchanged and those bills start piling up. One way to tackle the problem of low product margins is to determine the actual cost of goods sold.  This exercise will help you determine how to price your products profitability and help you ensure you’re maintaining sustainable margins. It will also tell you fairly concretely which product lines you need to consider ditching.<\/p>\n<p><strong>2. High Overheads<\/strong><br \/>\nHigh overhead expenses are a small businesses worst enemy and can include everything from commercial leases, vehicles, PCs, phone services, office equipment, software, IT support services, and so on. Always be on the lookout for ways to keep these expenses low. If the expense is unnecessary eliminate it, if it’s necessary, look for ways to reduce it. For example, cloud-based software solutions can help you save big on office productivity tools and all but eliminate the need for IT support services. For more tips on eliminating wasteful practices, read <a href=\"https:\/\/fundbox.com\/blog\/how-to-be-a-lean-yet-high-growth-small-business\/\">How to be a Lean, Yet High Growth Small Business<\/a>.<\/p>\n<p><strong>3. High Tax Rates<\/strong><br \/>\nAfter-tax income is the bread and butter of small business owners. It helps us feed our families and put money back into our businesses.  If your margins are strong and expenses are under control, yet you still feel the pinch each month, then you may want to talk have a word with your tax advisor. For example, if you’re a sole proprietor and operate within a certain income bracket, you might benefit from forming an S-Corporation. The structure isn’t for everyone but it could help alleviate the steep income and self-employment taxes that sole proprietors pay. As a guideline, if you make between $80,000 &#8211; $100,000 in bottom line profit then structuring your freelance business as an S-Corporation might be worth considering. Check out this quick video for a simple explanation of the tax benefits of forming an S-Corporation. For other business entities, look for <a href=\"https:\/\/fundbox.com\/blog\/small-business-expenses-to-improve-cash-flow\/\">ways to maximize your tax deductions<\/a> and available tax credits. Think you’re 100 percent on top of tax code, it’s unlikely and a pro can really help you identify where potential savings can be made – especially if your business is structured as a pass-through tax entity (S corporations, LLCs, sole proprietorships or partnerships) – and you pay tax at an individual rate not at a corporate tax rate.<\/p>\n<p><strong>4. B2B Sales that Suck Up Your Cash<\/strong><br \/>\nWe talk about this one a lot at Fundbox – those 30, 60, or 90-day invoices that make winning larger commercial clients a little easier, but wreak havoc with your cash flow, especially when these clients then don’t pay on time. Your business might be the most profitable in town, but if you have a pile of unpaid invoices sitting on your desk, then it’s time to take action. Improving your collections process, offering incentives for early-paying clients, receiving payments electronically, as opposed to by check, can all help speed up the payment process. You can also avoid getting taken for a ride by late-paying commercial clients by only extending net 30 or net 60 terms to clients who have good credit to begin with. If you need an immediate remedy, consider services like those offered by <a href=\"https:\/\/fundbox.com\/\">Fundbox<\/a> and get an advance payment on unpaid client invoices for a small clearing fee (learn more about how it works <a href=\"https:\/\/fundbox.com\/resources\/guides\/funding\/\">here<\/a>).<\/p>\n<p><strong>5. A Fully-Stocked Warehouse<\/strong><br \/>\nTied up your cash in stock that you can’t shift? That’s the genesis of a cash flow problem right there. Aside from having a blow-out sale or reducing your prices to shift inventory, keeping your warehouse leanly stocked so that you can meet demand, is your best remedy. If you’re buying a new product range, limit your quantities until you can truly gauge demand. If the line proves to be popular, let your customers know that you’ll contact them when the item is back in stock (also a useful ploy for getting their contact details for future marketing), and give them a little something extra for their patience (if you can afford it). Alternatively, don’t purchase inventory until you have a confirmed order from a customer (useful for online businesses or those that don’t rely on visible merchandising to shift stock). Read more about <a href=\"https:\/\/fundbox.com\/blog\/optimize-inventory-costs\/\">how to optimize your inventory costs<\/a>.<\/p>\n<p>In conclusion, small business cash flow problems are evil, but not a necessary one. The message here is that with a deeper understanding of your business dynamics you can solve most of these challenges long before they hit you. Can you add your own ideas on how to predict and solve these problems?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Businesses fail for many reasons yet, year-after-year, market research proves that the dominant reason why most small business ventures go &#8230;<\/p>\n","protected":false},"author":7,"featured_media":530,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532],"yst_prominent_words":[723,2202,2198,1132,3202,713,2200,2201,912,3198,2203,2205,4199,3037,712,2199,2197,1126,2204,3259],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How to Fix Small Business Cash Flow Before it’s Too Late","yoast_meta":[{"name":"description","content":"Instead of falling into the pitfalls of a small business cash flow problem, learn how to anticipate and solve them. Can you add to the list?"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Fix Small Business Cash Flow Before it’s Too Late"},{"property":"og:description","content":"Instead of falling into the pitfalls of a small business cash flow problem, learn how to anticipate and solve them. Can you add to the list?"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/5-ways-to-find-fix-small-business-cash-flow-problems-before-its-too-late\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/06\/download.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/06\/download.jpg"},{"property":"og:image:width","content":"220"},{"property":"og:image:height","content":"200"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Instead of falling into the pitfalls of a small business cash flow problem, learn how to anticipate and solve them. Can you add to the list?"},{"name":"twitter:title","content":"How to Fix Small Business Cash Flow Before it’s Too Late"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/06\/download.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/5-ways-to-find-fix-small-business-cash-flow-problems-before-its-too-late\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/526"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=526"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/526\/revisions"}],"predecessor-version":[{"id":15359,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/526\/revisions\/15359"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/530"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=526"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=526"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=526"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=526"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}