{"id":563,"date":"2014-07-08T08:59:21","date_gmt":"2014-07-08T15:59:21","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=563"},"modified":"2022-06-23T12:12:14","modified_gmt":"2022-06-23T19:12:14","slug":"5-small-marketing-changes-will-big-impact-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/5-small-marketing-changes-will-big-impact-business\/","title":{"rendered":"5 Small Marketing Changes that Will Have a BIG Impact on Your Business"},"content":{"rendered":"<p>Are you struggling to find new marketing ideas for your small business? Not sure where to go next without spending big dollars on outsourcing to a marketing or PR agency?<\/p>\n<p>Oftentimes it’s the smallest changes that can have the biggest impact, but because we’re all so caught up in the day-to-day we aren’t always as tuned into them as we could be.<\/p>\n<p>Don’t fret about coming up with something big and fancy, bigger isn’t always better. Sometimes the smallest changes can make a significant difference. Consider trying these five simple and small marketing changes that you can do right now to improve your marketing results and your bottom line.<\/p>\n<p><strong>1. Start with Your Front Door<\/strong><br \/>\nLet’s start with the front door of your business. According to YP.com, 97% of consumers search for local businesses online and there first point of entry is often your website. Your website is a huge reflection of your business, your professionalism, and your reputation, so if it hasn’t been tended to for a while, now is the time.<\/p>\n<p>Starting with the home page, look for ways to make your site as user friendly as possible. It really is worth spending some money and hiring a pro to help you with this. They can also help ensure it’s optimized to be read on mobile devices and is search engine friendly – meaning you’re using the right combination of keywords and tags to make sure your business can easily be found online.<\/p>\n<p>Above all, review your site and make sure it connects with your target audience – from the images you use to the language you write with. If you run a service-based business, consider adding case studies, before and after images, and samples of your work.<\/p>\n<p>Now, while your website is your flagship, you still need to get your brand out to where people are. Make sure your business is listed on key online directories such as <a href=\"http:\/\/www.google.com\/business\/\">Google My Business<\/a>, <a href=\"https:\/\/www.bingplaces.com\/\">Bing Places for Business<\/a>, <a href=\"https:\/\/smallbusiness.yahoo.com\/local-listings\/basic-listing\/\">Yahoo<\/a> as well as social sites like Facebook and Yelp. $10.3 billion is lost annually by small businesses because they don’t have a free listing, get on it!<\/p>\n<p><strong>2. Take a Marketing Channel that Works and Build on It<\/strong><br \/>\nIf a particular marketing channel works really well for your business, think of ways to build on it. For example, if you’ve had success marketing products and services via email, could you use the same channel to promote your social media presence, share blogs, and so on? Look for ways to use segmentation to deliver targeted messages and promotions based on the purchase history of your subscribers. This is a great way to drive upsell and cross-sell opportunities and minimize opt-outs.<\/p>\n<p>You could also build on the success you’ve had with one channel and replicate it across others. If the messaging and call to action has worked on email, could you replicate that campaign across other channels like direct mail, flyers, or on the radio?<\/p>\n<p>Make sure you test your results – always. Use unique URLs or tracking codes to gauge where your leads are coming from and focus on the channels that really matter. Small business owners don’t have time to invest in fruitless channels, and the results can be costly.<\/p>\n<p><strong>3. Become a Problem Solver<\/strong><br \/>\nWhatever product or service you sell, putting yourself out there as a source of useful advice on different topics related to your business is a great marketing strategy. Become a trusted advisor and you’ll have a much easier time winning new business.<\/p>\n<p>You see this all the time in industries such as real estate and financial services, where business owners invite prospects and customers to attend workshops where they share advice on everything from staging a home to planning for retirement.<\/p>\n<p>Others take advantage of public speaking opportunities at association or industry events.<\/p>\n<p>Or you could just stick to writing a blog. Think about topics that are relevant to your customers, what are their challenges, how can you help address or answer them?<\/p>\n<p><strong>4. Turn Loyal Customers into Advocates<\/strong><br \/>\nWho better to do your marketing for you than your most loyal customers? Facebook and other social media sites are a great source of recommendations from your fan base, and they are free. Happy customers talk about your business; they talk about what they purchased and share it with their networks. Your existing customer base is a huge source of new custom.<\/p>\n<p>Look for ways to raise awareness of your social sites – entice people to stay in touch with you. Engage with them online – show off your expertise and experience, answer questions so that fans perceive that you have a relationship with them. It’s a two-way dialog, treat it as such. If you’re stuck, take a look at how other small businesses are doing it. Once you have a relationship you’ll no longer be competing based on price.<\/p>\n<p><strong>5. Test, Test, Test<\/strong><br \/>\nToo often businesses give up on marketing because they think it’s too expensive and doesn’t work. Sure, not everything works, but giving up isn’t the answer, you need to find out why things aren’t working, make adjustments if necessary, but never give up.<\/p>\n<p>Whenever you try anything new, whether it’s launching a blog, changing up your email messaging, or using a new marketing channel – be sure to test your results and adjust your strategy accordingly, then test again. This will take time, but it’s the only way to ensure you are spending your time and money where it can have the most impact. If something is working great, look for ways to repeat that success but make sure you’re flexible enough to make changes when things don’t.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you struggling to find new marketing ideas for your small business? Not sure where to go next without spending &#8230;<\/p>\n","protected":false},"author":7,"featured_media":564,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[10158],"yst_prominent_words":[723,719,1240,4178,798,4174,3928,2217,808,4170,4176,712,1126,4177,794,4173,4175,4172,4171,3300],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"5 Small Marketing Changes that Will Have a BIG Impact","yoast_meta":[{"name":"description","content":"The simpler side of marketing and how some small marketing changes can have a big impact on your bottom line and business."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"5 Small Marketing Changes that Will Have a BIG Impact"},{"property":"og:description","content":"The simpler side of marketing and how some small marketing changes can have a big impact on your bottom line and business."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/5-small-marketing-changes-will-big-impact-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/07\/5_Small_Marketing_Changes.png"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/07\/5_Small_Marketing_Changes.png"},{"property":"og:image:width","content":"300"},{"property":"og:image:height","content":"261"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"The simpler side of marketing and how some small marketing changes can have a big impact on your bottom line and business."},{"name":"twitter:title","content":"5 Small Marketing Changes that Will Have a BIG Impact"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/07\/5_Small_Marketing_Changes.png"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/5-small-marketing-changes-will-big-impact-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/563"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=563"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/563\/revisions"}],"predecessor-version":[{"id":16107,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/563\/revisions\/16107"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/564"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=563"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=563"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=563"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=563"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}