{"id":569,"date":"2014-07-15T07:13:26","date_gmt":"2014-07-15T14:13:26","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=569"},"modified":"2020-11-03T15:15:37","modified_gmt":"2020-11-03T23:15:37","slug":"6-small-business-financial-mistakes-youll-never-make","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/6-small-business-financial-mistakes-youll-never-make\/","title":{"rendered":"6 Small Business Financial Mistakes You’ll Never Make Again"},"content":{"rendered":"<p>Tax season aside, anyone who runs a small business knows that your financial and regulatory obligations don’t stop there. Paying estimated taxes, making payroll, and staying cash flow positive is a year-round effort. There’s a lot to stay on top of and, let’s face it, a lot that can fall through the cracks.<\/p>\n<p>Here are just six small business financial mistakes that small businesses frequently make (and tips for correcting them), the results of which can be costly (and attract the attention of the IRS).<\/p>\n<p><strong>1. Not staying on top of your books<\/strong><br \/>\nThis sounds like a screamingly obvious best practice to maintain, but stepping back from the day-to-day “busyness” of business isn’t always easy. Consequently, your books can suffer. Keeping accurate records is a must if you’re going to stay on top of who’s paid you, who’s delinquent, what your expenses look like, and ways to cut costs. It will also help you maximize your tax deductions<\/p>\n<p><a href=\"https:\/\/fundbox.com\/blog\/switching-to-online-accounting-software-why-and-how\/\">Making the switch to an online accounting system<\/a> can help take the pain out of staying on top of cash flow statements, P&amp;L reports, and more. Dashboard reporting, collaboration features, and more, can make the process a whole lot easier.<\/p>\n<p><strong>2. Skipping budgeting and forecasting exercises<\/strong><br \/>\nBudgets and financial forecasts get a bad rap. Many of us think they are just plain hard work and put off the task. But it’s a lot easier to run a business with a forecast than it is without one. Forecasts help you make good business decisions. They help you anticipate trends – such as potential cash flow issues – allocate and manage the flow of your money. Here’s what forecasts are not – they are not about guessing the future correctly, no one can do that. Forecasting is less about numbers and more about knowing your business – the variables, the risks, the opportunities.<\/p>\n<p>Then there’s the business of budgeting. Just as you revisit your forecasts, a budget is also a living, breathing thing that should be revisited often.<\/p>\n<p>Budgets and forecasts are less about accounting and more about planning. This <a href=\"https:\/\/fundbox.com\/blog\/4-must-small-business-planning-exercises-new-year\/\">blog<\/a> offers more practical tips for budgeting and planning.<\/p>\n<p><strong>3. Not incorporating your business<\/strong><br \/>\nNot all businesses need to incorporate. Many freelance businesses, for example, operate quite seamlessly as sole proprietors. However, if you’re concerned about your exposure to a lawsuit or debts, running your business as an LLC or Corporation is a good idea.<\/p>\n<p>For example, if a client sues you or you find yourself pursued by creditors for outstanding debt, as an incorporated business only your business assets are at risk, your home, savings, etc. are safe. Furthermore, if you’re concerned that your business liability insurance (if you have any) won’t protect your personal assets against claims, then forming an LLC can help.<\/p>\n<p>There’s also a tax benefit, though not always. Read: Is it Time to Incorporate your Small Business?<\/p>\n<p><strong>4. Failing to separate personal and business expenses<\/strong><br \/>\nCo-mingling your business and personal expenses is a big mistake. Small businesses are afforded many tax breaks – from business mileage and other travel expenses, to home office deductions, business entertainment write-offs, and many more. All well and good, but the IRS requires that you maintain accurate records and receipts to account for these expenses.<\/p>\n<p>One of the easiest ways to do this is to keep all your business costs separate – get a business credit card, operate a separate business bank account, and log all your expenses (date, reasons, cost, etc.) in a spreadsheet or accounting system.<\/p>\n<p>These simple steps will help you maximize your deductions (and build good business credit). Again, it sounds obvious, but even seasoned business executives make the mistake of waiting till tax season to review and record their annual expenses, potentially leaving a whole load of cash on the table.<\/p>\n<p>If you’re not sure what you can and can’t expense, talk to a tax advisor, small business owners come under a lot of scrutiny from the IRS for their expense deductions, so be sure you’ve got it right.<\/p>\n<p>Here’s a useful resource: <a href=\"https:\/\/fundbox.com\/blog\/5-signs-that-your-small-business-tax-return-may-prompt-an-irs-audit\/\">5 Signs that Your Small Business Tax Return May Prompt an IRS Audit<\/a>.<\/p>\n<p><strong>5. Not getting the most out of a small business accountant<\/strong><br \/>\nDon’t overlook the value of an accountant. Again, it’s something that many small businesses put off because they think they can handle everything themselves or can’t afford the overhead. However, nothing ventured, nothing gained. An accountant can lighten your load and relieve much of the burden involved in managing cash flow, planning for growth, assessing risk, and keeping your books in order. If you have an accountant, visit him or her at least once a month. Make these visits a core part of your business planning and review process.<\/p>\n<p><strong>6. Classifying employees as independent contractors<\/strong><br \/>\nAs more and more businesses outsource to independent contractors, more are coming under scrutiny from the IRS for misclassifying employees as contractors. You may save on payroll taxes and benefits by hiring a 1099, but if a contractor meets the legal definition of an employee then you might be in trouble.<\/p>\n<p>And it’s easily done. For example, if you set the hours that a contractor must work or insist that they work onsite every day, you may be breaking the law. For more insight into this thorny topic, as well as the role the IRS plays and why you need to be aware, read SBA’s guide to <a href=\"http:\/\/www.sba.gov\/content\/independent-contractors-vs-employees\">Independent Contractors vs. Employees<\/a>.<\/p>\n<p>There you go, not rocket science, but all of the above are frequent mistakes or mishaps that can jeopardize the financial health of your small business and catch the eye of the IRS. Avoid these small business financial mistakes if you can.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tax season aside, anyone who runs a small business knows that your financial and regulatory obligations don’t stop there. Paying &#8230;<\/p>\n","protected":false},"author":7,"featured_media":573,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,72,11532],"yst_prominent_words":[4067,4167,723,1721,4169,4164,1132,713,740,4168,3037,1957,3376,4165,712,4166,4163,1126,3259,3434],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"6 Small Business Financial Mistakes","yoast_meta":[{"name":"description","content":"6 small business financial mistakes which can really hurt your business. Learn how to avoid these major pitfalls and get your small business back on track."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"6 Small Business Financial Mistakes"},{"property":"og:description","content":"6 small business financial mistakes which can really hurt your business. Learn how to avoid these major pitfalls and get your small business back on track."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/6-small-business-financial-mistakes-youll-never-make\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/static\/img\/fundbox-blog-logo.svg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/static\/img\/fundbox-blog-logo.svg"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"6 small business financial mistakes which can really hurt your business. Learn how to avoid these major pitfalls and get your small business back on track."},{"name":"twitter:title","content":"6 Small Business Financial Mistakes"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/07\/financial_pitfalls1.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/6-small-business-financial-mistakes-youll-never-make\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/569"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=569"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/569\/revisions"}],"predecessor-version":[{"id":13884,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/569\/revisions\/13884"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/573"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=569"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=569"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=569"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=569"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}