{"id":6160,"date":"2016-10-26T09:00:00","date_gmt":"2016-10-26T16:00:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=6160"},"modified":"2022-06-24T06:50:53","modified_gmt":"2022-06-24T13:50:53","slug":"11-questions-before-choose-crm","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/11-questions-before-choose-crm\/","title":{"rendered":"11 Questions to Ask Before You Choose a CRM"},"content":{"rendered":"<p>You&#8217;ve decided to take the plunge and sign up for a Customer Relationship Management (CRM) system. The days of managing customer information on notecards, spreadsheets, and in emails are over, right?<\/p>\n<p>Not so fast!<\/p>\n<p>A CRM is not a magic wand that solves all of your problems simply by &#8220;turning it on.&#8221; In fact, without a well thought-out plan, you may be setting yourself up for even more frustration.<\/p>\n<p>In this post, I&#8217;ll share the top questions to consider before going any further.<\/p>\n<h3><strong>1. Is My Company Ready for a CRM?<\/strong><\/h3>\n<p>If you&#8217;re reading this post, you&#8217;ve probably already made up your mind. I&#8217;m of course not going to talk you out of a CRM, but you should at least evaluate how a system will be perceived by your team. Company culture and technological skill levels should definitely be factored into the discussion.<\/p>\n<h3><strong>2. Which Features Are Necessities?<\/strong><\/h3>\n<p>A quick online search will yield countless CRM solutions, each one promising more advanced features than the next. Although a feature-rich application can deliver untold value, avoid overlooking the basics.<\/p>\n<p>In my experience, most companies need to at least the following features:<\/p>\n<ul>\n<li>Contact, opportunity, and account management<\/li>\n<li>Record linking<\/li>\n<li>Tasks and reminders<\/li>\n<li>Multi-user log in<\/li>\n<li>Sales team management<\/li>\n<li>Pipeline customization and reporting<\/li>\n<\/ul>\n<p>Start by comparing vendors that offer these features at all plan levels. Vendors that restrict access to such features (or fail to offer them) may not be worthy of your shortlist.<\/p>\n<h3><strong>3. What is My Data Structure?<\/strong><\/h3>\n<p>Unless you&#8217;re a technology company, you may have never heard the term &#8220;data structure.&#8221; In today&#8217;s tech-driven world, however, it is important to be very familiar with this concept.<\/p>\n<p>Now, I&#8217;m certainly not a software developer. Coders would likely give you a much more detailed definition of &#8220;data structure.&#8221; From my perspective, however, your data structure is simply how your business relationships translate to software.<\/p>\n<p>For example, let&#8217;s imagine you own a small insurance agency. Agencies typically have thousands of complex relationships to keep organized. Commercial accounts, personal line customers, underwriters, word-of-mouth referrals—the list never seems to end. It&#8217;s therefore daunting to configure a CRM from scratch.<\/p>\n<p>Before getting too overwhelmed, slow down the process and try to see the bigger picture. Look for commonalities that might help you group your data in a CRM. In our insurance agency example, I might recommend the following basic record structure.<\/p>\n<ul>\n<li>Set up a <a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/204061064-Video-Working-with-Contacts\" target=\"_blank\" rel=\"noopener noreferrer\">contact record<\/a> for each person<\/li>\n<li><a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/204248060-Linking-records\" target=\"_blank\" rel=\"noopener noreferrer\">Link<\/a> contacts to the correct organizations<\/li>\n<li><a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/204061624-What-are-tags-\" target=\"_blank\" rel=\"noopener noreferrer\">Tag<\/a> organizations as appropriate (client, vendor, etc.)<\/li>\n<li>For personal lines, implement a contact tagging structure (home, auto, life, etc.)<\/li>\n<li>Configure <a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/204061464-How-to-create-Pipelines\" target=\"_blank\" rel=\"noopener noreferrer\">pipelines<\/a> and begin tracking opportunities<\/li>\n<\/ul>\n<p>With such a framework in place, the implementation of a CRM becomes much more manageable.<\/p>\n<h3><strong>4. How Will I Import Existing Data?<\/strong><\/h3>\n<p>Keying in hundreds or thousands of records is not feasible for most businesses. Even if it were, manual data entry is still prone to oversights.<\/p>\n<p>Luckily, most CRMs offer a variety of data import options. Insightly, for example, allows you to <a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/208987478-The-Insightly-Importing-Guide\" target=\"_blank\" rel=\"noopener noreferrer\">import<\/a> from a CSV file or by <a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/208987478-The-Insightly-Importing-Guide\" target=\"_blank\" rel=\"noopener noreferrer\">connecting<\/a> to your existing contact management system. Either way, you&#8217;ll want to do your homework before importing your first record. Try importing <a href=\"https:\/\/support.insight.ly\/hc\/en-us\/articles\/204248500-Sample-import-files\" target=\"_blank\" rel=\"noopener noreferrer\">sample data<\/a> before doing a full-scale upload of your contacts.<\/p>\n<p>Now may also be a great time to efficiently capture your contact and organizational tags. If you&#8217;re using a CSV import, check to see if tagging is feasible during this stage. Doing so could save hours of labor in the future.<\/p>\n<h3><strong>5. What Integrations Do I Need?<\/strong><\/h3>\n<p>Another advantage to web-based CRM software is the availability of third-party integrations. If you&#8217;re new to the software world, integrations may offer little value to your business. However, most companies today are already using a multitude of other apps (whether they realize it or not).<\/p>\n<p>Remember, your CRM will serve as the &#8220;hub&#8221; of all customer, sales, and (in some cases) project management information. (If implemented correctly, your team may even check the system more than social media!) Significant efficiencies can be achieved by automatically &#8220;feeding&#8221; information to and from your hub. Common examples include:<\/p>\n<ul>\n<li>Synchronizing all email conversations into contact record histories<\/li>\n<li>Importing quotes and proposals onto opportunity records<\/li>\n<li>Integrating to external document management repositories<\/li>\n<li>Sending new leads to your bulk email marketing systems<\/li>\n<li>Mirroring tasks and events to smartphone calendars<\/li>\n<\/ul>\n<p>The possibilities seem to be endless. When choosing your CRM, it&#8217;s important to first explore what is possible and then prioritize your wish list. Don&#8217;t try to do too much at once.<\/p>\n<h3><strong>6. Who Needs Access?<\/strong><\/h3>\n<p>Migrating your sales information to the cloud is beneficial for a number of reasons. One obvious benefit involves accessibility. Unlike email inboxes or spreadsheets, users can simultaneously access important information from any web-enabled device.<\/p>\n<p>Increased accessibility brings new decisions for you. Who at your organization needs to access the CRM? Which users should hold administrative privileges? Who will be responsible for assigning new leads?<\/p>\n<p>These are important questions to consider for a number of reasons. From a budgeting standpoint, many CRM plans allot a fixed number of user licenses. Insightly is a little different, in that each paid plan offers the possibility of unlimited users. As new employees come on board, your per-user cost never increases (unless you opted for more features).<\/p>\n<p>You should also view these questions from a data security standpoint. Certainly, not all of your sales reps need administrative privileges. Some companies even restrict access to only those records needed per user. This approach requires more administrative oversight, but it can reduce the risk of unwanted security issues (or turf wars).<\/p>\n<h3><strong>7. Who Will &#8220;Own&#8221; the CRM?<\/strong><\/h3>\n<p>Once you&#8217;ve decided on user access, you&#8217;ll also need to clarify who will &#8220;own&#8221; your CRM account. With dozens of potential users accessing your system 24\/7, the opportunity for chaos exists. You need one person who is responsible for the success (or failure) of your investment. Select someone you trust who has a basic understanding of technology. Ideally, the candidate would also be capable to lead in these areas:<\/p>\n<ol>\n<li><strong><em><i>Implementation<\/i><\/em><\/strong> Depending on which CRM you select, implementation can vary greatly. Some vendors require you to work with an &#8220;approved&#8221; Others take a DIY model, offering step-by-step instructions for success. Either way, you need someone internally who can manage projects and connect the dots.<\/li>\n<\/ol>\n<ol start=\"2\">\n<li><strong><em><i>Policies &amp; Procedures<\/i><\/em><\/strong>Employees come and go. Once implemented, however, your CRM will serve your organization indefinitely. Smart companies invest in ongoing employee education and training materials. Your CRM owner will need to define workflows, guidelines, and expectations. This information should then be disseminated to users and routinely updated as processes change.<\/li>\n<\/ol>\n<ol start=\"3\">\n<li><strong><em><i>System Policing<\/i><\/em><\/strong>What should happen when a sales rep inexplicitly deletes several customer records? Will you have a way to monitor this type of undesirable activity? Your administrator should have a routine of checking (and enforcing) policy violations. It&#8217;s your company, and it&#8217;s your data. Protect it.<\/li>\n<\/ol>\n<ol start=\"4\">\n<li><strong><em><i>Security<\/i><\/em><\/strong> How often should your users update their passwords? Are users permitted to export customer data into a CSV format? What other CRM-related risks will you need to address? Your CRM owner should always be thinking about these types of questions. If he doesn&#8217;t know the answers, it&#8217;s his job to request the proper resources.<\/li>\n<\/ol>\n<h3><strong>8. Do I Need a Consultant?<\/strong><\/h3>\n<p>The need for a consultant depends heavily on the situation. For smaller companies with limited IT experience, a consultant can be instrumental in defining a logical data structure, importing customer records, and guiding implementation. For larger companies, a consultant can build new capacity and minimize the unnecessary shifting of resources.<\/p>\n<p>If either situation sounds like your company, a consultant may prove to be a great fit. When starting your search, keep in mind that consultants often position themselves as one of the following:<\/p>\n<ul>\n<li>CRM-specific consultants<\/li>\n<li>IT consultants (CRM agnostic)<\/li>\n<li>Sales process consultants<\/li>\n<\/ul>\n<p>If you&#8217;ve chosen a very complex CRM system, it may be wise to partner with a certified consultant. Keep in mind, however, that certified specialists tend to charge very expensive hourly rates.<\/p>\n<p>Also, be sure to ask plenty of questions when interviewing candidates. If you need technical support, a sales consultant would not be the best fit. Likewise, if you were looking to scale your lead management, an IT consultant would be a poor choice. Understand your own needs first, then you&#8217;ll be able to find a good match.<\/p>\n<h3><strong>9. What is This Going to Cost?<\/strong><\/h3>\n<p>Some CRMs make you jump through hoops just to get a quote. Others publish pricing on their websites, but they fail to include detailed feature explanations. For these reasons, it can sometimes be challenging to estimate the true cost.<\/p>\n<p>Look for vendors that offer transparent pricing <u>and<\/u> features. Take for instance Insightly&#8217;s pricing page. Prospective customers can sign up for the free account or compare several paid plans. Most notably, the helpful &#8220;Features Included in All Plans&#8221; section lists dozens of features that are common to all accounts. Everything you need to make an informed decision is at your fingertips without ever speaking to a pushy sales rep.<\/p>\n<p>Regardless of the system you choose, you&#8217;ll also want to estimate indirect costs, such as:<\/p>\n<ul>\n<li>Consultant fees<\/li>\n<li>Training costs<\/li>\n<li>Third-party integration subscriptions<\/li>\n<li>Opportunity costs<\/li>\n<\/ul>\n<p>Compare the total cost (CRM fees + indirect costs) to the estimated benefit you hope to gain from your CRM. Hopefully the equation justifies your investment.<\/p>\n<h3><strong>10. Will This System Meet My Future Needs?<\/strong><\/h3>\n<p>Your business is not a static entity. In fact, you probably have big plans for the future.<\/p>\n<p>With this in mind, it&#8217;s important to consider if a CRM will accommodate your future needs. Does the software offer enterprise-level plans? If you doubled or tripled the number of users and records, could the system handle such growth? Does the vendor seem aggressive in its development roadmap, or does the company rarely announce new features?<\/p>\n<p>Don&#8217;t be satisfied with a CRM that only meets your needs today. CRM migration can be a messy process. While it can be done, transition costs down the road can dramatically outweigh the present cost of picking a better system from the start. Spend time reviewing your long-term goals in the context of each CRM you&#8217;re considering.<\/p>\n<h3><strong>11. How Will I Measure ROI? <\/strong><\/h3>\n<p>Gurus assert that CRM technology is a must-have for growth-minded companies. That&#8217;s great in theory, but how will you prove it to be true for your own organization?<\/p>\n<p>At a high level, CRMs are designed to help achieve two goals: increase sales and decrease the cost of acquisition. Measuring sales growth is somewhat easy—even if you&#8217;ve never used a CRM in the past. Open your accounting software and generate revenue reports for the past eight quarters. This will offer a baseline to compare against your CRM <a href=\"https:\/\/www.insightly.com\/features\/custom-business-reports-and-metrics\/?utm_medium=partner&amp;utm_campaign=swap&amp;utm_source=fundbox\" target=\"_blank\" rel=\"noopener noreferrer\">reports<\/a>.<\/p>\n<p>Measuring cost of acquisition is a little trickier. Travel costs, marketing expenses, and some labor expense categories can be important indicators to monitor. Of course, if gross sales revenue dramatically increases and overhead remains constant, one could argue that the cost-per-sale is headed in the right direction.<\/p>\n<p>Set a recurring task to regularly review ROI-focused metrics: Define milestones, set email reminders, and build links to important sales records. In doing so, you can hold your team (and yourself) accountable to ensuring maximum return on investment.<\/p>\n<h2><strong>Get Moving with a CRM<\/strong><\/h2>\n<p>Once you&#8217;ve pondered these questions, it&#8217;s probably time to get busy and test a few CRMs. Many CRMs offer a complimentary trial, which can be extremely helpful. Be sure to get the most from your trial period, include multiple stakeholders during the testing phase, and make an informed decision. Ultimately, you should go with the platform that offers the best features, provides the best room for growth, and helps everyone get more done.<\/p>\n<p>To include Insightly in your shortlist, click here for more information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You&#8217;ve decided to take the plunge and sign up for a Customer Relationship Management (CRM) system. The days of managing &#8230;<\/p>\n","protected":false},"author":50,"featured_media":6276,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,10147],"yst_prominent_words":[6805,7628,7621,7627,7625,7626,1179,7622,3475,774,7629,886,7457,1030,7623,7630,3294,2091,3080,7624],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"11 Questions to Ask Before You Choose a CRM | Fundbox Blog","yoast_meta":[{"name":"description","content":"You&#039;ve decided to take the plunge and sign up for a Customer Relationship Management (CRM) system. Here&#039;s what you should know."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"11 Questions to Ask Before You Choose a CRM | Fundbox Blog"},{"property":"og:description","content":"You&#039;ve decided to take the plunge and sign up for a Customer Relationship Management (CRM) system. Here&#039;s what you should know."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/11-questions-before-choose-crm\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/10\/shutterstock_270988835.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/10\/shutterstock_270988835.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"832"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"You&#039;ve decided to take the plunge and sign up for a Customer Relationship Management (CRM) system. Here&#039;s what you should know."},{"name":"twitter:title","content":"11 Questions to Ask Before You Choose a CRM | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/10\/shutterstock_270988835.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/11-questions-before-choose-crm\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6160"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/50"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=6160"}],"version-history":[{"count":12,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6160\/revisions"}],"predecessor-version":[{"id":16205,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6160\/revisions\/16205"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/6276"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=6160"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=6160"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=6160"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=6160"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}