{"id":6280,"date":"2016-10-25T12:00:00","date_gmt":"2016-10-25T19:00:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=6280"},"modified":"2022-06-28T07:28:37","modified_gmt":"2022-06-28T14:28:37","slug":"cash-flow-management-creative-agencies","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/cash-flow-management-creative-agencies\/","title":{"rendered":"The Creative Agency&#8217;s Guide to Cash Flow Management"},"content":{"rendered":"<p>Like all other kinds of businesses, creative agencies, which include advertising, marketing, and design firms, need access to cash in order to grow. For this reason, <strong>cash flow<\/strong>, the amount of money poured into and sent out of an organization during a fixed period of time, should be top of mind for all owners of these kinds of small businesses.<\/p>\n<p>Learn more about cash flow management for creative agencies—including how to handle the busiest and leanest times of the year—in our industry guide: <strong>The Creative Agency&#8217;s Guide to Cash Flow Management<\/strong>.<\/p>\n<h2><strong>What Does Fundbox Guide Cover?<\/strong><\/h2>\n<ul>\n<li><a href=\"#why\">What Positive Cash Flow Means<\/a>—and How to Take Advantage of It<\/li>\n<li><a href=\"#cash-flow-problems\">The Warning Signs of Financial Problems<\/a><\/li>\n<li><a href=\"#avoid-cashflow-issues\">How to Avoid and Prevent Cash Flow Issues<\/a><\/li>\n<\/ul>\n<p>Positive cash flow is critical for any small business, including creative agencies. Without access to cash, creative agencies are unable to hire additional employees to help take on ever-increasing workloads. They&#8217;re also not as flexible when it comes to being able to invest in new opportunities (e.g., partnerships or new contracts). What&#8217;s more, it can also be more difficult to procure the tools and technologies they need to produce the best work for their clients. The list goes on.<\/p>\n<p>Assuming they wish to remain competitive for the foreseeable future, creative agencies need to bring in more cash than they send out every month. Creative agencies invoice for 13% of their total annual revenue in July alone (Source: Fundbox data, 2016). Most small businesses invoice on net 30 terms, sometimes up to net 90, so July invoices may not be paid for another month or so, resulting in a cash crunch during the busiest time of the year.<\/p>\n<p>Managing cash flow during busy times can be a challenge, especially when <a href=\"https:\/\/fundbox.com\/blog\/late-payments?utm_source=blog&amp;utm_medium=content&amp;utm_campaign=cash-flow-management-creative-agencies\" target=\"_blank\" rel=\"noopener noreferrer\">64% of small businesses are affected by late payments<\/a>. Unfortunately, it&#8217;s difficult to manage cash flow during the quieter months too: In November, the least busy month all year, creative agencies invoice for only about 6% of annual revenue. With a lower amount in accounts receivables, late payments can cause quite a bit of stress for small business owners—especially when nearly 50% of outgoing expenses are paid from August to October (Source: Fundbox data, 2016).<\/p>\n<p>The good news is that by taking a proactive stance and devoting adequate resources to <strong>cash flow management<\/strong>—i.e., forecasting future finances and understanding potential remedies for money shortages—small creative agencies are able to reclaim control of their financial situations and increase the chances they&#8217;ll have enough money on hand to grow their operations.<\/p>\n<h2><strong><a name=\"why\"><\/a>Why Positive Cash Flow Is Important<\/strong><\/h2>\n<p>Virtually everyone would be happy to have more money in their personal bank account. Money makes it easier to pay the mortgage, spring for top-shelf groceries, go out to eat, and travel to new places. Having enough cash means you can stop worrying about the need-to-haves and start considering the nice-to-haves.<\/p>\n<p>The same principle holds true in the business world. Creative agencies that have positive cash flow have no problem:<\/p>\n<ol>\n<li>\n<h3><strong>Pursuing new opportunities<br \/>\n<\/strong><\/h3>\n<p>Let&#8217;s say your small agency just landed a huge contract with a major Fortune 500 company. There&#8217;s only one issue: Your staff is overworked as it is. You can&#8217;t simply add more work to everyone&#8217;s plates and hope for the best; you need extra workers to get the job done. When cash flow is strong, you can hire additional personnel or leverage a network of freelance copywriters, SEM and SEO professionals, or graphic designers to accommodate the needs of new clients without alienating existing customers.<\/li>\n<li>\n<h3><strong>Keeping current with financial obligations<br \/>\n<\/strong><\/h3>\n<p>As any small business owner will tell you, it&#8217;s almost as if a new batch of invoices wills itself into existence the moment you think you&#8217;re caught up with bills. When cash is tight, it&#8217;s much harder for creative agencies to pay all of their bills—rent, electricity, insurance, salaries, utilities, taxes, and more—in a timely manner. On the other hand, with cash in the bank, agencies don&#8217;t have to worry about where they&#8217;ll find money to meet these obligations each month.<\/li>\n<li>\n<h3><strong>Buying new equipment, supplies, property and technologies<br \/>\n<\/strong><\/h3>\n<p>Creative agencies can&#8217;t meet their customers&#8217; demands if they&#8217;re using outdated technologies and equipment. With access to cash, owners are able to ensure their teams are utilizing the latest tools and technologies that enable them to produce at the highest level. What&#8217;s more, owners of agencies might not be too keen on paying rent every month. With money in the bank, agencies can even consider buying property and becoming their own landlords.<\/li>\n<li>\n<h3><strong>Launching new marketing campaigns<br \/>\n<\/strong><\/h3>\n<p>Want to get new clients? Word of mouth will only get you so far. From time to time, creative agencies need to invest in ad campaigns to expand their customer base. While marketing expenses may not be as &#8220;essential&#8221; as making payroll and keeping up with utility bills, there&#8217;s no shortage of competition among agencies. Neglecting marketing spend is an easy way to hamstring growth.<\/li>\n<li>\n<h3><strong>Remodeling existing office space or opening additional locations<br \/>\n<\/strong><\/h3>\n<p>Agencies are only as strong as the talent that drives them. If you&#8217;ve got a dilapidated office or you&#8217;re holed up in an unattractive locale, there&#8217;s a good likelihood you&#8217;re turning at least some top talent away. Strong cash flow enables you to build the best office in the best location. Already like your setup? Use your cash to open a similarly awesome satellite office to expand your footprint even further.<\/li>\n<\/ol>\n<p>As demonstrated, strong cash flow helps creative agencies reach the next level. Unfortunately, despite the fact that many small business owners are aware of the importance of cash flow management, <a href=\"http:\/\/time.com\/money\/3888448\/cash-flow-small-business-startups\/\" target=\"_blank\" rel=\"noopener noreferrer\">29% of new companies<\/a> are forced to close their doors for good due to money shortages.<\/p>\n<p>Is your creative agency dealing with cash flow problems? Better yet, do you even know the state of your cash flow?<\/p>\n<h2><strong><a name=\"cash-flow-problems\"><\/a>Signs of Cash Flow Problems<\/strong><\/h2>\n<p>There are a number of reasons creative agencies run into cash flow problems. Money troubles may be around the corner if you&#8217;re:<\/p>\n<ul>\n<li>\n<h3><strong>Struggling to pay bills<br \/>\n<\/strong><\/h3>\n<p>Do you routinely struggle every month to piece together the funds you need to pay suppliers and vendors? If so, cash flow problems have come home to roost.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Stacking up unpaid invoices<br \/>\n<\/strong><\/h3>\n<p>While a fattened receivables account might look nice on your balance sheet, your cash flow can suffer if your customers aren&#8217;t settling their bills on time. According to our research, <a href=\"https:\/\/fundbox.com\/blog\/late-payments?utm_source=blog&amp;utm_medium=content&amp;utm_campaign=cash-flow-management-creative-agencies\" target=\"_blank\" rel=\"noopener noreferrer\">64% of small businesses<\/a> regularly have to deal with late-paying customers. If you notice a bunch of unpaid invoices piling up, cash flow problems may be right around the corner.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Amassing credit card debt<br \/>\n<\/strong><\/h3>\n<p>If you&#8217;ve put a lot of charges on your business credit card—or personal credit card—lately and don&#8217;t plan on making payments to your account anytime soon, you likely have cash flow problems. Interest adds up quickly, particularly on credit cards.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Writing checks that bounce<br \/>\n<\/strong><\/h3>\n<p>Did you just write a check that didn&#8217;t clear? If so, it&#8217;s time to reassess your cash flow situation.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Struggling to take advantage of new opportunities<br \/>\n<\/strong><\/h3>\n<p>When presented with a new business opportunity, are you excited? Or do you dread the fact you have to take a peek at your financials to see whether it&#8217;s feasible? If you&#8217;re routinely having a difficult time pursuing new opportunities, your cash situation is less than ideal.<\/li>\n<\/ul>\n<p>Now that you know the benefits associated with masterfully managing your cash flow and you&#8217;re aware of the symptoms that might indicate cash gaps are in your future, let&#8217;s take a look at what you can do to avoid cash flow problems in the first place.<\/p>\n<h2><strong><a name=\"avoid-cashflow-issues\"><\/a>How to Avoid Cash Flow Problems<\/strong><\/h2>\n<p>Believe it or not, cash flow problems are largely preventable. Sure, if no one is buying your products or using your services, you will soon start struggling financially. However, as long as you have a steady stream of revenue, you may be able to sidestep cash gaps altogether with proper cash flow management.<\/p>\n<p>There are many tactics creative agencies can use to avoid cash flow problems. Here are a few:<\/p>\n<ul>\n<li>\n<h3><strong>Budget as meticulously as you can<br \/>\n<\/strong><\/h3>\n<p>Plan ahead of time, and you&#8217;ll reduce the likelihood your financial situation will ever surprise you. You should place a high priority on cash flow management and start forecasting your agency&#8217;s financial situation well in advance. Most likely you&#8217;ll want to look three or six months into the future. These forecasts may not be completely accurate, but they should give you a pretty good idea of where you stand. In any event, just remember the further out you forecast, the less accurate your findings will likely be.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Take advantage of payment discounts<br \/>\n<\/strong><\/h3>\n<p>Many vendors offer businesses payment discounts if they settle their bills promptly. If the ones you work with offer a 2% discount if payments are made within 10 days (e.g., 2\/10 n\/30), by all means take advantage of the opportunity.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Shop suppliers and vendors<br \/>\n<\/strong><\/h3>\n<p>Are you getting the best prices on your cloud infrastructure? If you&#8217;re in a state that has deregulated energy, have you shopped suppliers to see whether you can shave anything off your bills? Get into the habit of comparing vendors&#8217; prices at regular intervals to minimize your expenses.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Change your approach to invoicing<br \/>\n<\/strong><\/h3>\n<p>Do you usually wait until the end of the month to invoice your clients? Whenever possible, try to send out invoices out moment you&#8217;ve finished the project. That should accelerate payments by at least a little bit.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Use a flexible business financing service like Fundbox<br \/>\n<\/strong><\/h3>\n<p>Instead of letting your unpaid invoices collect dust, you can utilize modern financial services to solve your cash flow problems. For example, you can use <a href=\"https:\/\/fundbox.com?utm_source=blog&amp;utm_medium=content&amp;utm_campaign=cash-flow-management-creative-agencies\" target=\"_blank\" rel=\"noopener noreferrer\">Fundbox<\/a>, a fast financing solution for small business that offers same date credit line with next day financing for qualified small businesses. You can then choose a 12 or 24-week repayment schedule, repaying a portion of the advance plus a small fee between 0.4%-0.8% per week.<\/li>\n<\/ul>\n<ul>\n<li>\n<h3><strong>Raise your prices<br \/>\n<\/strong><\/h3>\n<p>While you might think charging more for your services will discourage your customers, every business needs to raise its prices from time to time in order to keep pace with inflation. Just ask your cable company. So long as you&#8217;re not proposing massive increases and continue to deliver high-quality content and services, a vast majority of your clients will stick around. Just don&#8217;t do it every month—or even every year.<\/li>\n<\/ul>\n<p>There&#8217;s no sense in making it harder than it needs to be for your creative agency to succeed. A few changes here and there can go a long way toward ensuring your small business always has a strong financial footing.<\/p>\n<p>By understanding the importance of cash flow management, being aware of what signs indicate cash shortages may be on the horizon, and knowing which tools and tactics are at your disposal to plug cash gaps, your creative agency will be much better positioned to produce the best work possible for even more clients. It&#8217;s as simple as that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Like all other kinds of businesses, creative agencies, which include advertising, marketing, and design firms, need access to cash in &#8230;<\/p>\n","protected":false},"author":14,"featured_media":6294,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532,11503],"yst_prominent_words":[2380,2372,2376,2374,713,2360,705,2359,2368,2382,2367,714,2386,2379,2375,2397,2377,2381,2378,2383],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Cash Flow Management for Creative Agencies","yoast_meta":[{"name":"description","content":"Creative agencies, which include advertising, marketing, and design firms, need access to cash in order to grow—that&#039;s why cash flow management is key."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Cash Flow Management for Creative Agencies"},{"property":"og:description","content":"Creative agencies, which include advertising, marketing, and design firms, need access to cash in order to grow—that&#039;s why cash flow management is key."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/cash-flow-management-creative-agencies\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/10\/shutterstock_301323515.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/10\/shutterstock_301323515.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Creative agencies, which include advertising, marketing, and design firms, need access to cash in order to grow—that&#039;s why cash flow management is key."},{"name":"twitter:title","content":"Cash Flow Management for Creative Agencies"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/10\/shutterstock_301323515.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/cash-flow-management-creative-agencies\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6280"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=6280"}],"version-history":[{"count":17,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6280\/revisions"}],"predecessor-version":[{"id":16406,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6280\/revisions\/16406"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/6294"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=6280"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=6280"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=6280"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=6280"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}