{"id":6340,"date":"2018-07-24T11:35:13","date_gmt":"2018-07-24T18:35:13","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=6340"},"modified":"2020-11-10T13:11:01","modified_gmt":"2020-11-10T21:11:01","slug":"8-reasons-small-business-loan-rejected","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/8-reasons-small-business-loan-rejected\/","title":{"rendered":"8 Reasons Your Small Business Loan Was Rejected"},"content":{"rendered":"<p>For some business owners, it’s a nightmare scenario: You were counting on getting that small business loan, but the bank said no. What do you do next?<\/p>\n<p>That depends on exactly why your loan application was rejected! Step one: find out the reason for the denial. Some bankers will be more specific while others won&#8217;t share details, but by law, banks must mail you a notice explaining the reason\/reasons why your loan application was denied.<\/p>\n<p>If this has happened to you recently, you might be quite discouraged right about now. Don’t feel down! It happens to many successful owners, sometimes more than once. Understanding the reasons why is the first step to a successful future financing application.<\/p>\n<p>Here are some of the most common reasons for a business loan rejection.<\/p>\n<h2><b>8 Common Reasons for Small Business Loan Rejection<\/b><\/h2>\n<h2>1. Your credit score<\/h2>\n<p>One of the most common reasons for loan rejection is if the lender deems your credit score to be “too low.” The magic score number will differ depending on the lender and situation. Your personal credit score does factor into a small business loan, even if your company has been in business for a while. If you can&#8217;t manage your personal credit, the logic goes, how reliable will you be when it comes to paying back a business loan?<\/p>\n<p>If a low credit score is the reason you are turned down, review your score and take steps to repair it. It’s a good idea to brush up on what goes in to your personal and <a href=\"https:\/\/fundbox.com\/blog\/are_you_a_credit_risk_what_goes_into_your_business_credit_score\/\">business credit score<\/a>, too, so you understand how you are being evaluated. If you have a successful business, but had to damage your personal credit to build it, you’re not alone. Take heart: there are more options out there for you than ever before.<\/p>\n<h2>2. Not enough time in business<\/h2>\n<p>If your business is relatively new, you may not have built up enough of a business credit history to qualify for a small business loan. Note that vendors don&#8217;t always report your payments to the business credit agencies automatically. Whenever you set up an account with a new supplier or other vendor, make sure they report your payments so your business can build up a good credit history.<\/p>\n<p>Of course, it’s possible to have a very successful business and solid financials, even if you haven’t been operating very long—you just need to find the right lender for your situation. Some lenders require much more time in business than others, so take a look at your options when deciding where to apply for business credit. For example, <a href=\"https:\/\/app.fundbox.com\/signup\">Fundbox<\/a> suggests that you have 3 months worth of business transaction history when you apply.<\/p>\n<h2>3. Your industry is “risky”<\/h2>\n<p>Some industries are simply considered “risky” by traditional lenders. Restaurants are a good example because they have a high failure rate. If your business operates in certain “vice” industries, such gambling, you may also face extra hurdles to getting a loan. If this is why you were rejected, investigate lenders who specialize in your industry—they&#8217;re out there.<\/p>\n<h2>4. You don’t have enough collateral<\/h2>\n<p>Many traditional lenders require you put down collateral in order to obtain a business loan. If you don&#8217;t have enough collateral or lack the right type of collateral, you may get turned down. If this is your situation, look for alternative sources of financing such as unsecured loans. With <a href=\"https:\/\/app.fundbox.com\/signup\">Fundbox<\/a>, you don’t need collateral to be considered for credit.<\/p>\n<blockquote><p>Want to learn more about collateral and the difference between secured and unsecured loans? Check out our comprehensive <a href=\"https:\/\/fundbox.com\/resources\/guides\/secured-vs-unsecured-business-loans\/\">guide to Secured vs. Unsecured Business Loans<\/a>.<\/p><\/blockquote>\n<h2>5. Your debt utilization is too high (or not high enough)<\/h2>\n<p>Typically, lenders want you to be using no more than 30 percent of the total credit available to you. If you use too much, many lenders consider you to be overextended, and worry that you won&#8217;t be able to pay them back. For example, if you have a $100,000 line of credit, but have already used $90,000 of that line, you&#8217;re considered a higher risk.<\/p>\n<p>On the other hand, if you don’t have any debt, or lack a history of using credit responsibly, that can count against you, too. Make sure to keep track of your total credit limits, including business credit cards, personal credit cards, lines of credit, and other credit sources, and maintain a reasonable debt usage.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9631\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_410714692.jpg\" alt=\"Business credit cards\" width=\"600\" height=\"429\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_410714692.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_410714692-768x549.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2>6. Not enough evidence of strong cash flow<\/h2>\n<p>Cash flow is one of the first things lenders look at when deciding whether to approve a small business loan. They want to know that you have enough cash flow to not only cover your business expenses, but also pay back the loan and still have a cushion. If your cash flow is spotty, or you regularly experience seasonal slumps, that can be a red flag.<\/p>\n<p>Poor cash flow is a major cause of business failure, so if this is why your loan application was rejected, you might need to examine your cash management skills. Use accounting software that enables you to easily generate cash flow reports and projections; then, monitor your cash flow weekly to stay on top of it. Be diligent about collecting payments due from customers—don&#8217;t let invoices drag out to 60, 90, or 120 days past due.<\/p>\n<p>If you struggle with cash flow issues, check out these <a href=\"https:\/\/fundbox.com\/blog\/10-tips-to-get-paid-faster\/\">10 tips for getting paid faster<\/a>, these ideas for <a href=\"https:\/\/fundbox.com\/blog\/how-to-handle-late-paying-customers\/\">how to handle late-paying customers<\/a>, and this <a href=\"https:\/\/fundbox.com\/blog\/how-to-design-invoices-that-get-paid-faster\/\">guide to designing invoices that get noticed<\/a>.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9630\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_417073792-1.jpg\" alt=\"Business owner reviewing invoices\" width=\"600\" height=\"401\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_417073792-1.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_417073792-1-768x513.jpg 768w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<h2>7. You’re not asking for <i>enough<\/i> money<\/h2>\n<p>It sounds counter-intuitive, but often, the more money you ask for, the more likely you are to obtain a bank loan. For banks, the cost of servicing small loans (under $100,000) is just not worth it, which is why you generally can’t get business loans for small amounts of money from a major bank.<\/p>\n<p>Review your financial projections and business plan to make sure you&#8217;re not underestimating the amount of capital you need. Perhaps you can apply again and ask for a larger sum. If you don&#8217;t need more than you already asked for, look for an alternative financing source, such as a micro-lender or<a href=\"https:\/\/fundbox.com\/pricing\/?utm_source=blog&amp;utm_medium=content&amp;utm_campaign=8-reasons-small-business-loan-rejected\"> invoice-based financing option<\/a> that can make smaller loans. Consider options beyond loans, too, if you need funding but don’t need a large lump sum, like a small business <a href=\"https:\/\/fundbox.com\/resources\/guides\/lines-credit\/\">line of credit<\/a>.<\/p>\n<h2>8. Incomplete application\/paperwork<\/h2>\n<p>Sadly, one of the most common reasons small business loan applications are denied is that the applicant didn&#8217;t complete the application correctly or didn&#8217;t provide all the necessary backup information. It’s hard to blame you if this is the reason you were denied: business owners often spend 20, 30, or even more hours on a loan application!<\/p>\n<p>Among the supporting documents most banks will ask for are a business plan, three to five years of business and personal tax returns, business bank account statements, financial statement\/projections for the business, and your personal and business credit reports. They may also want to see legal documents related to your business such as contracts, leases, licenses, permits, and corporate documents. The fix for this problem is easy: Get your paperwork in order before applying again.<\/p>\n<p>If you are interested in business financing but you don’t have 30+ hours to kill on paperwork, check out some of the modern fintech options out there. With Fundbox, you can <a href=\"https:\/\/app.fundbox.com\/signup\">apply for credit<\/a> online, with zero paperwork required.<\/p>\n<p>Getting rejected for a business loan when you need financing is one of the worst feelings ever. Remember, though, it’s not personal, and you can try again. After you get past the initial frustration, though, it can be a learning experience, and prepare you for success next time.<\/p>\n<p>&nbsp;<\/p>\n<p><em>Got rejected and still trying to figure out why? <a href=\"https:\/\/fundbox.com\/blog\/4-surprising-reasons-why-you-were-rejected-for-a-business-loan\/\">Here are 4 more surprising reasons.<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For some business owners, it’s a nightmare scenario: You were counting on getting that small business loan, but the bank &#8230;<\/p>\n","protected":false},"author":18,"featured_media":9632,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532,426],"yst_prominent_words":[1721,1704,9164,719,3202,713,7668,739,1142,1529,3030,2046,9165,2933,2931,1693,7667,712,1705,9102],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"8 Reasons Your Small Business Loan Was Rejected | Fundbox Blog","yoast_meta":[{"name":"description","content":"You were counting on getting that small business loan, but the bank said no. What do you do next? First, figure out why you were rejected."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"8 Reasons Your Small Business Loan Was Rejected | Fundbox Blog"},{"property":"og:description","content":"You were counting on getting that small business loan, but the bank said no. What do you do next? First, figure out why you were rejected."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/8-reasons-small-business-loan-rejected\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_700061587.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_700061587.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"You were counting on getting that small business loan, but the bank said no. What do you do next? First, figure out why you were rejected."},{"name":"twitter:title","content":"8 Reasons Your Small Business Loan Was Rejected | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/11\/shutterstock_700061587.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/8-reasons-small-business-loan-rejected\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6340"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=6340"}],"version-history":[{"count":14,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6340\/revisions"}],"predecessor-version":[{"id":14081,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6340\/revisions\/14081"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9632"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=6340"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=6340"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=6340"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=6340"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}