{"id":6586,"date":"2016-12-08T07:00:00","date_gmt":"2016-12-08T14:00:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=6586"},"modified":"2019-01-29T15:57:40","modified_gmt":"2019-01-29T23:57:40","slug":"when-to-hire-a-bookkeeper","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/when-to-hire-a-bookkeeper\/","title":{"rendered":"When to Hire a Bookkeeper"},"content":{"rendered":"<p>When you&#8217;re just starting out in business and your monthly transactions are minimal, it&#8217;s easy enough to handle the books yourself without hiring a bookkeeper. As your business grows, however, and your time is split across a long list of To Dos, you&#8217;ll need to decide when to bring on additional bookkeeping support.<\/p>\n<p>The right time to invest in a bookkeeper for your business depends on multiple factors: the amount of time you have to spare, the size of your business, the volume of your monthly transactions, how comfortable you are overseeing the books (and not making mistakes). How much you can afford to invest in bookkeeping support will also determine which option works for your needs.<\/p>\n<p>To help you decide when to hire a bookkeeper, let&#8217;s run through all of the ways you can get your books done each month, and investigate the pros and cons of each method.<\/p>\n<h2><strong>DIY Bookkeeping<\/strong><\/h2>\n<p>When your business is just starting out, doing the books yourself is a smart, cost-effective solution. The DIY method is generally the best approach to bookkeeping when:<\/p>\n<ul>\n<li>Your business uses <a href=\"https:\/\/bench.co\/syllabus\/accounting\/cash-accounting-vs-accrural-accounting\/?utm_source=fundbox&amp;utm_medium=GuestPost&amp;utm_campaign=hireabookkeeper\" target=\"_blank\">cash basis rather than accrual<\/a> accounting; cash basis is simpler.<\/li>\n<li>You either have experience with bookkeeping, or you&#8217;re willing to learn quickly.<\/li>\n<li>You have the time and money to <a href=\"https:\/\/heimdalsecurity.com\/blog\/online-financial-security-guide\/\" target=\"_blank\">secure your financial data<\/a> against threats.<\/li>\n<\/ul>\n<p>Tracking your expenditures and managing your books using basic accounting software or even a simple spreadsheet will help keep overhead cost to a minimum.<\/p>\n<p>The biggest advantage of self-managing the books during the early stages of your business&#8217;s growth is that you&#8217;ll build an innate understanding of where your business is spending money, and you&#8217;ll learn how seasonality and other trends affect your business&#8217;s financial progress.<\/p>\n<p>The catch is that if you don&#8217;t know what you&#8217;re doing and you make a mistake (by incorrectly reporting revenue, not tracking the right expenses, or incorrectly categorizing), DIY bookkeeping can end up costing you. Expensive mistakes—such as forgetting to track tax-deductible expenses, incorrectly categorizing expenses, or making errors that your CPA will charge you to rectify before they file your taxes—are easy to make when you lack bookkeeping experience. Also, what you don&#8217;t lose in money, you may lose in time. Running your own business makes for a busy schedule.<\/p>\n<p>It&#8217;s up to you whether the time you spend managing your company&#8217;s books, time that will increase the more the business grows, is a smart use of your time.<\/p>\n<h2><strong>Outsourced Bookkeeping<\/strong><\/h2>\n<p>As your business grows, you&#8217;ll reach a point where time constraints or the sheer volume of your monthly bookkeeping means that it isn&#8217;t feasible or smart to do the books yourself.<\/p>\n<p>This is where outsourcing the task to an online bookkeeper or online bookkeeping service proves handy. It&#8217;s common for companies see their <a href=\"http:\/\/www.huffingtonpost.com\/jared-hecht\/the-costbenefit-of-hiring_b_9080272.html\" target=\"_blank\">costs decrease<\/a> after they hire bookkeepers; the cost benefit is that it&#8217;s more cost-effective to pay a bookkeeper or bookkeeping service than it is to occupy your personal working hours with bookkeeping tasks.<\/p>\n<p>Outsourcing your books to a firm or an online service is a good option when:<\/p>\n<ul>\n<li>You don&#8217;t have the time to self-manage your books<\/li>\n<li>You don&#8217;t have the budget to hire an in-house bookkeeper<\/li>\n<\/ul>\n<p>So, who should you outsource to? You have a few options to choose from:<\/p>\n<ol>\n<li>\n<h3><strong>Online Bookkeeping Service<br \/>\n<\/strong><\/h3>\n<p>An online bookkeeping service typically marries a cloud-based software interface with the assistance of professional bookkeepers who do your bookkeeping for you (in the interest of full disclosure, <a href=\"https:\/\/bench.co\/?utm_source=fundbox&amp;utm_medium=GuestPost&amp;utm_campaign=hireabookkeeper\" target=\"_blank\">Bench<\/a> is an online bookkeeping service). This option is often less expensive than hiring a freelancer or a firm, and because it&#8217;s a monthly online subscription, you don&#8217;t have to worry about dealing with the same paperwork you&#8217;d arrange when you work with independent contractors and employees. Generally, online bookkeeping services are a good option if you&#8217;re ready to move beyond DIY, you&#8217;re comfortable with secure cloud accounting, and you want to be able to chat with your bookkeeper and monitor your finances closely from your computer or smart device at any time.<\/li>\n<li>\n<h3><strong>Freelancer<br \/>\n<\/strong><\/h3>\n<p>A freelance bookkeeper is typically engaged with either an hourly or a fixed rate. They may work remotely or online. Local freelancers can visit your office to deal with paperwork in person. They can be found online through freelance sites such as <a href=\"https:\/\/www.upwork.com\/\" target=\"_blank\">Upwork<\/a> or in local business listings.<\/li>\n<li>\n<h3><strong>Local Firm<br \/>\n<\/strong><\/h3>\n<p>Firms are typically more expensive than freelancers or online services. They may guarantee their services, including a certain amount of minimum experience among their staff. While bookkeeping firms may be remote-based, the advantage of hiring a local firm is that you can visit them in-person, if this is important for your needs.<\/li>\n<\/ol>\n<p>Of the above, the best advice is to find a reliable bookkeeper who has experience servicing clients in your niche. A bookkeeper who only has experience doing the books for landscaping companies, for instance, may have difficulty transitioning to bookkeeping for eCommerce.<\/p>\n<p>When it comes to outsourcing to a local firm or an online freelancer, you have a wide range of choices, and results may vary. It&#8217;s up to you to find a reliable bookkeeper who has experience working with clients in your industry. Prices will vary for each of these options, so shop around and compare packages.<\/p>\n<p>Keep in mind that if you choose to pursue an outsourced bookkeeping option, you should never hand over control of your treasury functions. That is, when it comes to investing, signing checks, or making online payments or wire transfers, you should be the sole authority.<\/p>\n<h2><strong>Hire an In-House Bookkeeper<\/strong><\/h2>\n<p>If your business grows so large that its bookkeeping needs are more than a freelance bookkeeper can handle, you&#8217;re ready to hire a bookkeeper to join your staff. This can be on either a full-time or part-time basis.<\/p>\n<p>According to <a href=\"https:\/\/www.entrepreneur.com\/article\/219917\" target=\"_blank\">Entrepreneur.com<\/a>, hiring an in-house bookkeeper is a smart approach when:<\/p>\n<ul>\n<li>Your annual revenue exceeds $1 million<\/li>\n<li>You have more than 30 employees<\/li>\n<\/ul>\n<p>You should also do the math and confirm that hiring a full-time bookkeeper is within your means. In 2012, <a href=\"http:\/\/work.chron.com\/pay-rate-certified-bookkeeper-10943.html\" target=\"_blank\">projected annual earnings for bookkeepers ranged anywhere from $35,700 to $50,050<\/a>.<\/p>\n<p>If you want in-house support but your business&#8217;s bookkeeping needs don&#8217;t quite warrant the attention of a full-time bookkeeper, a good approach is to bring someone on part-time, then increase their hours to full-time when the workload justifies it. Some business owners combine part-time bookkeeping with an administrative role to create one full-time position.<\/p>\n<p>Even if you happen to be one of those rare business owners who enjoys doing their books, focusing on bookkeeping may not always be the most strategic way to use of your time. With bookkeeping crossed off your to-do list, you&#8217;ll have more time to focus on the big picture and your company&#8217;s growth.<\/p>\n<p>Whichever option you choose, remember: Even if you decide to hire a pro to handle the books, you should always maintain some level of involvement with them. Read your monthly reports when they come in, be aware of how money is flowing into and out of your business, and keep up-to-date on cash flow, seasonality, and other trends that affect your finances. Manage that, and you&#8217;ll have a much better shot at making moves that help your business succeed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you&#8217;re just starting out in business and your monthly transactions are minimal, it&#8217;s easy enough to handle the books &#8230;<\/p>\n","protected":false},"author":49,"featured_media":6718,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,11532],"yst_prominent_words":[7531,6376,7758,5279,723,7760,7765,7757,7761,7767,7766,7756,7764,7763,870,7759,7755,3300,7762,3453],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"When to Hire a Bookkeeper | Fundbox Blog","yoast_meta":[{"name":"description","content":"To help you decide when to hire a bookkeeper, here are all the ways you can get your books done each month, and the pros and cons of each method."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"When to Hire a Bookkeeper | Fundbox Blog"},{"property":"og:description","content":"To help you decide when to hire a bookkeeper, here are all the ways you can get your books done each month, and the pros and cons of each method."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/when-to-hire-a-bookkeeper\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/12\/shutterstock_338731511.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/12\/shutterstock_338731511.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"674"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"To help you decide when to hire a bookkeeper, here are all the ways you can get your books done each month, and the pros and cons of each method."},{"name":"twitter:title","content":"When to Hire a Bookkeeper | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2016\/12\/shutterstock_338731511.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/when-to-hire-a-bookkeeper\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6586"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/49"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=6586"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6586\/revisions"}],"predecessor-version":[{"id":6656,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/6586\/revisions\/6656"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/6718"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=6586"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=6586"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=6586"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=6586"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}