{"id":675,"date":"2014-09-03T10:08:38","date_gmt":"2014-09-03T17:08:38","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=675"},"modified":"2020-11-11T13:19:40","modified_gmt":"2020-11-11T21:19:40","slug":"avoid-bankruptcy-grow-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/avoid-bankruptcy-grow-business\/","title":{"rendered":"How to Avoid Bankruptcy and Grow Your Business!"},"content":{"rendered":"<p>Today’s economy is much improved from the days of the recession, but it is still a treacherous place for small businesses. Even the most seasoned businessman can be caught off guard by the rapidly changing times, technology, and stock market. Avoid bankruptcy and possible failure  by carefully considering these 4 major problem areas for small businesses.<\/p>\n<p><b>1<\/b><strong>. Budgeting For All Expenses<\/strong><br \/>\nThe absolute main reason businesses fail is they mismanage their funds. No more cash left, no more business. Small businesses need to think long term to plan for unexpected expenses, or expenses that occur infrequently like the building repair costs, storm damage, or seasonable clean up (especially for winter climates). Without preparation, infrequent expense can put you between a rock and a hard place: You’ll either have to go over budget (or funds!) and borrow, or delay the expense. Beware: delaying seasonal expenses like repairs will lower the visual appeal of your business, which could hurt sales, and may even result in fines from your local ordinance.<\/p>\n<p><strong>Advice:<\/strong> While taking your regular monthly expenses, make sure you are also putting funds away for your quarterly, seasonal, or annual expenses, as well as additional funds for more general, unexpected expenses. Write out all of the possible infrequent expenses to make them a part of your regular budget. Be very conservative with your profit margin, and always make sure you have a <a href=\"https:\/\/blog.fundinggates.com\/2012\/08\/cash-flow-management\/\">“cash cushion”<\/a>.<\/p>\n<p><strong>2. Excessive Expenses<\/strong><br \/>\nYour regular expenses could be dragging you down more than you realized. Small business owners need to make sure they properly evaluate all expenses, like rent, materials, or even labor costs. If you’re not getting a good “bang for your buck”, that buck is wasted. Many small businesses establish a supplier contract or a credit account and then forget about it, but the economy changes frequently, which causes the value of your expenses to decrease or increase as well. Changing interest rates and property values are a significant reason small businesses run into financial strain. Research your area’s rent value very carefully, and make sure you aren&#8217;t paying more than the actual worth of a “good location” or an attractive storefront.<\/p>\n<p><strong>Advice:<\/strong> On a monthly or quarterly basis, thoroughly look over all your expenses, contracts, and employee evaluations to ensure you’re getting the value to justify the expense. Renegotiate supplier contracts, reduce your interest rates, and price compare on everything. Compromise is key for early small businesses- you can always upgrade your amenities down the road, when your profit margin is stronger.<\/p>\n<p><strong>3. Protecting Your Data<\/strong><br \/>\nData breaches are the new reality of today’s business world. Protecting customers’ data isn’t just for the big corporations anymore- there are plenty of small time crooks looking to make a few hundred from your smaller data set. Data breaches can be dire for small companies who depend on their customers’ trust much more so than bigger chains. In small communities, a data breach can leave a lasting bad impression and could not only prevent you from retaining current customers, but also acquiring new ones!<\/p>\n<p><strong>Advice:<\/strong> Change all your accounts over to strong passwords, immediately. If the site allows it, make use of two-factor authentication systems for every account that you can (requires two passwords or verifications instead of one). Data protection software is also well worth the cost. Install “wipe clean” software on all the <a href=\"https:\/\/blog.fundinggates.com\/2013\/03\/byod\/\">mobile devices<\/a> used by members of your company. All remote employees should be connecting through a secure virtual private network, or VPN. If you data is particularly precious, consider working with a reputable firm to do periodic penetration testing of your network to identify problems.<\/p>\n<p><strong>4. Unexpected Growth &amp; Spikes in Business<\/strong><br \/>\nIt may seem paradoxical, but one of the most common reasons small businesses fail is they are unprepared for large spikes in business. Large inventory purchases can easily overextend a business past its breaking point. In today’s digital world of viral videos and Facebook posts, the likelihood of sudden business is actually more likely than ever before.<\/p>\n<p><strong>Advice:<\/strong> It may seem like day dreaming, but take the time to create a “what if” plan so you can be prepared. Plan out possible large inventory purchases, and factor what your budgeting limits will be under a variety of circumstances.  It will serve you well to work out limits and a contingency plan ahead of time so you won’t overextend yourself during the rush and excitement of a spike in businesses. These real-world lessons are particularly valuable to small businesses to avoid bankruptcy, which have tighter budgets and only last 5 years or more 50% of the time. These common issues are often overlooked, but have dramatic impacts on your businesses. The most important thing a small business owner can do to avoid failure is to remain vigilant and informed. There is simply no better adage than “Knowledge is power.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today’s economy is much improved from the days of the recession, but it is still a treacherous place for small &#8230;<\/p>\n","protected":false},"author":19,"featured_media":676,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532],"yst_prominent_words":[3493,4261,723,1132,4260,1179,4257,740,3205,1803,4256,4262,4255,3050,4258,712,1126,4254,3300,4259],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"How to Avoid Bankruptcy and Grow Your Business!","yoast_meta":[{"name":"description","content":"Even the most seasoned business can be caught off guard by changing times. Avoid bankruptcy by carefully considering these 4 major problem areas."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How to Avoid Bankruptcy and Grow Your Business!"},{"property":"og:description","content":"Even the most seasoned business can be caught off guard by changing times. Avoid bankruptcy by carefully considering these 4 major problem areas."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/avoid-bankruptcy-grow-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/09\/bankruptcy.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/09\/bankruptcy.jpg"},{"property":"og:image:width","content":"400"},{"property":"og:image:height","content":"250"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Even the most seasoned business can be caught off guard by changing times. Avoid bankruptcy by carefully considering these 4 major problem areas."},{"name":"twitter:title","content":"How to Avoid Bankruptcy and Grow Your Business!"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/09\/bankruptcy.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/avoid-bankruptcy-grow-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/675"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/19"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=675"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/675\/revisions"}],"predecessor-version":[{"id":14286,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/675\/revisions\/14286"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/676"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=675"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}