{"id":707,"date":"2014-10-06T12:24:20","date_gmt":"2014-10-06T19:24:20","guid":{"rendered":"http:\/\/fundbox.pantheonlocal.com\/?p=707"},"modified":"2019-01-28T18:35:04","modified_gmt":"2019-01-29T02:35:04","slug":"5-ways-scale-grow-freelance-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/5-ways-scale-grow-freelance-business\/","title":{"rendered":"5 Ways to Scale and Grow your Freelance Business"},"content":{"rendered":"<p>Freelancing is a great opportunity for skilled, hard-working, networked individuals to break into business and break free of the nine to five slog. But a freelance business has its limitations, especially when it comes to scalability. There’s only one of you, and you only get paid when you are actually freelancing. This uncertainty can be stressful and, if you’re not careful, create cash flow problems.<\/p>\n<p>So what are your options? If want to grow your freelance business and improve your bottom line, it’s time to take a look at your business model, how you do business, and how you position your services.  This involves taking a few risks, but you’ll never be able to scale without changing how you do things.<\/p>\n<p>Here are a few ideas.<\/p>\n<h2><b>Outsource (but Slowly)<\/b><\/h2>\n<p>When someone suggests outsourcing, freelancers often have several objections.  After all, no one can do what you do for your clients, right? And how could you possibly hand off your reputation for service and value to someone else?<\/p>\n<p>One way to do this is to start with the basics. For example, if you find that managing emails, polishing up PowerPoint presentations, or staying on top of administrative work is weighing you down, consider outsourcing these functions to a virtual assistant.<\/p>\n<p>If you need to outsource core work, look for someone reputable and reliable (like yourself), and offload work that can be completed with little supervision. If you’re a freelance writer for example, you may want to hang onto meaty projects like white papers or case studies, but outsource smaller tasks like creating email copy or social media posts. Once you feel comfortable, you can slowly outsource more work.<\/p>\n<p>Employing contractors is also a lot less labor intensive than hiring employees. You don’t have to worry about payroll, employment taxes, benefits, and so on.<\/p>\n<h2><b>Scale Up<\/b><\/h2>\n<p>If you feel like your outsourcing efforts are a success, then consider shifting how you position your business.  Instead of focusing on marketing what YOU do, focus on the products you and your contractor(s) deliver. If you can shift focus from you as the service provider, to the business as the service provider, your options for scaling are limitless. Whether you provide graphic design, writing, or SEO services, in this new structure emphasize the quality of the end-product, not the person who does the work.<\/p>\n<p>Again, this is not without risk, but if you can follow a linear service delivery model where there’s very little difference in the product quality output that you or your contractors deliver, there’s no limit to what you can do.<\/p>\n<h2><b>Offer Value Pricing<\/b><\/h2>\n<p>For many freelancers value pricing (pricing by the job not the hour) can boost earnings. If you can find jobs or projects that offer a lot of value to your clients and you’re efficient at delivering on these projects, you can earn a lot more than if you’d accepted the job at an hourly rate. For example, if your hourly rate is $50 and a client is willing to pay $500 for a high-value project, because you’re good at what you do you complete the work in five hours – essentially earning $100 an hour.<\/p>\n<h2><b>Offer a Commodity<\/b><\/h2>\n<p>Identify ways to grow your business by re-packaging what you do. For example, if you’re a freelance accountant or tax advisor, find ways to bundle your high-value services. The goal is to move away from made-to-order services and instead create a “package” with a strong perceived value that can be repeated and re-sold to other clients, without creating more work.<\/p>\n<h2><b>Increase your Perceived Value<\/b><\/h2>\n<p>Freelancers often get caught in a catch-22, taking on work at a lower hourly rate to get established and build a client base, but finding they’re unable to negotiate a higher rate for their freelance business, even as the nature of the work grows or relationships deepen.<\/p>\n<p>One way to break free of this cycle is to focus on finding clients who will pay more for similar work. This is definitely not impossible, especially if you’re established, you have a solid reputation, and you can show how you’ve delivered value for other clients.<\/p>\n<p>For freelancers, this often involves breaking free of the “work for hire” model. Instead of taking one-off work here and there, find ways to drive deeper relationships that create repeat business and shape what you have to offer so it creates a higher return for your clients. Here are a few ideas:<\/p>\n<ul>\n<li><b>Show that you’re committed to your client’s success<\/b>. Use your knowledge of their business goals to pitch ideas or offer advice. Offering added value can result in new business and establish you as their “go-to” freelancer.<\/li>\n<li><b>Step-up<\/b>. Find ways to take on more related projects from existing clients that involve more responsibility. For example, could you step-in as a virtual resource to cover for employees when they are on vacation or until an open position is filled? You won’t get a rate hike, but taking on other tasks will give you the opportunity to prove your value beyond what you already do and help forge deeper relationships.<\/li>\n<li><b>Be a consultant.<\/b> – Look for ways to help your clients become successful. Keep an eye on their competitors and industry trends. Is there an opportunity that you can help out with or a goal that you can help meet? If so, bring it to their attention.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Growing your freelance business may seem like a lot of work, but with a little planning you’ll find it’s easy to take on more work, bigger projects, and more clients.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Freelancing is a great opportunity for skilled, hard-working, networked individuals to break into business and break free of the nine &#8230;<\/p>\n","protected":false},"author":7,"featured_media":708,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,326],"yst_prominent_words":[4231,723,773,4232,2239,3926,3500,3613,4233,3037,4227,1030,4230,2290,4234,864,4229,2074,4228,3090],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"5 Ways to Scale and Grow a Freelance Business","yoast_meta":[{"name":"description","content":"To grow your freelance business and improve your bottom line, take a look at your business model, how you do business, and how you position your services."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"5 Ways to Scale and Grow a Freelance Business"},{"property":"og:description","content":"To grow your freelance business and improve your bottom line, take a look at your business model, how you do business, and how you position your services."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/5-ways-scale-grow-freelance-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/10\/4453018910_9d02aaf925_o.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/10\/4453018910_9d02aaf925_o.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"625"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"To grow your freelance business and improve your bottom line, take a look at your business model, how you do business, and how you position your services."},{"name":"twitter:title","content":"5 Ways to Scale and Grow a Freelance Business"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2014\/10\/4453018910_9d02aaf925_o.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/5-ways-scale-grow-freelance-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/707"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=707"}],"version-history":[{"count":1,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/707\/revisions"}],"predecessor-version":[{"id":3333,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/707\/revisions\/3333"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/708"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=707"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=707"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=707"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=707"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}