{"id":8223,"date":"2017-11-30T15:00:05","date_gmt":"2017-11-30T23:00:05","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=8223"},"modified":"2022-06-24T07:42:56","modified_gmt":"2022-06-24T14:42:56","slug":"tale-two-brokers-conversation-credit-suite-fast-capital-financing","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/tale-two-brokers-conversation-credit-suite-fast-capital-financing\/","title":{"rendered":"Tale Of Two Brokers:  A conversation with Credit Suite and Fast Capital Financing"},"content":{"rendered":"<p>Fundbox recently sat down for a conversation with Megan Christensen, Chief Operations Officer at Credit Suite, and Raymond Mejia, Managing Director at Fast Capital Financing to learn more about their work with small businesses.<\/p>\n<p><strong>Megan Christensen<\/strong> has been a strong ally for small businesses throughout her career. Her main focus is in helping owners prepare for financing and sharing her deep knowledge of the financing process to help her small business clients succeed. In her years of consulting, she has assisted more than 10,000 business clients.<\/p>\n<p><strong>Ray Mejia<\/strong> is a 14-year veteran of financial services and has worked with thousands of businesses across industries. Ray and his team of advisors commit to a holistic approach to guiding businesses seeking access to credit while keeping cash-flow in focus.<\/p>\n<p>We spoke with both of these accomplished financial services pros to learn about the common challenges they face in their work assisting small business owners. They shared a wealth of valuable tips for SMBs.<\/p>\n<table border=\"0\" width=\"100%\">\n<tbody>\n<tr>\n<td>\n<p><figure id=\"attachment_8276\" aria-describedby=\"caption-attachment-8276\" style=\"width: 200px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-8276\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Megan-Christensen.jpg\" alt=\"\" width=\"200\" height=\"200\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Megan-Christensen.jpg 306w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Megan-Christensen-150x150.jpg 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><figcaption id=\"caption-attachment-8276\" class=\"wp-caption-text\"><em>Megan Christensen, COO at Credit Suite<\/em><\/figcaption><\/figure><\/td>\n<td>\n<p><figure id=\"attachment_8277\" aria-describedby=\"caption-attachment-8277\" style=\"width: 200px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-8277\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Raymond-Mejia.jpg\" alt=\"\" width=\"200\" height=\"200\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Raymond-Mejia.jpg 237w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Raymond-Mejia-150x150.jpg 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><figcaption id=\"caption-attachment-8277\" class=\"wp-caption-text\"><em>Ray Mejia, Managing Director at Fast Capital Financing<\/em><\/figcaption><\/figure><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2>Highlights from our conversation<\/h2>\n<p><strong>Fundbox: Megan, what are some of the biggest challenges you face when servicing small-business customers?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>Megan Christensen:<\/strong><br \/>\nOur “why,” or the reason we do what we do, is to help small businesses succeed, while helping small business owners avoid some of the pitfalls many fall into.<\/p>\n<p style=\"padding-left: 30px;\">Most, if not all, issues that small businesses face involve financing. Many small business owners are not even aware of self-created issues that can harm their business until it’s too late.<\/p>\n<p style=\"padding-left: 30px;\">The top issue that we see most small-business owners create is starting their business using their own personal financing. This can affect their ability to secure business-line credit in the future. Often, small business owners don’t realize that their personal credit and business credit are linked.<\/p>\n<p style=\"padding-left: 30px;\">A second issue I see is this: When small business owners go “credit shopping,” and they inadvertently select a solution that might not be the best fit for what they’re looking to do. Many have opted for using their personal credit cards to support their business, not because it’s the best choice, but because it’s familiar and accessible at the time.<\/p>\n<p style=\"padding-left: 30px;\">In either case, our biggest challenge is helping our customers to become better educated consumers as it relates to financing. Believe it or not, many of our customers were unaware of what a business credit score is until they tried to get a line of credit and were denied.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/i.imgur.com\/srU7CTe.jpg\" alt=\"Small business challenges\" width=\"500\" \/><\/p>\n<p><strong>Ray, what are some of the biggest challenges you see with your small-business customers?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>Ray Mejia:<\/strong><br \/>\nThe biggest issue we face is that we see many applicants who take out a series of very expensive loans over short periods of time.<\/p>\n<p style=\"padding-left: 30px;\">In most cases like these, the small business owner finds out the hard way that the terms for these loans are very inflexible and not cash-flow friendly.<\/p>\n<p style=\"padding-left: 30px;\">The originators of these sorts of short-term loans don’t have a traditional underwriting process. Instead, they analyze the ability of the small business to pay the loan back quickly. Terms then focus on fast repayment, with little to no consideration on the potential business impact to cash flow.<\/p>\n<p style=\"padding-left: 30px;\">In a case like this, the business owner might take one loan to meet an urgent business need and then another loan to fill in the cash-flow gaps while repaying the first loan. Suddenly, you have a domino effect where a small business owner has several loans, using each new loan to pay off the previous loan.<\/p>\n<p style=\"padding-left: 30px;\">This nightmare scenario is, unfortunately, commonplace.<\/p>\n<p style=\"padding-left: 30px;\">Another common issue we see is the need for massive education and thought leadership. Our customers need to know what lending options are available to them, and which options are the best fit for their business.<\/p>\n<p style=\"padding-left: 30px;\">Many small business owners don’t do enough due diligence when looking to secure a line of credit. Later, they end up regretting their decision after they&#8217;ve committed to a loan.<\/p>\n<p style=\"padding-left: 30px;\">We don’t want our customers to take a loan just because it provides fast access to credit. Instead, we want to make sure that our customers think through their credit needs and make an informed choice from a business perspective.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/i.imgur.com\/MOME35S.jpg\" width=\"500\" \/><\/p>\n<p><strong>Megan, what is your process for helping small business owners with their financing?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>MC:<\/strong> We see a good number of customers who don&#8217;t know what they want or they know exactly what they want. In either case, we have a process to help them reach their goals.<\/p>\n<p style=\"padding-left: 30px;\">We always look at our clients from <a href=\"https:\/\/fundbox.com\/blog\/5-cs-of-credit\/\">a lender’s point of view<\/a>: Do they have all the right components lined up to qualify for a line of credit?<\/p>\n<p style=\"padding-left: 30px;\">Next, we create a &#8220;financial roadmap&#8221; that reflects where the business is today and where they would like to be in the future. This roadmap becomes the execution plan to which we hold our clients accountable. We make sure that they have clear goals set in advance. Our expertise is helping our clients put a plan in place that leads to a positive outcome.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/i.imgur.com\/cqLETBZ.jpg\" width=\"500\" \/><\/p>\n<p><strong>Why is creating this financial roadmap so helpful?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>MC:<\/strong> Giving them support and education, while providing extra accountability, sets them up for success.<\/p>\n<p style=\"padding-left: 30px;\">Many of the small-business owners that become our clients start off trying to do everything on their own. They might be experts in their area of business focus, but lack financial foresight or expertise.<\/p>\n<p style=\"padding-left: 30px;\">So, by the time they reach out to us, they’ve learned the hard way that trying to do financial planning on their own comes with unanticipated challenges.<\/p>\n<p style=\"padding-left: 30px;\">For example, many business owners use their personal credit when first starting off, instead of applying for and using business credit.<\/p>\n<p style=\"padding-left: 30px;\">It&#8217;s understandable. It’s easy and familiar. The problem is that when they want to transition from using their personal to business credit, harmed their business credit score. If this is the case, they get shut out from using business credit until their business credit score gets better.<\/p>\n<p style=\"padding-left: 30px;\">This is why we use business credit education as a means to prevent small-business owners from making mistakes.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/i.imgur.com\/5Pbuxtl.jpg\" width=\"500\" \/><\/p>\n<p><strong>Ray, what does your process look like with your small business clients?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>RM:<\/strong> We customize everything we do to the specific needs of each client. We take a business-consultative approach.<\/p>\n<p style=\"padding-left: 30px;\">What I mean by this is that we take a holistic view of our client’s business fundamentals. We look at business models, revenue drivers, operating costs, and business objectives. Then we develop a customer plan designed to help that customer reach their goals.<\/p>\n<p style=\"padding-left: 30px;\">Our team has deep expertise in business assessment that allows us to align the right credit solutions for the right reasons. And to date, our approach has proven to be successful.<\/p>\n<p><strong>Megan, what’s different about your service vs. other brokers?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>MC:<\/strong> I would say that experience is, by far, one of our biggest differentiators. Credit Suite is the largest broker serving small businesses. We have a long history of producing amazing results for our customers.<\/p>\n<p style=\"padding-left: 30px;\">We’ve been able to translate our experience into proven processes and procedures designed to deliver successful funding outcomes. We have examined and tested every aspect of our service. And the results speak for themselves.<\/p>\n<p style=\"padding-left: 30px;\">Another differentiator is that we believe in educating our customers and teaching them good “credit governance” habits.<\/p>\n<p style=\"padding-left: 30px;\">This means not only understanding what a good business credit score looks like, but how to build one over time, and how to use tools like a credit report to track your creditworthiness or to select the best credit-solution providers like Fundbox, which has been an enormous asset to Credit Suite. Our clients have found that, by far, Fundbox has the simplest application process on the market today.<\/p>\n<p style=\"padding-left: 30px;\">So, when you add up our experience, our belief in an educated consumer, and our knowledge of the best tools or credit providers like Fundbox, we would like to think that in aggregate, all of these things help to differentiate Credit Suite from other brokers.<\/p>\n<p><strong>Ray, what would you say are your key differentiators?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>RM:<\/strong> We’ve developed a proprietary solution that generates identifiers and specific product or service recommendations best suited to help our clients achieve their goals. By automating our own evaluation processes, we can provide advice faster and with greater assuredness.<\/p>\n<p style=\"padding-left: 30px;\">The other difference is our financial experience as a team.<\/p>\n<p style=\"padding-left: 30px;\">For example, I have over 15 years of financial management experience. I can triangulate between the needs of our business clients and the various financial solutions, consultants, or other important resources available to them. As we all know, time is a currency. Our deep knowledge and experience enables us to provide value quickly.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/i.imgur.com\/JsLZvVT.jpg\" width=\"500\" \/><\/p>\n<p><strong>Are there any important tips you could offer small-business owners when looking for a broker?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>MC:<\/strong> Running a small business, as we all know, is not easy! When you’re an owner, you believe that you have to be an expert in everything from business strategy to marketing to operations and, of course, finance.<\/p>\n<p style=\"padding-left: 30px;\">The reality is, you can’t be an expert in everything. Knowing that, small business owners should pick partners to help them make better decisions faster.<\/p>\n<p style=\"padding-left: 30px;\">There are massive opportunity costs associated with starting and growing a business, and finance is one area where costs can add up. So, don’t go it alone!<\/p>\n<p style=\"padding-left: 30px;\">Instead, partner with an experienced financing provider or consultant who can offer you trusted advice while minimizing your opportunity costs, especially as they relate to funding and credit.<\/p>\n<p style=\"padding-left: 30px;\">The second tip I would give is, don’t neglect your business credit report. For all small-business owners, it’s not if you need business credit, but when you need to be monitoring your business credit. Be cautious about funding your business with your personal finances.<\/p>\n<p style=\"padding-left: 30px;\"><strong>RM:<\/strong> This might sound counterintuitive considering the business we’re in, but when small business owners are starting to think about funding, they should set up a meeting with their local banker. Your local banker can provide meaningful insights and helpful guidance for free.<\/p>\n<p style=\"padding-left: 30px;\">One piece of valuable advice they can provide, is how to prepare for applying for a business line of credit. If you apply for business credit without having your bases covered, then you may end up in a process that may not deliver what you need.<\/p>\n<p style=\"padding-left: 30px;\">The second tip I would give is for small-business owners to get into the habit of using business credit cards when they need smaller amounts of credit. If you use a business credit card and you pay your bills on a timely basis, then this will help to build up your business credit score.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/i.imgur.com\/g9MWAFZ.jpg\" width=\"500\" \/><\/p>\n<p><strong>What does the future hold for broker-initiated lending?<\/strong><\/p>\n<p style=\"padding-left: 30px;\"><strong>MC:<\/strong> More and more business owners are now understanding the value of their business credit report and how often business lenders check them. In the future, I hope to see small business owners using their business credit before even thinking about using their personal credit to start their companies.<\/p>\n<p style=\"padding-left: 30px;\"><strong>RM:<\/strong> With more Fintech companies emerging, the broker industry will have a broader range of tools and services available. Those new tools will enable a team like ours to deliver greater value.<\/p>\n<p>&nbsp;<\/p>\n<hr \/>\n<p><em>About Megan Christensen<\/em><\/p>\n<p style=\"padding-left: 30px;\"><a href=\"https:\/\/www.linkedin.com\/in\/megan-christensen-46b485109\/\">Megan Christensen<\/a> started her banking career working for one of the largest institutions in the U.S. Megan found that small-business owners benefited from a caring hand helping them navigate through the seemingly daunting banking system to identify and use the products and financing they really needed. Her ability to listen, consult, and take action allowed her to become the number-one Small Business Lender in the nation within the banking industry. It also gave her the opportunity to train and teach other small business lenders to do the same.<\/p>\n<p style=\"padding-left: 30px;\">After eight years of banking, she joined the Business Finance Suite team. Her main focus is to help small-business owners prepare for financing and share with them her knowledge of the financing process. Megan believes firmly in caring for each business owner and helping a small-business owner succeed. In more than six years of consulting, she has assisted more than 10,000 business clients.<\/p>\n<p><em>About Ray Mejia<\/em><\/p>\n<p style=\"padding-left: 30px;\"><a href=\"https:\/\/www.linkedin.com\/in\/raymejia\/\">Ray Mejia<\/a> brings to the table over fourteen years of financial services experience having assumed roles in consumer and commercial banking, credit, lending &amp; underwriting, with a hyper-focus on private investment management, financial planning, securities &amp; insurance consulting, and securities portfolio strategy, directly and in leadership capacities.<\/p>\n<p style=\"padding-left: 30px;\">Having worked for 3 of the 4 largest banks in the US and with thousands of businesses across all industries, Ray and his team of business advisors lend a holistic approach to guiding businesses seeking access to credit while keeping cash-flow in focus.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fundbox recently sat down for a conversation with Megan Christensen, Chief Operations Officer at Credit Suite, and Raymond Mejia, Managing &#8230;<\/p>\n","protected":false},"author":57,"featured_media":8226,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11532,426],"yst_prominent_words":[2715,2711,1721,1139,719,2707,739,3273,2712,2713,2708,2706,1529,3272,2608,1157,2709,712,709,2598],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"Tale Of Two Brokers: A conversation with Credit Suite and Fast Capital Financing | Fundbox Blog","yoast_meta":[{"name":"description","content":"Fundbox recently sat down for a conversation with Megan Christensen, Chief Operations Officer at Credit Suite, and Raymond Mejia, Managing Director at Fast Capital Financing to learn more about their work with small businesses. Megan Christensen has been a strong ally for small businesses throughout her career. Her"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Tale Of Two Brokers: A conversation with Credit Suite and Fast Capital Financing | Fundbox Blog"},{"property":"og:description","content":"Fundbox recently sat down for a conversation with Megan Christensen, Chief Operations Officer at Credit Suite, and Raymond Mejia, Managing Director at Fast Capital Financing to learn more about their work with small businesses. Megan Christensen has been a strong ally for small businesses throughout her career. Her"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/tale-two-brokers-conversation-credit-suite-fast-capital-financing\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Screen-Shot-2017-11-30-at-2.57.06-PM-2.png"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Screen-Shot-2017-11-30-at-2.57.06-PM-2.png"},{"property":"og:image:width","content":"1675"},{"property":"og:image:height","content":"948"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Fundbox recently sat down for a conversation with Megan Christensen, Chief Operations Officer at Credit Suite, and Raymond Mejia, Managing Director at Fast Capital Financing to learn more about their work with small businesses. Megan Christensen has been a strong ally for small businesses throughout her career. Her"},{"name":"twitter:title","content":"Tale Of Two Brokers: A conversation with Credit Suite and Fast Capital Financing | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2017\/11\/Screen-Shot-2017-11-30-at-2.57.06-PM-2.png"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/tale-two-brokers-conversation-credit-suite-fast-capital-financing\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8223"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/57"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=8223"}],"version-history":[{"count":20,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8223\/revisions"}],"predecessor-version":[{"id":16243,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8223\/revisions\/16243"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/8226"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=8223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=8223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=8223"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=8223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}