{"id":8324,"date":"2019-10-01T07:29:45","date_gmt":"2019-10-01T14:29:45","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=8324"},"modified":"2020-11-11T15:09:42","modified_gmt":"2020-11-11T23:09:42","slug":"10-ways-to-maximize-winter-downtime-in-your-construction-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/10-ways-to-maximize-winter-downtime-in-your-construction-business\/","title":{"rendered":"10 Ways to Maximize Downtime in Your Construction Business"},"content":{"rendered":"<p>For many construction businesses, the slow season is coming as winter weather puts the freeze on many of your jobs. Look on the bright side: This can be a great opportunity to get ahead of the competition.<\/p>\n<p>Here are ten ways we suggest to make the most of your slow season and prepare your construction business for a banner year in 2020.<\/p>\n<h3>1. Take care of your vehicles and equipment.<\/h3>\n<p>If business is a little slow during the winter, it could be the perfect time to conduct an annual inspection of all of your vehicles and heavy equipment.<\/p>\n<p>Make any necessary repairs and perform any needed maintenance. Also, consider the annual costs of operating your vehicles and whether your fleet is the right size for your needs.<\/p>\n<p>Some questions to help you decide: Do you have more vehicles than you need, with some sitting unused? Are you so short of vehicles that you have to turn down projects or work overtime to meet project deadlines?<\/p>\n<p>Start thinking about whether it’ll be time to sell some of your vehicles or add to your fleet in 2020.<\/p>\n<h3>2. Update your licenses or registration if necessary.<\/h3>\n<p>Are your licenses all up to date? Will any need updating soon? Proper construction licensing or registration isn’t just required by law, it can also be a competitive advantage. Letting your customers know that your license or registration is up to date builds credibility and trust, which in turn can win you more business.<\/p>\n<p>Each state has its own licensing or registration requirements for construction companies; check <a href=\"https:\/\/www.homeadvisor.com\/r\/state-by-state-licensing-requirements\/\">HomeAdvisor’s state-by-state list<\/a> to find your state’s information.<\/p>\n<h3>3. Review your insurance coverage.<\/h3>\n<p>The nature of construction means that <a href=\"https:\/\/www.americanbar.org\/\">many types of insurance<\/a> are either required or advisable. For example, you probably need commercial general liability insurance, workers compensation insurance, automobile insurance and umbrella liability insurance; you may also want professional liability insurance.<\/p>\n<p>Consider contacting your insurance agent this winter to conduct an annual review of your coverage. Discuss any changes you plan to make to your business in the coming year, and what adjustments to your insurance policies are needed to protect your business. You might want to comparison shop to make sure you&#8217;re getting the best prices for the coverage you need, too.<\/p>\n<h3>4. Play it safe.<\/h3>\n<p>Start next year off right by conducting safety training for your employees.<\/p>\n<p>Will it have been a year or more since your last safety training? Then it’s time for a refresher course, especially if you’ve added new equipment and machinery, are taking on new types of construction projects, or will working the crews longer hours.<\/p>\n<p>Make sure you’re meeting Occupational Safety and Health Administration (OSHA)  requirements for safety training, and don’t forget about any site- or task-specific training your team may need. Visit the OSHA website for more information about <a href=\"https:\/\/www.osha.gov\/doc\/\">construction industry safety regulations<\/a> as well as resources to help you meet OSHA’s guidelines.<\/p>\n<h3>5. Expand your skills.<\/h3>\n<p>Are you and your employees getting the continuing education necessary to renew your licenses? If not, use any winter downtime to complete that requirement.<\/p>\n<p>Even if your licenses are up-to-date, the slow season is a great time for you and your team to learn some new skills. The <a href=\"https:\/\/www.agc.org\/learn\/education-training\">Associated General Contractors of America<\/a> offers a range of in-person and online trainings covering everything from supervisory training to project management and more.<\/p>\n<h3>6. Review your hiring needs.<\/h3>\n<p>What is your sales forecast for next year? Based on that information, will you need more crew members, foremen or back-office employees to handle the work?<\/p>\n<p>There’s an ongoing shortage of construction workers, so if you think you will need to hire this year, start planning now. Create job descriptions and begin networking with possible sources of employees. An online search for local economic development agencies, trade schools, community colleges and apprenticeship organizations should turn up several potential resources for finding workers.<\/p>\n<h3>7. Plan for your future and set some goals.<\/h3>\n<p>What do you want to accomplish this year, both in your construction business and personally? What will it take to get there? Setting specific and measurable goals for your business growth will help you keep the bigger picture in mind all year long.<\/p>\n<p>Take advantage of your slow season to do some long-term thinking, both by yourself and with your team, and create a strategic plan for next year.<\/p>\n<h3>8. Assess your technology needs.<\/h3>\n<p>High-tech tools, from drones and robotics to <a href=\"http:\/\/www.lorman.com\/resources\/top-five-construction-industry-trends-for-2018-from-technology-to-safety-16578\">virtual reality and augmented reality<\/a> devices, are taking a bigger role in the construction industry, and that will only accelerate in the new year.<\/p>\n<p>Would adopting new technology or applications help your construction company be more efficient and productive in the coming year? For example, could mobile technology improve communication between the office and the job site? Would project management software reduce man-hours needed to keep projects on track?<\/p>\n<p>Talk to your team about which tech tools could make their jobs easier in the year ahead.<\/p>\n<h3>9. Go over your numbers.<\/h3>\n<p>How did your business do this year? Are you correctly estimating markups and profits, or are jobs regularly running over bid?<\/p>\n<p>Review your monthly job cost reports, monthly schedules of completed contracts, and monthly financial statements to measure your success. If you spot any recurring challenges—such as slow-paying customers—plan how you’ll overcome them in the new year.<\/p>\n<h3>10. Apply for business credit.<\/h3>\n<p>Keeping the funds flowing is an ongoing challenge for construction businesses. The slow season is an ideal time to explore your financing options and apply for business credit.<\/p>\n<p>If you don&#8217;t actually need funds to purchase materials or pay workers right now, you’re not stretched thin and your business may be more attractive to a lender. This can enable you to get a higher credit limit with better terms.<\/p>\n<p>When you use Fundbox’s business credit services, you can get access to funds right in your business bank account, as soon as the next business day. You choose when to repay the funds—over a 12-week or 24-week term—and can even pay it back early with no penalties.<\/p>\n<p>Applying for financing with Fundbox is fast and easy. You can register for a Fundbox account in seconds, receive a credit decision in as little as 3 minutes, and connect it to your accounting software. If you’re approved, you simply choose the invoices you want to advance, and get the funds directly in your business bank account. <a href=\"https:\/\/fundbox.com\/blog\/\">Learn more about getting business credit with Fundbox.<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For many construction businesses, the slow season is coming as winter weather puts the freeze on many of your jobs. &#8230;<\/p>\n","protected":false},"author":18,"featured_media":8335,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,11547],"yst_prominent_words":[3223,2698,2691,1165,723,1719,1718,1721,2781,922,1239,2783,924,1254,2779,2782,926,2780,7157,2778],"post-meta-fields":{"stripe_selected":"bottom-left-curve","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"10 Ways to Maximize Downtime in Your Construction Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"For many construction businesses, the slow season is coming as winter weather puts the freeze on many of your jobs. Look on the bright side: This can be a great opportunity to get ahead of the competition. Here are 10 ways to maximize winter downtime."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"10 Ways to Maximize Downtime in Your Construction Business | Fundbox Blog"},{"property":"og:description","content":"For many construction businesses, the slow season is coming as winter weather puts the freeze on many of your jobs. Look on the bright side: This can be a great opportunity to get ahead of the competition. Here are 10 ways to maximize winter downtime."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/10-ways-to-maximize-winter-downtime-in-your-construction-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/01\/shutterstock_785785201.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/01\/shutterstock_785785201.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"For many construction businesses, the slow season is coming as winter weather puts the freeze on many of your jobs. Look on the bright side: This can be a great opportunity to get ahead of the competition. Here are 10 ways to maximize winter downtime."},{"name":"twitter:title","content":"10 Ways to Maximize Downtime in Your Construction Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/01\/shutterstock_785785201.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/10-ways-to-maximize-winter-downtime-in-your-construction-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8324"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=8324"}],"version-history":[{"count":13,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8324\/revisions"}],"predecessor-version":[{"id":14585,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8324\/revisions\/14585"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/8335"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=8324"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=8324"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=8324"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=8324"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}