{"id":8685,"date":"2018-02-08T12:22:53","date_gmt":"2018-02-08T20:22:53","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=8685"},"modified":"2020-11-09T13:51:11","modified_gmt":"2020-11-09T21:51:11","slug":"get-the-lowdown-on-3-popular-smb-funding-options","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/get-the-lowdown-on-3-popular-smb-funding-options\/","title":{"rendered":"Get the Lowdown on 3 Popular SMB Funding Options"},"content":{"rendered":"<h3>What SMBs Need to Know About Merchant Cash Advances, SBA Loans, and a Business Line Of Credit<\/h3>\n<p>As a small business owner, your time is precious. To help you to cut through the informational haze when looking for SMB working capital, we’ve put together this overview about three popular financial product options: <span style=\"text-decoration: underline;\"><a href=\"https:\/\/en.wikipedia.org\/wiki\/Merchant_cash_advance\">Merchant Cash Advances<\/a><\/span>, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/en.wikipedia.org\/wiki\/Small_Business_Administration\">SBA Loans<\/a><\/span> and a <span style=\"text-decoration: underline;\"><a href=\"https:\/\/en.wikipedia.org\/wiki\/Line_of_credit\">Business Lines of Credit<\/a><\/span>.<\/p>\n<p>Small business owners often turn to one or more of these options to secure financing for growing businesses&#8211;maybe one will be right for you.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/fc7d972f-b288-4a00-acf2-01c76d22ef67_shutterstock_557159944.jpg\" alt=\"Small Business Financing Options\" width=\"600\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">Understanding Merchant Cash Advances<\/span><\/h3>\n<h3><span style=\"font-weight: bold;\">What is a Merchant Cash Advance?<\/span><\/h3>\n<p>A merchant cash advance (MCA) is a lump-sum amount of funds provided by a lender to a business in exchange for an agreed-upon percentage of future credit card or debit card sales.<\/p>\n<h3><span style=\"font-weight: bold;\">How does an MCA work?<\/span><\/h3>\n<p>MCAs are primarily designed for businesses whose revenue comes primarily from credit and debit card sales, such as restaurants, ecommerce or retail shops. Now, merchant cash advances are also available to other businesses that don’t rely heavily on credit card or debit card sales. An MCA provider will give you a sum of cash up front, in exchange for a percentage of your future sales.<\/p>\n<p>MCA repayments can be structured in two ways:<\/p>\n<ul>\n<li>In the first type of MCA, you can get an upfront sum of cash in exchange for a percentage of your future credit and debit card sales.<\/li>\n<li>In the second common scenario, you can get a lump sum of cash that you then pay back in fixed daily or weekly debits from your bank account. These are known as Automated Clearing House (ACH) withdrawals.<\/li>\n<li>This second option has become the most common type of MCAs and, they’re referred to as ACH merchant cash advances and allow providers to market to businesses that aren’t primarily tied to credit and debit card sales.<\/li>\n<\/ul>\n<h3><span style=\"font-weight: bold;\">Why MCAs might work for you<\/span>:<\/h3>\n<p>Having a lower credit score is ok. Also, the application process is relatively easy and, once approved, there is quick access to working capital.<\/p>\n<h3><span style=\"font-weight: bold;\">Things to think about when considering an MCA<\/span>:<\/h3>\n<p>MCA loans come with a high <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.investopedia.com\/terms\/a\/apr.asp\">APR<\/a><\/span> and rigorous pay back requirements that could make a serious dent in your cash flow. And, once you’ve picked a merchant service provider you may have difficulty switching, should you want to do so in the future.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/8e12a17a-59f0-4dbf-a29a-cbc2c108f36e_shutterstock_731283796.jpg\" alt=\"Small Business Financing Options\" width=\"600\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">SBA Loans<\/span><\/h3>\n<h3><span style=\"font-weight: bold;\">What is an SBA Loan?<\/span><\/h3>\n<p>A<span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.sba.gov\/\"> Small Business Administration<\/a><\/span> (SBA) loan is a long-term, low-interest small business loan partially guaranteed by the government.<\/p>\n<h3><span style=\"font-weight: bold;\">How does an SBA Loan work?<\/span><\/h3>\n<p>SBA loans are small-business loans guaranteed by the SBA and issued by participating lenders which are mostly banks. In order to qualify, a small business owner must be at least 2+  years in business and have a personal credit score of 620+ and, an annual revenue run rate of $100,000+ or more.<\/p>\n<p>The SBA can guarantee up to 85% of loans of $150,000 or less and 75% of loans of more than $150,000. The agency says its average loan amount was about $375,000 in 2016. The program’s maximum loan amount is $5 million.<\/p>\n<p>If you happen to be looking to open a new office, hire more employees or refinance an existing loan, SBA loans are a great option. <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fitsmallbusiness.com\/sba-loan-rates\/\">SBA loan rates and terms <\/a><\/span>typically are more manageable for borrowers than other types of financing.<\/p>\n<p>In keeping with SBA rules, participating lenders set their interest rates based on the prime rate plus a markup rate known as the spread.<\/p>\n<ul>\n<li>If your loan is more than $50,000 and the term is shorter than seven years, your rate depends on the prime rate, with a maximum spread of 2.25 percentage points. As of December 2017, that meant a maximum interest rate of 6.75%.<\/li>\n<li>If your loan is more than $50,000 and the term is seven years or more, the maximum spread is 2.75 percentage points. As of December 2017, the maximum interest rate was 7.25%.<\/li>\n<\/ul>\n<p>Note that the APR on a loan differs from the interest rate. The APR is a percentage that includes all loan fees in addition to the interest rate.<\/p>\n<p>In contrast, major online small-business lenders that don’t do SBA loans offer financing with APRs that can be as high as the triple digits.<\/p>\n<p>In addition to the low APRs, another benefit of SBA loans is that you get more time to repay them than you would get on non-SBA forms of lending from banks or online lenders.<\/p>\n<p>The loan term depends on how you plan to use the money. According to the SBA, you can use the funds for working capital or daily operations (term 7 years); new equipment purchases (term 10 years); real estate purchases (term up to 25 years).<\/p>\n<p>For SBA loans, a longer term means a lower interest rate and lower regular payments. That means you’ll have more money available for other business needs.<\/p>\n<h3><span style=\"font-weight: bold;\">Why SBA loans might work for you<\/span>:<\/h3>\n<p>For new small business owners, SBA loans offer one of the most accesibles path for securing working capital. In addition, SBA loans can restructure debt at better terms for businesses with cash flow issues by providing longer loan maturities and requiring lower monthly payments. SBA loans are also typically structured without balloon payments and longer payment terms means less cash flow pressure.<\/p>\n<h3><span style=\"font-weight: bold;\">Things to think about when considering SBA loans<\/span>:<\/h3>\n<p>Like MCAs, SBA loans have higher interest rates than traditional banks and, applying for an SBA loan will take a fair amount of time to fill out all the paperwork. Also, unlike traditional banks that can process loan applications fairly fast, the turn around on SBA loans can take a bit longer. Finally, SBA loans require a personal guarantee from the business owner and in many cases, the SBA will secure a loan using the business owners property.<\/p>\n<p>If you want to learn more, you can find our <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/resources\/guides\/sba-loans\/\">in-depth guide to SBA loans here<\/a><\/span>.<\/p>\n<p><img class=\"aligncenter wp-image-8691\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_577787758.jpg\" alt=\"Small Business Financing Options\" width=\"600\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_577787758.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_577787758-768x512.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">Understanding Business Lines Of Credit <\/span><\/h3>\n<h3><span style=\"font-weight: bold;\">What is a Business Line of Credit?<\/span><\/h3>\n<p>A business line of credit (BLC) allows you to keep reusing (drawing down) and repaying funds as often as you’d like, as long as you make payments on time and you don’t exceed your credit limit. Most lenders allow you to repay your balance in full early to save on interest costs. The typical range for a business line of credit runs from $5,000 to $150,000.<\/p>\n<p>BLC’s with lower credit limits are typically unsecured, which means you do not need to provide collateral such as real estate or inventory.<\/p>\n<p>BLC’s provide flexibility that a regular business loan doesn&#8217;t. With a business line of credit, you can borrow up to a certain limit — say, $100,000 — and pay interest only on the portion of money that you borrow.<\/p>\n<h3><span style=\"font-weight: bold;\">How does a Business Line of Credit work<\/span>?<\/h3>\n<p>Most traditional lenders, such as banks, require businesses to have strong revenue and at least a few years of history to qualify for a line of credit. Larger lines of credit may be secured, meaning they require collateral in the form of property or other assets. If you do not keep up with your payments, your lender can seize that collateral.<\/p>\n<p>To apply, lenders typically require the following documentation: personal and business tax returns, bank account information and business financial statements, such as profit-and-loss statements and a balance sheet.<\/p>\n<p>Online business lenders typically have looser qualifications than banks. However, these lenders are also likely to charge higher rates than banks and may have lower credit limits.<\/p>\n<p>At a minimum, you’ll need at least six months in business and $25,000 in annual revenue to qualify for a business line of credit. Although some lenders don’t set a minimum credit score, borrowers most likely will need a score of 500 or higher to qualify.<\/p>\n<h3><span style=\"font-weight: bold;\">Why a Business Line of Credit might work for you<\/span>:<\/h3>\n<p>Once you are approved for a BLC, you won’t owe any interest until you draw on your credit. (Your lender might charge a set-up fee, so be on the lookout for those. Your lender may also charge an annual fee to keep credit available until you decide to use it.) BLC’s offer small business owners a good amount of flexibility and control (when and how much to apply for). It can also be easier to qualify and get approved for business lines of credit, as opposed other types of small business loans.<\/p>\n<p>All these benefits make business lines of credit an option you should definitely consider. And for those who might be interested in a exploring a BLC, Fundbox <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/resources\/guides\/lines-credit\/\">Direct Draw<\/a><\/span> could be an excellent solution for your business needs.<\/p>\n<h3><span style=\"font-weight: bold;\">Things to think about<\/span>:<\/h3>\n<p>As with any other financial products, a BLC is debt, until you use it to create new revenue. For those small businesses that may be struggling, a BLC can quickly turn into a liability if not managed correctly.<\/p>\n<hr \/>\n<h3><span style=\"font-weight: bold;\">Wrapping It All Up<\/span><\/h3>\n<p>When it comes to financing your working capital needs for your small business, you have a ton of options. Merchant cash advances, SBA loans, and business lines of credit are just a few of the many tools out there, and it’s a good idea to have multiple tools in your financial toolbox.<\/p>\n<p>Sometimes, the best option is to use more than one, depending on your immediate needs and longer term business goals, and reevaluate your situation regularly to make sure you’re getting the best deal, the best terms possible, and the most value out of your investment in your business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What SMBs Need to Know About Merchant Cash Advances, SBA Loans, and a Business Line Of Credit As a small &#8230;<\/p>\n","protected":false},"author":57,"featured_media":8686,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11547,426],"yst_prominent_words":[3306,723,1707,1706,3240,3246,3244,739,3247,3239,3245,3242,1529,3248,2103,3241,3243,3238,3249,2613],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"Get the Lowdown on 3 Popular SMB Funding Options | Fundbox Blog","yoast_meta":[{"name":"description","content":"We’ve put together this overview about three popular financial product options: Merchant Cash Advances, SBA Loans and a Business Lines of Credit. Small business owners often turn to one or more of these options to secure financing for growing businesses--maybe one will be right for you."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Get the Lowdown on 3 Popular SMB Funding Options | Fundbox Blog"},{"property":"og:description","content":"We’ve put together this overview about three popular financial product options: Merchant Cash Advances, SBA Loans and a Business Lines of Credit. Small business owners often turn to one or more of these options to secure financing for growing businesses--maybe one will be right for you."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/get-the-lowdown-on-3-popular-smb-funding-options\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/6252bbf1-811f-41a2-8e22-1d6496df644d_shutterstock_574323772.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/6252bbf1-811f-41a2-8e22-1d6496df644d_shutterstock_574323772.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"We’ve put together this overview about three popular financial product options: Merchant Cash Advances, SBA Loans and a Business Lines of Credit. Small business owners often turn to one or more of these options to secure financing for growing businesses--maybe one will be right for you."},{"name":"twitter:title","content":"Get the Lowdown on 3 Popular SMB Funding Options | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/6252bbf1-811f-41a2-8e22-1d6496df644d_shutterstock_574323772.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/get-the-lowdown-on-3-popular-smb-funding-options\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8685"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/57"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=8685"}],"version-history":[{"count":15,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8685\/revisions"}],"predecessor-version":[{"id":13967,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8685\/revisions\/13967"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/8686"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=8685"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=8685"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=8685"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=8685"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}