{"id":8839,"date":"2018-02-28T11:15:00","date_gmt":"2018-02-28T19:15:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=8839"},"modified":"2019-01-28T18:24:11","modified_gmt":"2019-01-29T02:24:11","slug":"seccs-noah-grayson-evolving-lending-landscape","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/seccs-noah-grayson-evolving-lending-landscape\/","title":{"rendered":"SECC’s Noah Grayson on the Evolving Lending Landscape"},"content":{"rendered":"<p>Last week, we had the pleasure of speaking with one of our newer partners, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.linkedin.com\/in\/noah-grayson-b811303\/\">Noah Grayson<\/a><\/span>. Noah is the Managing Director and Founder of South End Capital Corporation. Founded in 2009, SECC is a nationwide, non-conforming lender providing a variety of financing options, primarily in the commercial real estate and business loan space.<\/p>\n<p>In our conversation, we discussed trends he’s seeing in small business lending, and the massive changes occurring in the finance industry, brought on by the internet and big data. He also shared some helpful tips for small business owners and first-time borrowers looking to work successfully with a broker or lender and avoid the dangers of fraud.<\/p>\n<figure id=\"attachment_8847\" aria-describedby=\"caption-attachment-8847\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-full wp-image-8847\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/Headshot_NoahGrayson_SECC-e1519774022212.jpg\" alt=\"Noah Grayson, SECC\" width=\"310\" height=\"310\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/Headshot_NoahGrayson_SECC-e1519774022212.jpg 310w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/Headshot_NoahGrayson_SECC-e1519774022212-150x150.jpg 150w\" sizes=\"(max-width: 310px) 100vw, 310px\" \/><figcaption id=\"caption-attachment-8847\" class=\"wp-caption-text\"><center>Noah Grayson, Managing Director and Founder, South End Capital Corporation<\/center><\/figcaption><\/figure>\n<p>&#8212;<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox:<\/span><span style=\"font-style: italic;\"> Let’s start with a big question: Tell us about some of the biggest challenges that you face when you&#8217;re working with small business owners today.<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>At South End Capital, the biggest challenge we hear about when talking to small business owners is their trouble finding affordable financing that doesn&#8217;t require copious amounts of paperwork and take tremendous amounts of time.<\/p>\n<p style=\"padding-left: 30px;\">We have the SBA process down to where we can take most of the headache out of the way for our clients, and our commercial real estate program that we fund is a stated income, easy documentation program.<\/p>\n<p style=\"padding-left: 30px;\">Fundbox has been a welcome addition to our offerings for business owners who need small amounts of capital quickly, don’t want to or can’t go to a bank, or for borrowers who don’t want to pay expensive merchant cash advance rates.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">What is your process like for helping small business owners overcome those common challenges, specifically around reducing time to funding and also around getting access to smaller amounts of funding?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>Our general loan size, whether we&#8217;re doing SBA financing or our non-conforming commercial real estate products, tends to be in the $500,000 to $1,000,000 range. We get tons of requests for working capital or business financing well below that. Finding fast financing is difficult for these borrowers. We&#8217;re not ones to present a product that is prohibitively expensive and we feel Fundbox fills a huge void in the space right now because it is fast and affordable.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">When people come to you and they&#8217;re applying for business loans, naturally you talk to them about how they plan to use the funds. What are some of the most common reasons why these business owners need extra funds?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>Since we&#8217;re generally real-estate-focused, a lot of the requests are to refinance existing debt on the properties that they occupy with their businesses because the loan has ballooned or the rate is too high. Additionally, a huge concern is working capital. Business owners often want a cash reserve on hand in the event that they encounter issues while running their businesses. Whether it&#8217;s a slow month, they have to meet payroll quickly, or they have the opportunity to take advantage of a big purchase order—they want working capital readily available.<\/p>\n<p style=\"padding-left: 30px;\">Most business owners we work with don&#8217;t like to rely on last-minute financing. They want cash in the bank as a precaution.<\/p>\n<blockquote><p><em>&#8220;We&#8217;re not ones to present a product that is prohibitively expensive and we feel Fundbox fills a huge void in the space right now because it is fast and affordable.&#8221;<\/em><\/p><\/blockquote>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">Have you noticed any similarities with the types of customers that end up being the best fit for alternative lenders like Fundbox?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>The customers that we&#8217;ve found that are taking advantage of the Fundbox program are customers who need financing quickly and they don&#8217;t want to pay expensive MCA rates or wait for a bank. From what we&#8217;ve seen, they tend to be business owners who have higher credit and more established businesses.<\/p>\n<p style=\"padding-left: 30px;\">Surprisingly, they&#8217;re not business owners that have been turned down by everybody else. Mostly, we&#8217;re seeing borrowers take advantage of the Fundbox program just because of the ease and affordability of the process.<\/p>\n<p><img class=\"aligncenter size-full wp-image-8845\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_568577065.jpg\" alt=\"Small Business Borrowers\" width=\"600\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_568577065.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_568577065-768x513.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<h3><span style=\"font-weight: bold;\">What’s the Value of Customer Experience?<\/span><\/h3>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">What level of importance would you place on the customer experience and ease in choosing a financial product in general? Do your customers talk much about that?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>Oh yes, it’s important, and people will often pay more for an easier process. For our stated income commercial real estate program, the borrower tends to be a higher credit borrower in the 680 to 700+ range. A lot of these borrowers could get a loan from a bank in the 4% to 5% range instead of paying us 6% to 9%, but they don&#8217;t want to hassle with providing tax returns or suffering through ongoing financial reporting and all the other cumbersome things banks require. They&#8217;d rather have an easy process.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">Do you feel that younger business owners are more financially savvy these days? Do you feel that young entrepreneurs have different or better opportunities now?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>I do think they have more opportunities and I don&#8217;t think they&#8217;re more financially savvy; I think younger entrepreneurs are more <span style=\"font-style: italic;\">information<\/span> savvy. They’ve grown up in a tech-centered world. In the past, it cost a lot of money to obtain all of the information we can now find online. It&#8217;s a different world and it&#8217;s definitely easier to be a business owner nowadays than it might have been in the past.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">Can you offer any opinion on why it still seems to be harder for female and minority business owners to get access to funding?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG: <\/span>I think for minorities and women it&#8217;s usually outside factors that aren&#8217;t in their control that might be preventing them from accessing financing. Such as being located in a less economically robust geographic location or not being afforded the resources and support that are available to other groups.<\/p>\n<p style=\"padding-left: 30px;\">South End Capital is an equal opportunity lender and we don’t ask people to identify a race or gender when they complete our online applications. We analyze the merit of the business or the real estate that is serving as our collateral, not the gender or the race of the person applying.<\/p>\n<blockquote><p><em>&#8220;Fintech lenders like Fundbox and others have really shaken up an archaic, antiquated lending system and laid the foundation to permanently eliminate bias in lending.&#8221;<\/em><\/p><\/blockquote>\n<h3><span style=\"font-weight: bold;\">How Big Data is Changing Lending<\/span><\/h3>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">At Fundbox, we believe that big data and automation has the potential to help remove biases in the system that may be harming business owners that are not able to access funding for various reasons outside their control. What do you think about how big data and AI are changing the lending landscape?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG:<\/span> We&#8217;re already seeing it happen. The lending process is changing for the better. Fintech lenders like Fundbox and others have really shaken up an archaic, antiquated lending system and laid the foundation to <span style=\"font-style: italic;\">permanently<\/span> eliminate bias in lending—hopefully in the not too distant future.<\/p>\n<p style=\"padding-left: 30px;\">Two or three years ago, I was reading articles that predicted, &#8220;These small fintech lenders would take over the lending space and big banks would go the way of the dinosaur.&#8221; Now, what&#8217;s happened is actually the inverse. The banks have woken up and are partnering with fintech lenders, purchasing them, or adopting their new tactics and policies. Whatever way it’s happening, the more personal bias you can remove from what should be a strictly technical and data driven loan process, the better it is for everyone.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">You’ve seen all of that happen in the last couple of years?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG:<\/span> Yes, it&#8217;s been so interesting to watch it unfold. To answer your question, yes, I think the lending landscape is going to be markedly different, even just a year or two from now.<\/p>\n<p style=\"padding-left: 30px;\">I think in the very near future, for all mainstream lenders, not just fintech lenders, AI will aggregate all the data, make a credit decision, determine  risk, review tax return and financial data, complete underwriting in a heartbeat and provide financing within days, if not hours—just like Fundbox is doing today.<\/p>\n<p><img class=\"aligncenter size-full wp-image-8846\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_272443739.jpg\" alt=\"Small business borrowers\" width=\"600\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_272443739.jpg 1000w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_272443739-768x512.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p><em>&#8220;Two of the most important things you can do: Make sure you&#8217;re working with somebody legitimate, and make sure you&#8217;re getting all the options available to you.&#8221;<\/em><\/p>\n<h3><span style=\"font-weight: bold;\">Tips for Small Business Borrowers<\/span><\/h3>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">What advice would you give to small business owners about seeking financing? What should they know about choosing a firm to work with for their financing needs?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG:<\/span> I could speak for hours on that topic! Here are two of the most important things you can do: First, make sure you&#8217;re working with somebody legitimate, and second, make sure you&#8217;re getting all the options available to you.<\/p>\n<p style=\"padding-left: 30px;\">I hate to start with something negative, but there&#8217;s still so much financial fraud happening. New business owners or borrowers are a huge target. We see it almost daily; borrowers who believed they were working with a legitimate loan broker or lender because that person had a website or said the right things. The borrower gave them money, or sensitive information, and they were taken advantage of.<\/p>\n<p style=\"padding-left: 30px;\">So, I would tell any new business owner or borrower to use the internet and do your research. Look for any negative reviews, check with the Better Business Bureau and government agencies to find out if any complaints have been filed against them. It&#8217;s worth spending the extra time to make sure who you&#8217;re working with is real and legitimate, because it could save you from a devastating financial mistake.<\/p>\n<p style=\"padding-left: 30px;\">If your broker gives you documentation from a lender and it doesn’t come from the lender directly, call the lender and talk to somebody there who can verify the information you&#8217;ve received. Fraudsters forging lender documents is one of the most prevalent ways borrowers are being duped today.<\/p>\n<p style=\"padding-left: 30px;\">Once you&#8217;ve chosen someone to work with, whether a lender or broker—research the programs available online and ask that lender or broker to show you multiple financing options. Make sure you are getting numerous loan options and that you understand what type of financing you need.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">Is it typical for first time borrowers to talk to multiple firms before making a choice of a broker to work with?<\/span><\/p>\n<p><span style=\"font-weight: bold;\">NG:<\/span> It is something they should do, but they often don’t.<\/p>\n<p style=\"padding-left: 30px;\">Often borrowers click on an ad, or they’re cold-called and just go in that direction. But yes, borrowers should be shopping and they should get multiple offers and collect all the information they can.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">Very good advice. Now, you&#8217;ve had a lot of success very fast with Fundbox. Is there anything you&#8217;ve noticed that Fundbox does particularly differently from other lenders you&#8217;ve worked with?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">NG:<\/span> I love how Fundbox does business. We were talking about what the future of lending is going to look like, and I think you guys really are at the forefront of that.<\/p>\n<p style=\"padding-left: 30px;\">It’s great that you don&#8217;t just look at credit as the determining factor to offer somebody financing. I don&#8217;t think that should always be the one thing that gives somebody a thumbs up or thumbs down. Like us, I&#8217;m guessing you look at many different factors like deposit history, cash flow, payment consistency and use your own algorithms to determine <span style=\"font-style: italic;\">total<\/span> credit risk and not just rely on someone’s FICO score. I think that&#8217;s a great way to do it. I don&#8217;t think there are many lenders like Fundbox that have driving underwriting criteria other than credit score.<\/p>\n<p style=\"padding-left: 30px;\">It’s also fantastic that borrowers don&#8217;t have to fill out a ton of paperwork. It&#8217;s very simple and it&#8217;s done quickly online. We offer online applications as well and try to make our loan process as pain-free as possible, which is why it was an easy decision for us to start referring clients to Fundbox who don’t fit our guidelines. There aren’t a lot of lenders doing it this way. We’ve referred business to  huge publicly traded lenders that have spent millions of dollars on their processes that still aren’t as efficient and easy to work with as Fundbox. Fundbox is doing it right. You&#8217;ve just found a way to look at it differently and I think it&#8217;s a great product.<\/p>\n<p><span style=\"font-style: italic; font-weight: bold;\">Fundbox: <\/span><span style=\"font-style: italic;\">Thanks Noah, that’s what we like to hear. Thanks for your time, insights and great advice.<\/span><\/p>\n<p>&nbsp;<\/p>\n<hr \/>\n<p><em>About Noah Grayson<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>Noah Grayson<\/strong> is Managing Director and Founder of <span style=\"text-decoration: underline;\"><a href=\"http:\/\/southendcapital.com\/\">South End Capital Corporation<\/a><\/span> “SECC”. Founded in 2009, SECC is a nationwide, non-conforming lender (CA Financing Law License # 603 L334) providing commercial real estate loans, bridge loans, subprime SBA loans, easy documentation business term loans and lines of credit, and merchant cash advance (MCA) consolidation loans. SECC offers excellent service, prompt responses and custom tailored financing. SECC was named “the best” and one of the “top ten best” hard-money \/ bridge lenders in the US, respectively, by Fit Small Business and TopTenReviews.<\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-style: italic;\">You can find more from Noah at Scotsman<\/span><span style=\"font-style: italic;\"> Guide, where he has written extensively about <a href=\"http:\/\/www.scotsmanguide.com\/Commercial\/Articles\/2016\/03\/Small-Business-Loans-Make-Sense\/\">opportunities<\/a> and <a href=\"http:\/\/www.scotsmanguide.com\/Commercial\/Articles\/2015\/10\/New-Technology-Disrupts-Business-as-Usual\/\">changes<\/a> in the loan business.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week, we had the pleasure of speaking with one of our newer partners, Noah Grayson. Noah is the Managing Director &#8230;<\/p>\n","protected":false},"author":61,"featured_media":8853,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,426],"yst_prominent_words":[8231,723,719,8228,8235,8230,8237,8238,8239,8253,8234,8233,8227,838,5061,8232,709,8236,8226,8229],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"SECC’s Noah Grayson on the Evolving Lending Landscape | Fundbox Blog","yoast_meta":[{"name":"description","content":"Last week, we had the pleasure of speaking with one of our newer partners, Noah Grayson. Noah is the Managing Director and Founder of South End Capital Corporation. Founded in 2009, SECC is a nationwide, non-conforming lender providing a variety of financing options, primarily in the commercial real estate and"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"SECC’s Noah Grayson on the Evolving Lending Landscape | Fundbox Blog"},{"property":"og:description","content":"Last week, we had the pleasure of speaking with one of our newer partners, Noah Grayson. Noah is the Managing Director and Founder of South End Capital Corporation. Founded in 2009, SECC is a nationwide, non-conforming lender providing a variety of financing options, primarily in the commercial real estate and"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/seccs-noah-grayson-evolving-lending-landscape\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_165356078-copy.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_165356078-copy.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"662"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Last week, we had the pleasure of speaking with one of our newer partners, Noah Grayson. Noah is the Managing Director and Founder of South End Capital Corporation. Founded in 2009, SECC is a nationwide, non-conforming lender providing a variety of financing options, primarily in the commercial real estate and"},{"name":"twitter:title","content":"SECC’s Noah Grayson on the Evolving Lending Landscape | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/02\/shutterstock_165356078-copy.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/seccs-noah-grayson-evolving-lending-landscape\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8839"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=8839"}],"version-history":[{"count":11,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8839\/revisions"}],"predecessor-version":[{"id":10161,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8839\/revisions\/10161"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/8853"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=8839"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=8839"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=8839"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=8839"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}