{"id":8999,"date":"2018-03-27T09:16:00","date_gmt":"2018-03-27T16:16:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=8999"},"modified":"2022-06-24T07:15:27","modified_gmt":"2022-06-24T14:15:27","slug":"the-expensive-lessons-i-wish-i-knew-when-i-started-my-business","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/the-expensive-lessons-i-wish-i-knew-when-i-started-my-business\/","title":{"rendered":"The Expensive Lessons I Wish I Knew When I Started My Business"},"content":{"rendered":"<p><span style=\"font-style: italic;\">Deanna deBara is a freelance writer and business owner who started out with zero clients and zero income and took her business to six figures—all within two years of launching. In this guest post, she breaks down the hard-earned lessons that have enabled her to work smarter, not harder; partner with clients she’s passionate about; and dramatically increase her earning potential—lessons she wishes she would’ve known from day one.<\/span><\/p>\n<figure id=\"attachment_9001\" aria-describedby=\"caption-attachment-9001\" style=\"width: 300px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-9001 size-medium\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/Headshot_Deanna-deBara.jpg\" alt=\"\" width=\"300\" height=\"300\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/Headshot_Deanna-deBara.jpg 1038w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/Headshot_Deanna-deBara-150x150.jpg 150w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/Headshot_Deanna-deBara-768x768.jpg 768w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><figcaption id=\"caption-attachment-9001\" class=\"wp-caption-text\"><em>Deanna deBara, small business owner<\/em><\/figcaption><\/figure>\n<p>When I started my own business, I really had no idea what I was getting myself into. I knew I didn’t want to work in corporate America anymore and I knew I wanted to be a writer—but that was pretty much it.<\/p>\n<p>Because I was new to the entrepreneurial game, I made just about every mistake in the book as I worked to build my business. I was desperate for clients, so I took any opportunity that presented itself, even if that opportunity wasn’t aligned with my ultimate goals. I had no samples for my portfolio, so I wrote for anyone who would pay me, no matter how low the rate. I worked around the clock trying to get my business off the ground, but no matter how hard I worked, I couldn’t get past the 5K per month mark. Considering how many hours I was putting in, I started to wonder if this whole entrepreneur thing was actually worth it.<\/p>\n<p>Once I learned these big lessons, everything changed.<\/p>\n<p>Today, I’m happy to say that I’ve built a thriving six-figure business where I’m lucky enough to work with amazing clients on projects I’m really excited about, but it was a long road to get here.<\/p>\n<p>Here are the four lessons I’ve learned that I wish I knew from the start.<\/p>\n<h2>You can’t do everything on your own<\/h2>\n<p>When I first started out, I was a one-woman show. I was, technically, a writer, but most of my time was spent doing everything else that was necessary to keep my business up and running, from looking for new leads to research to <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/blog\/how-to-create-the-perfect-invoice\/\">invoicing<\/a><\/span> to admin work.<\/p>\n<p>It took me a solid year to realize that all that time I was spending on “everything else” was time I wasn’t getting paid for—and my business was suffering as a result.<\/p>\n<p>As an entrepreneur, if you want to build a successful business, you can’t do everything on your own. If you spend each day doing only your most profitable activities, your business is more likely to succeed. If you spend it doing “everything else”? Unfortunately, you’re going to struggle.<\/p>\n<p>For me, I had to make a shift and stop trying to do everything on my own, so I decided to do what I do best (writing) and hire out the rest. And that’s when my business really started to thrive.<\/p>\n<p>Today, I have a CPA who manages my finances and a virtual assistant who handles all my research and admin work, which frees me up to spend just about all my time writing—which not only brings more money into my business, but makes the time I spend working much more enjoyable.<\/p>\n<p>At first, it was really hard to decide to hire help. But once I started looking at how I was spending my time (and how much time I was spending on things that didn’t drive any revenue), I realized I was never going to take my business to the next level until I got help.<\/p>\n<p>For example, when I was a one-woman show, I was spending about 15 hours a week on administrative work. That was 15 hours a week I wasn’t billing clients, where I was making zero income. When I hired my virtual assistant, I was able to outsource my administrative tasks and free up those 15 hours for higher value work. The extra time I now have to focus on income-generating activities <span style=\"font-style: italic;\">more<\/span> than makes up for the cost of my assistant.<\/p>\n<h2>If you don’t value what you do, neither will anyone else<\/h2>\n<p>In the early days of my business, I didn’t place nearly enough value on my skills and talents, which led me to take on low-paying assignments that I should have declined. That wasn’t good for my morale, and it definitely wasn’t a sustainable way to build a business.<\/p>\n<p>Over time, I gained more confidence in myself. When I changed my mindset and started valuing what I brought to the table, my entire business shifted. I began turning down work that wasn’t aligned with my financial goals—and as a result, I made room for better-paying clients in my schedule. I was confident in the way I pitched my services—and clients picked up on that confidence and wanted to work with me.<\/p>\n<p>I learned the hard way that if you don’t value what you do, neither will anyone else. When you know your own value, everyone else will know it, too.<\/p>\n<h2>ABP (Always be pitching)<\/h2>\n<p>In the early months of my business, I found myself in a repetitive “feast or famine” cycle. I’d pitch a few clients, get a few assignments, be super busy and spend all my time and energy getting those assignments finished, turn the assignments in, and then… nothing. I’d have no more work—and, as a result, no more income coming into my business.<\/p>\n<p>This cycle was not only stressful, but it wasn’t sustainable. If I wanted my business to succeed, I needed a steadier cash flow.<\/p>\n<p>It took me longer than I’d like to admit to figure out how to make that happen. It’s a little trick I call ABP: Always be pitching.<\/p>\n<p>The reason I was in feast or famine mode is because I’d stop pitching once I landed an assignment. But the key to generating a steady flow of income is to ALWAYS be pitching new business. Not only does it make sure there’s plenty of work flowing into your business, it also protects you from getting too reliant on any specific client.<\/p>\n<p>Today, I have a Post-It note on my computer that says “ABP” to remind me to reach out to at least five new potential clients each week. As a result, I’ve had a full client roster for the past year.<\/p>\n<h2>Run your business like a business<\/h2>\n<p>The last lesson I’d share with my early business self is this: run your business like a business. That might sound obvious, but hear me out.<\/p>\n<p>Businesses need structure to thrive. But when you don’t have a boss breathing over your shoulder, because you <span style=\"font-style: italic;\">are<\/span> the boss, it can be hard to implement that structure for yourself. I used to work odd hours, take days off in the middle of the week, and basically just do things based on what I felt like doing in that moment—not what was best for my business.<\/p>\n<p>Today, I take my business more seriously. I have a set schedule and I stick to it. Running my business using schedules and advance planning has been a total gamechanger.<\/p>\n<p>There are plenty of things I would tell my younger, more naïve self about <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/blog\/double-business-growth-in-2018\/\">how to successfully grow a business<\/a><\/span>. But the most important thing I’d tell her? Keep going. It might be tough, but I promise—it’s totally worth it.<\/p>\n<p>&#8212;<\/p>\n<p><i>In I WISH I KNEW, we talk to business owners about their career paths, their business growth, and the lessons they’ve learned along the way. Want to share your small business lessons or stories? Tweet us <\/i><a href=\"https:\/\/twitter.com\/fundbox\"><i>@fundbox<\/i><\/a><i> and use #IWishIKnew. <\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Deanna deBara is a freelance writer and business owner who started out with zero clients and zero income and took &#8230;<\/p>\n","protected":false},"author":66,"featured_media":9003,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72],"yst_prominent_words":[8403,723,8398,875,773,8408,2133,2591,8404,6163,8402,7889,712,3846,1716,3300,2074,728,3090,8401],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"The Expensive Lessons I Wish I Knew When I Started My Business | Fundbox Blog","yoast_meta":[{"name":"description","content":"In this guest post, business owner Deanna deBara breaks down the hard-earned lessons that have enabled her to work smarter, not harder; partner with clients she’s passionate about; and dramatically increase her earning potential—lessons she wishes she would’ve known from day one."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"The Expensive Lessons I Wish I Knew When I Started My Business | Fundbox Blog"},{"property":"og:description","content":"In this guest post, business owner Deanna deBara breaks down the hard-earned lessons that have enabled her to work smarter, not harder; partner with clients she’s passionate about; and dramatically increase her earning potential—lessons she wishes she would’ve known from day one."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/the-expensive-lessons-i-wish-i-knew-when-i-started-my-business\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/shutterstock_745197028.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/shutterstock_745197028.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"In this guest post, business owner Deanna deBara breaks down the hard-earned lessons that have enabled her to work smarter, not harder; partner with clients she’s passionate about; and dramatically increase her earning potential—lessons she wishes she would’ve known from day one."},{"name":"twitter:title","content":"The Expensive Lessons I Wish I Knew When I Started My Business | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/03\/shutterstock_745197028.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/the-expensive-lessons-i-wish-i-knew-when-i-started-my-business\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8999"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/66"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=8999"}],"version-history":[{"count":4,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8999\/revisions"}],"predecessor-version":[{"id":16223,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/8999\/revisions\/16223"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9003"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=8999"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=8999"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=8999"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=8999"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}