{"id":9150,"date":"2018-04-25T11:22:10","date_gmt":"2018-04-25T18:22:10","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=9150"},"modified":"2022-04-27T08:17:26","modified_gmt":"2022-04-27T15:17:26","slug":"12-must-read-books-for-business-owners-entrepreneurs","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/12-must-read-books-for-business-owners-entrepreneurs\/","title":{"rendered":"12 Must-Read Books For Business Owners &#038; Entrepreneurs"},"content":{"rendered":"<h2><\/h2>\n<p>Whether you’re looking for productivity tips, wondering how to market your business better and persuade your customers more effectively, or you want to improve at hiring and become a more impactful manager, there’s something on this list for you.<\/p>\n<p>With that in mind, here are the 12 titles we’re giving away, along with a brief summary of each.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/97cf53d1-9b3d-4d77-98e8-4964045d8018_pasted20image200.png\" alt=\"Tools of Titans\" \/><\/p>\n<h2>1. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Tools-Titans-Billionaires-World-Class-Performers\/dp\/1328683788\/\">Tools of Titans<\/a><\/span><span style=\"font-weight: bold;\"> by Tim Ferriss<\/span><\/h2>\n<p>Do you want to learn the tips and tricks successful people used to get to where they are? Productivity guru Tim Ferriss’ <span style=\"font-style: italic;\">Tools of Titans <\/span>may be just the book you’re looking for.<\/p>\n<p>The 673-page tome is mostly a collection of interviews with more than 100 successful folks from all walks of life, all of whom offer up personal productivity advice and other insights about their careers. <span style=\"font-style: italic;\">Tools of Titans<\/span> is broken into three sections: Healthy, Wealthy, and Wise. In each section, Ferriss’ own tips, routines, and habits are spliced in between interviews.<\/p>\n<p>Learn what people like Arnold Schwarzenegger, writer Maria Popova, LinkedIn CEO Reid Hoffman, and comedian Mike Birbiglia do to stay on top of their games. The author calls the book a “toolkit for changing your life.”<\/p>\n<p>To get the most out of <span style=\"font-style: italic;\">Tools of Titans<\/span>, Ferriss encourages readers to skip over any interviews they don’t like—so you have the author’s permission to not read the whole thing if you don’t have time to.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/2219feec-0667-41b6-823f-4c9106a26aa0_pasted20image200.png\" alt=\"Mindset: The New Psychology of Success\" \/><\/p>\n<h2>2. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Mindset-Psychology-Carol-S-Dweck\/dp\/0345472322\">Mindset: The New Psychology of Success<\/a><\/span><span style=\"font-style: italic;\"> <\/span><span style=\"font-weight: bold;\">by Dr. Carol Dweck<\/span><\/h2>\n<p>Are you the kind of person who’s content with your skills or resistant to change? Do you think your business does what it does and there’s no possibility you’d succeed if you tried something entirely different?<\/p>\n<p>If so, you might find it liberating to learn that you do have the power to change these perceptions.<\/p>\n<p>Dr. Carol Dweck, Ph.D., is a professor at Stanford who’s the pioneer of mindset research; she’s been studying the power of mindset for decades.<\/p>\n<p>She argues that our mindset dictates our behavior. It’s our way of thinking about ourselves and the world that governs the way we act.<\/p>\n<p>Dweck argues there are two kinds of mindsets:<\/p>\n<ul>\n<li>A <span style=\"font-weight: bold;\">fixed mindset <\/span>tells us intelligence is something we’re born with. We’re dealt a certain hand and there’s nothing we can do to change it.<\/li>\n<li>A <span style=\"font-weight: bold;\">growth mindset <\/span>says we can improve ourselves every day. Maybe you’re an incredibly talented violinist, but that doesn’t mean you can’t learn how to write transformative computer code that powers spacecraft. We all have the ability to become better and better.<\/li>\n<\/ul>\n<p>In <span style=\"font-style: italic;\">Mindset: The New Psychology of Success, <\/span>Dweck chronicles her extensive mindset research and leaves readers with a simple yet incredibly powerful takeaway: The way we think about our lives—whether it’s work or school or personal relationships—plays an enormous role in the outcomes we experience.<\/p>\n<p>Business success, per Dweck, starts with having the right outlook on our capabilities, which is made possible with a growth mindset. We need to accept we’re not perfect and we need to strive to consistently improve. It’s all possible so long as our brains tell us we actually want to.<\/p>\n<p>Read the book to find out what you can do to adopt a growth mindset—or, if you’re already there, use it to reach your full potential.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/73330071-56ef-415f-8b87-b4501bc2cbce_pasted20image200.png\" alt=\"Influence: The Psychology of Persuasion\" \/><\/p>\n<h2>3. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Influence-Psychology-Persuasion-Robert-Cialdini\/dp\/006124189X\/\">Influence: The Psychology of Persuasion<\/a><\/span><span style=\"font-weight: bold;\"> by Dr. Robert Cialdini<\/span><\/h2>\n<p>What makes people say <span style=\"font-style: italic;\">yes<\/span>? If you knew the answer to that question, wouldn’t it be easier to sell to customers?<\/p>\n<p>Dr. Robert Cialdini’s <span style=\"font-style: italic;\">Influence <\/span>is a modern classic that small business owners and marketers have been leveraging more than 30 years. The book teaches the six universal principles of persuasion, according to Cialdini, how you can use those to influence customer behavior, and what you can do to protect yourself from being subconsciously persuaded.<\/p>\n<p>While you’re at it, check out Cialdini’s follow-up book, <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Pre-Suasion-Revolutionary-Way-Influence-Persuade-ebook\/dp\/B01C36E2YS\">Pre-Suasion<\/a><\/span>, which explores what you can do to prime your audience so they’re more susceptible to your persuasion when the messages arrives.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/ee10ba58-5eb4-4cc5-9dd7-9699bfb78efa_pasted20image200.png\" alt=\"The Art of War\" \/><\/p>\n<h2>4. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Art-War-Sun-Tzu\/dp\/1599869772\/\">The Art of War<\/a><\/span><span style=\"font-weight: bold;\"> by Sun Tzu<\/span><\/h2>\n<p>Written around 500 B.C., Sun Tzu’s <span style=\"font-style: italic;\">The Art of War <\/span>is a timeless book on military strategy that remains surprisingly relevant today—not just on the battlefield, but also in the business world.<\/p>\n<p>The book is divided into 13 short chapters, each which explores a different facet of warfare. While you might want to skip over the chapter on terrain if you’re in a pinch for time, there are several lessons in the book that you’ll definitely want to read—and it won’t take that long, either.<\/p>\n<p>For example, Sun Tzu recommends keeping your plans secret. If your enemy (i.e., your competitor) knows what you’re doing before you’ve actually done it, you’ll be easier to defeat. What might that mean for your business? You might not want to broadcast a game-changing new product or service until you’re ready to roll it out.<\/p>\n<p>Sun Tzu also recommends building a team full of talented people and training and treating them well—advice you can apply to your small business right now.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/7ab52126-b52b-40e6-8ae6-6647b750dcf9_pasted20image200.png\" alt=\"The E-Myth Revisited: Why Most Businesses Don’t Work and What to Do About It\" \/><\/p>\n<h2>5. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Myth-Revisited-Small-Businesses-About\/dp\/0887307280\/\">The E-Myth Revisited: Why Most Businesses Don’t Work and What to Do About It<\/a><\/span><span style=\"font-weight: bold;\"> by Michael E. Gerber<\/span><\/h2>\n<p>Eighty percent of small businesses fail. A big reason for that is that being incredibly proficient in a craft is not the same thing as running a business. You may be one of the most skilled people in your industry, but that doesn’t necessarily mean you’ll be able to build a successful company.<\/p>\n<p>Originally published in 1988, <span style=\"font-style: italic;\">The E-Myth Revisited <\/span>is an updated entrepreneurial guidebook written by Michael Gerber that explores why so many small businesses fail and gives entrepreneurs tips on how they can avoid suffering a similar fate.<\/p>\n<p>For Gerber, small business success requires a delicate balance of three distinct personalities: <span style=\"font-weight: bold;\">the technician <\/span>(i.e., someone who’s an expert), <span style=\"font-weight: bold;\">the entrepreneur<\/span> (i.e. the big picture thinker), and <span style=\"font-weight: bold;\">the manager<\/span> (i.e., the one who’s focused on the details).<\/p>\n<p>All small business owners possess each of these three skill sets; building a successful company starts with leveraging all of them. Successful companies are also built on repeatable processes (more so than great products) and proven business models.<\/p>\n<p>How do your managerial style and business foundations stack up?<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/c9238434-6108-411b-9908-5f2cf3a46326_pasted20image200.png\" alt=\"The Effective Executive\" \/><\/p>\n<h2>6. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Effective-Executive-Definitive-Harperbusiness-Essentials\/dp\/0060833459\">The Effective Executive<\/a><\/span><span style=\"font-style: italic;\"> <\/span><span style=\"font-weight: bold;\">by Peter F. Drucker<\/span><\/h2>\n<p>Would you use the word “effective” to describe your managerial style? If not, or if you’re not sure, you need to read Peter Drucker’s 1967 classic <span style=\"font-style: italic;\">The Effective Executive<\/span>.<\/p>\n<p>To thrive as a leader, executives need to figure out how to get the <span style=\"font-style: italic;\">right <\/span>things done. For Drucker, effective executives have great time management skills. They’re also able to work productively while delegating tasks to the best people. Effective executives prioritize and make the right decisions at the right times.<\/p>\n<p>If that doesn’t sound like your managerial style, don’t sweat it—Drucker says effectiveness can be learned. Pick up this classic management book to find out how.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/48da2d4d-0e02-4a3b-bb4c-44d6a8a5d802_pasted20image200.png\" alt=\"Start with Why: How Great Leaders Inspire Everyone to Take Action\" \/><\/p>\n<h2>7. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Start-Why-Leaders-Inspire-Everyone\/dp\/1591846447\/\">Start with Why: How Great Leaders Inspire Everyone to Take Action<\/a><\/span><span style=\"font-weight: bold;\"> by Simon Sinek<\/span><\/h2>\n<p>Do you want to be a leader who inspires your team? If you’re struggling to get there, it may be because you’re focusing on the wrong question.<\/p>\n<p>Simon Sinek’s <span style=\"font-style: italic;\">Start with Why <\/span>examines how the world’s most successful companies (e.g., Apple) got to where they are. Sinek posits that it’s not by chance but rather due to the fact that these businesses were created for a specific purpose (the <span style=\"font-style: italic;\">why<\/span>) that’s greater than a simple product.<\/p>\n<p>Apple employees, for example, are inspired by the opportunity to create game-changing products that improve the lives of countless customers around the world. Compare this to companies that started by answering the question <span style=\"font-style: italic;\">what, <\/span>i.e., which particular products or services will be offered, and <span style=\"font-style: italic;\">how <\/span>those products or services will be built and delivered.<\/p>\n<p>Why does your business exist? Successful businesses, per Sinek, are inspired by a sense of purpose and meaning (the <span style=\"font-style: italic;\">why<\/span>) and work backward to figure out the <span style=\"font-style: italic;\">how <\/span>and the <span style=\"font-style: italic;\">what<\/span>. It may seem a little counterintuitive, but if you have visions of growing your small business into a large one—or at least a more successful one—you may want to meditate on Sinek’s advice.<span style=\"font-style: italic;\"> <\/span><\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/224b308f-062c-4b7f-aa5c-90b596a543a3_pasted20image200.png\" alt=\"The Creative Habit: Learn It and Use It for Life\" \/><\/p>\n<h2>8. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Creative-Habit-Learn-Use-Life\/dp\/0743235274\/\">The Creative Habit: Learn It and Use It for Life<\/a><\/span><span style=\"font-style: italic;\"> <\/span><span style=\"font-weight: bold;\">by Twyla Tharp<\/span><\/h2>\n<p>Successful entrepreneurs are creative by design.<\/p>\n<p>Business owners, for example, need to get creative when the unpredictable happens—like the time your biggest client suddenly announces they’re not going to renew their contract for whatever reason.<\/p>\n<p>In <span style=\"font-style: italic;\">The Creative Habit: Learn It and Use It for Life<\/span>, Twyla Tharp—one of America’s most well-known and successful dancers\/choreographers—explains how we can become more creative and use our newfound creativity to do the best work of our lives.<\/p>\n<p>Let her insights into what one of the most talented living dancers has done to harness her creativity and take her craft to the next level inspire your own success.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/792a5f0d-9661-4479-a0ca-643faf5c3de3_pasted20image200.png\" alt=\"High Output Management\" width=\"500\" \/><\/p>\n<h2>9. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/High-Output-Management-Andrew-Grove\/dp\/0679762884\">High Output Management<\/a><\/span><span style=\"font-style: italic;\"> <\/span><span style=\"font-weight: bold;\">by Andrew Grove<\/span><\/h2>\n<p>Andy Grove, the former chairman and CEO of Intel, knows a thing or two about management.<\/p>\n<p><span style=\"font-style: italic;\">High Output Management<\/span>, written in 1995, is Grove’s highly regarded guide small business owners have relied on for two-plus decades to become better managers and help their companies get more done more effectively.<\/p>\n<p>Some highlights from this popular book include:<\/p>\n<ul>\n<li>Don’t underestimate the importance of process. Successful companies are built on a foundation of repeatable processes. Everything from creating code to writing a blog to filling out a spreadsheet should be repeatable.<\/li>\n<li>Don’t meet for the sake of meeting. All of your meetings should have a purpose. Otherwise, you’re wasting time and money.<\/li>\n<li>Don’t underestimate the power of a proper performance review. Use performance reviews to actually improve performance by focusing on the important things and ignoring the unimportant things.<\/li>\n<li>Don’t try to do everything yourself. Successful managers know how to delegate effectively.<\/li>\n<\/ul>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/4e4344bd-8850-476e-a7f9-e8c679ee201f_pasted20image200.png\" alt=\"\" \/><\/p>\n<h2>10. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/How-Win-Friends-Influence-People\/dp\/0671027034\">How to Win Friends and Influence People<\/a><\/span><span style=\"font-weight: bold;\"> by Dale Carnegie<\/span><\/h2>\n<p>Dale Carnegie’s <span style=\"font-style: italic;\">How to Win Friends and Influence People <\/span>is a time-tested classic that’s sold more than 30 million copies since it was released in 1936—making it one of the best-selling books of all time.<\/p>\n<p>Once a successful salesman, Carnegie eventually left his sales career and took up public speaking, and the advice from his seminars was compiled into this book. Read it and learn how to get people to like you, how to convince others that your reasoning is the right way of looking at an issue, and how to change folks without them hating you for it.<\/p>\n<p>One important takeaway from the book? If you want to change someone, avoid criticizing them. Criticism is often met with force; criticize someone and they’re likely to think worse of you and listen to you less.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/e7a59d5c-ef83-493c-bf2f-f3f301e37892_pasted20image200.png\" alt=\"\" \/><\/p>\n<h2>11. <span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Impossible-Ignore-Memorable-Influence-Decisions\/dp\/153662781X\">Impossible to Ignore<\/a><\/span><span style=\"font-weight: bold;\"> by Dr. Carmen Simon<\/span><\/h2>\n<p>Written by cognitive scientist Dr. Carmen Simon, <span style=\"font-style: italic;\">Impossible to Ignore <\/span>explores what we can do to influence people in today’s fast-paced world that exposes us to countless messages every day—or even every minute.<\/p>\n<p>Generally speaking, your small business’ audience will forget 90% of your messaging. In order to succeed, you need to cut through the noise and make sure that your key messages hit home—and stay there.<\/p>\n<p>Inspiring future action starts with creating lasting memories that will live in your audience’s mind long after you’re done speaking or they’re done reading a blog post or watching a video. To do this, Dr. Simon suggests leveraging 15 variables that can influence memory—like context, emotion, repetition, cues, and surprise.<\/p>\n<p>Pick up the book to learn how your small business can create lasting memories for your audience—persuading them to act as you want them to act at a future date.<\/p>\n<p><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/9e71b1d0-ce27-4c7c-ab11-64af992bf9dc_pasted20image200.png\" alt=\"Guerilla Marketing\" border=\"1\/\" \/><\/p>\n<h2>12<span style=\"font-style: italic;\">. <\/span><span style=\"text-decoration: underline; font-style: italic;\"><a href=\"https:\/\/www.amazon.com\/Guerilla-Marketing-Inexpensive-Strategies-Business\/dp\/0618785914\">Guerilla Marketing<\/a><\/span><span style=\"font-weight: bold;\"> by Jay Conrad Levinson<\/span><\/h2>\n<p>Originally published in 1983, <span style=\"font-style: italic;\">Guerilla Marketing <\/span>is filled with a wealth of real-world tips and tricks small business owners can use to take their marketing game to the next level.<\/p>\n<p>Whereas traditional marketing wisdom used to suggest big budgets and lots of resources are requisites for success, author Jay Conrad Levinson thinks otherwise: Every time your small business interacts with anyone outside of your company is an opportunity to market your products and services.<\/p>\n<p>For Levinson, effective marketing doesn’t necessarily require tons of money. It does, however, require significant amounts of time and a bit of cunning.<\/p>\n<p>Instead of buying expensive ads in a newspaper or magazine—or even online—devise a clever PR stunt for your small business to get coverage for free. For example, if you’re opening up a new <span style=\"text-decoration: underline;\"><a href=\"https:\/\/fundbox.com\/blog\/digitally-advertise-landscaping-business\/\">landscaping business<\/a><\/span>, hire a juggler, head to the busy part of town and give out swag (e.g., T-shirts) and coupons to whoever’s around. Similarly, instead of trying to get new people to buy your products with a well-designed ad or banner, give them away for free to generate interest.<\/p>\n<p>Bottom line? What worked for small businesses 30 years ago no longer applies. A little creativity and a willingness to invest your time in unconventional marketing endeavors can go a long way toward the success of your small business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you’re looking for productivity tips, wondering how to market your business better and persuade your customers more effectively, or &#8230;<\/p>\n","protected":false},"author":14,"featured_media":9166,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[72,10158,11547],"yst_prominent_words":[5541,723,719,8619,8623,8622,8616,8617,6420,712,709,2127,8621,8620,8612,8611],"post-meta-fields":{"stripe_selected":"top-left-risks","preview_color":"yellow","bw_feature":"no","category_color":null},"yoast_title":"12 of the Best Books for Business Owners &amp; Entrepreneurs | Fundbox","yoast_meta":[{"name":"description","content":"Whether you’re looking for productivity tips, wanting to become a more impactful manager, or something else, there’s something on this list for you. Explore now."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"12 of the Best Books for Business Owners &amp; Entrepreneurs | Fundbox"},{"property":"og:description","content":"Whether you’re looking for productivity tips, wanting to become a more impactful manager, or something else, there’s something on this list for you. Explore now."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/12-must-read-books-for-business-owners-entrepreneurs\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/shutterstock_349343228.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/shutterstock_349343228.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Whether you’re looking for productivity tips, wanting to become a more impactful manager, or something else, there’s something on this list for you. Explore now."},{"name":"twitter:title","content":"12 of the Best Books for Business Owners &amp; Entrepreneurs | Fundbox"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/04\/shutterstock_349343228.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/12-must-read-books-for-business-owners-entrepreneurs\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9150"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=9150"}],"version-history":[{"count":7,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9150\/revisions"}],"predecessor-version":[{"id":15750,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9150\/revisions\/15750"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9166"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=9150"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=9150"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=9150"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=9150"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}