{"id":9201,"date":"2018-05-10T08:14:00","date_gmt":"2018-05-10T15:14:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=9201"},"modified":"2019-02-08T09:41:57","modified_gmt":"2019-02-08T17:41:57","slug":"freshbooks-vp-of-marketing-on-how-small-businesses-can-win","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/freshbooks-vp-of-marketing-on-how-small-businesses-can-win\/","title":{"rendered":"FreshBooks VP of Marketing on How Small Businesses Can Win"},"content":{"rendered":"<p>Bart Molenda has had a long and fascinating career in marketing, having contributed to the growth of such household names as eBay and Square. We recently chatted with him over video about his current role as Vice President of Marketing at FreshBooks. He shared his observations about small businesses, what he foresees will be huge shifts in how we interact with customers using mobile technology, and how he recommends brands can set themselves apart from the rest in a crowded market.<\/p>\n<p><em><small>Note: This interview has been edited for length.<\/small><\/em><\/p>\n<p>&nbsp;<\/p>\n<figure style=\"width: 600px\" class=\"wp-caption aligncenter\"><img src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/05\/5b3e5fa9-272f-4b9e-a05b-61a33762dd89_Bart-Molenda-Headshot20Outside_preview.jpeg\" alt=\"Bart Molenda, VP of Marketing at FreshBooks.\" width=\"600\" \/><figcaption class=\"wp-caption-text\"><em>Bart Molenda, Vice President of Marketing, FreshBooks.<\/em><\/figcaption><\/figure>\n<p><span style=\"font-style: italic;\">Fundbox: In just a few words, what’s your role at FreshBooks?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">Bart Molenda:<\/span> I&#8217;m the VP of Marketing at <a href=\"http:\/\/freshbooks.com\">FreshBooks<\/a>. I focus on acquisition in particular. What that means for us is helping connect our brand with self-employed freelance professionals around the world.<\/p>\n<p><span style=\"font-style: italic;\">The small business market is incredibly fragmented. Have you observed this?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM:<\/span> Yes, the industry is very fragmented. We’re seeing new entrants trying to capture a small piece of the market. You saw this originally in things like display and programmatic advertising. I think fintech, or anything to do with linking finances or lending, has been historically controlled by just a few players.<\/p>\n<p style=\"padding-left: 30px;\">Now the democratization of this category means it’s becoming more accessible to more people through technology. The result is heavy fragmentation, and we are not yet at the stage of seeing consolidation of the industry. If anything, more fragmentation is going to come, more startups will try and take a small piece of the market.<\/p>\n<p><span style=\"font-style: italic;\">What kind of strategy do you use to break through the noise for FreshBooks?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM:<\/span> When trying to cut through the noise, it&#8217;s more important than ever to be niche and focus on a core group, not dilute the message with too many offerings or brand promises. In this world, it&#8217;s key to describe exactly what you are and to have a very well put together onramp for your core services. We definitely experienced that [when I was head of paid marketing at Square] as well. From a wide-angle payments radar, to several years later it becoming a real business solution for many different needs.<\/p>\n<p style=\"padding-left: 30px;\">It&#8217;s hard to sell all of those products all at once. It can be confusing for customers. I&#8217;ve always believed in representing a core idea to your audience, a value proposition that resonates with them as their most critical and important business need.<\/p>\n<p><span style=\"font-style: italic;\">When you talk about speaking to your market, are you talking about the whole market for cloud-based accounting solutions, since that&#8217;s what you provide at FreshBooks?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Yes. That market now has many people who call themselves “solopreneurs.” They’re in a grey area. Are they individuals? Are they small businesses? Have they formalized the business? Or are they operating casually as an individual and therefore giving out signals as if they&#8217;re a consumer, rather than a business? There&#8217;s a very big segment of customers that aren’t represented in Dun &amp; Bradstreet&#8217;s 26 million businesses. There’s a large group of people who are less obviously operating as businesses.<\/p>\n<p><span style=\"font-style: italic;\">You&#8217;ve spoken previously about the importance of data and how marketing is transitioning from being an art-based department to a data-driven department. Is that something that you feel is in transition at FreshBooks, or is that something that&#8217;s been going on for a while?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> It&#8217;s been going on for a while, and every marketer and company who wants to stay in business for the long-term knows this and will continue to play this card. We&#8217;re always improving to try and do better, but that is certainly my focus in how we build teams and how we think about success is that it&#8217;s driven by&#8211; in the past in the Mad Men era it was driven by instinct and by creative people problem-solving, and information asymmetry. It’s no longer like that.<\/p>\n<p style=\"padding-left: 30px;\">Increasingly, the minds of many will think better than the minds of a few. I certainly try and instill that [in my organization]. That&#8217;s changing more and more everywhere to enable that data and the clarity of how to make decisions off of data to happen in any part of the world.<\/p>\n<p><span style=\"font-style: italic;\">I definitely agree: it&#8217;s better when your whole team is armed with the data to make decisions in their work rather than having data concentrated at the top. Do you think there are ways that smaller business owners could take that insight and implement it in their firms?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> You need to have a lot of well-thought-out processes in place to help you make decisions. Those processes should be set up so that you’re able to automate, replicate, and easily scale, because if you&#8217;re repeating the processes of making decisions, there&#8217;s agony in that in the form of wasted time and potential errors. Using automation and understanding what tools are available to you, and allowing the tools to make the decisions based on the outcomes is the way that small businesses can succeed.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/05\/3623f2d8-aeb9-40d4-aff2-b72a2bcb1aea_Freshbooks202.png\" alt=\"\" \/><\/p>\n<p><span style=\"font-style: italic;\">That&#8217;s some good advice that applies to firms of all different sizes.<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> One thing that sometimes falls off the list in the face of this push to democratize data, is experience. An example I&#8217;ve run into several times on this in different companies that I worked out is that, I would say, energetic people that don&#8217;t have experience or haven&#8217;t seen multiple things often believe they could build a new tool that would be better than something that&#8217;s already built. One example like this is, your typical analytics tool set, like Google Analytics, let’s say. A lot of individuals might think that they could build a better version of Google Analytics because they could customize it to their organization.<\/p>\n<p style=\"padding-left: 30px;\">When you&#8217;re armed with a lot of people who are young and energetic, it&#8217;s hard for them to say, &#8220;Well, let&#8217;s take an existing structure and put in place and just use that even though it&#8217;s not 100% perfect.&#8221; If it’s 90%, it’s good enough. Good enough and quick can take you a long way.<\/p>\n<p><span style=\"font-style: italic;\">Since FreshBooks is a cloud-based tool, you must have an incredible amount of data at your disposal. Could you talk about trends that you’re seeing among your small business customers?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> In terms of big changes, we have to recognize that it’s not just mobile-first anymore. You’ll likely be mobile-primary, like primary and <span style=\"font-style: italic;\">only<\/span>, and that a lot of businesses will just run their entire business off of their mobile phone or in a mobile version [of your software].<\/p>\n<p style=\"padding-left: 30px;\">It’s like five years ago or eight years ago I told you that transportation services would be running off of the mobile phone. A few years ago, you might have said, no way! Obviously we are now in that world, where some businesses run only on mobile. I think that we’ll start seeing that more and more, even in B2B. Credit professionals, IT professionals, legal and trades folks.<\/p>\n<p style=\"padding-left: 30px;\">Additionally, there’s more ways to think about input now, not just keyboard but also photos, voice recognition, voice searches and commands, and then there’s the AI for interpreting those commands. Those are all big trends.<\/p>\n<p><span style=\"font-style: italic;\">Do you have a point of view on the millennial age group sea change and how that has changed expectations on things like UX and product delivery?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> Yes, I believe there is a large generational impact. This generation versus older generations will probably not only discover new things on their mobile phone, but primarily use their mobile phone versus other devices. In the future the technology will just be ubiquitous, in your contact lens or in whatever you want. How we will operate information systems will potentially change how we do business.<\/p>\n<p style=\"padding-left: 30px;\">The other part of that thought too is that we are more and more locked into a few ecosystems. The majority of people’s day around the world is now spent between Instagram, Facebook, Google, and Amazon.<\/p>\n<p style=\"padding-left: 30px;\">And if that’s where the lion’s share of time is spent, well, what does that mean? Does that require more integration within those products and in those those apps? Will you just be conducting yourself in your business within those apps as well? That’s what I’m really curious about: what’s the role of those few giants in tech, and how will the rest of us operate within them?<\/p>\n<p><span style=\"font-style: italic;\">T<\/span><span style=\"font-style: italic;\">alking about those giants in tech and how much power they really have over our experiences, it makes me think about going back to the fintech and credit world. At Fundbox, we talk internally about having empathy, and the <\/span><span style=\"font-style: italic;\">responsibility that we feel that companies <\/span><span style=\"font-style: italic;\">like ours should be an active force of good for trying to help level the playing field for underserved segments of the population, in our case small business owners. Do you have a point of view on that topic?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">:<\/span> We have a company mandate on community involvement and that’s speaking to our customers. Everyone has their own objectives around speaking to customers every quarter, as well as getting involved with the community. We make an active effort to be in the market, and we have dedicated volunteer days off per quarter that we&#8217;re encouraged to take.<\/p>\n<p style=\"padding-left: 30px;\">The other thing that we do is, we invest a lot in customer service. I would say it’s a large differentiator in our business that we have no automatic voice response in our phone system. It’s ring and pick up. That is specifically set up in order to go above and beyond for our customers, and going above and beyond is helping them with the tool and helping them something that they might not be an expert in. We pride ourselves on taking the time and we have no call time targets or even really queues that we are managing there to speak to our customers in order to make their lives easier and to enable them to become more successful.<\/p>\n<p><span style=\"font-style: italic;\">At FreshBooks, how do you use data science to improve your services or marketing?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM: <\/span>We use data a couple of ways. We use it for understanding and preventing churn. We use it for understanding the effectiveness of our marketing activities. We use it for understanding the performance of our product, how to display things to get the most value out of them, and how to keep customers coming back more often. I&#8217;d say those are like probably three strong tenants of data science in our business.<\/p>\n<p><span style=\"font-style: italic;\">Our companies are working to bring about a change in how small businesses operate and transact. Can you comment on the changes that you&#8217;ve observed in the category of how small businesses manage their credit and their finances?<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM<\/span><span style=\"font-weight: bold;\">: <\/span>One of my earlier gigs in payments was in Canada for the largest payment provider in the country. They have about just over between 40% and 50% reach of the Canadian market in payments, the largest provider in Canada.<\/p>\n<p style=\"padding-left: 30px;\">When you&#8217;re that big, you can stipulate a lot of rules for your customers. Rules make it challenging for people to do business. If you&#8217;re putting a lot of obstacles and obstructions in running a small business, you&#8217;re preventing growth and  you’re just not going to have a thriving economy.<\/p>\n<p style=\"padding-left: 30px;\">For example, five or seven years ago, it was not that common to pay for coffee with a credit card, nor was it easy [for a restaurant owner] to get lending in order to buy the groceries that you need for tomorrow in order to cook that food and have it available.<\/p>\n<p style=\"padding-left: 30px;\">You need money in order to pay people. Barriers to credit are just a hindrance to small businesses. I&#8217;ve known situations where people are trying to start business and get credit card processing and the banks think that it&#8217;s too high risk to offer this person credit card processing even though they are a tiny sandwich shop and you want them to take out equity out of their home or put their home up as collateral for this small business. That&#8217;s crazy talk. But it&#8217;s so common.<\/p>\n<p style=\"padding-left: 30px;\">I know people who are on the brink of losing everything because they can&#8217;t fund their business for growth—to pay for the groceries that they need in order to cook the food that they will be serving the customers the next day. That lending, that entire credit ecosystem, is so critical. The providers that are doing that are life blood, critical for the country&#8217;s success.<\/p>\n<p style=\"padding-left: 30px;\">In some ways, it has never been easier to start a business, but it&#8217;s also never been harder to scale a business. That&#8217;s what we’re seeing in our generation right now where 40 or 50 years ago in our parents and grandparents generation, it was very hard to start a business. Once you started it there wasn&#8217;t lot of competition. You could go and fund your business. Right now, the tide is turning.<\/p>\n<p><img class=\"aligncenter\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/05\/95ea9de1-0801-4045-8255-5e69d2827e8a_Freshbooks.png\" alt=\"\" \/><\/p>\n<p><span style=\"font-style: italic;\">Great observations. It&#8217;s really exciting to work at companies that are part of that change, since it’s such a huge economic driver that&#8217;s kind of trapped.<\/span><\/p>\n<p style=\"padding-left: 30px;\"><span style=\"font-weight: bold;\">BM: <\/span>Yes. Everybody&#8217;s got a hidden talent somewhere. There&#8217;s plenty of examples where someone has some basic carpentry knowledge or someone has a hobby for photography, or someone is a good interior designer&#8230; They can go off and work for themselves. Companies like Fundbox and FreshBooks enable this economy.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bart Molenda has had a long and fascinating career in marketing, having contributed to the growth of such household names &#8230;<\/p>\n","protected":false},"author":61,"featured_media":9211,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[],"yst_prominent_words":[8673,8674,723,1132,724,4321,798,1179,8457,949,8675,8672,1521,8676,8681,712,1126,1625,8352,8680],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"FreshBooks VP of Marketing on How Small Businesses Can Win | Fundbox Blog","yoast_meta":[{"name":"description","content":"Bart Molenda discusses his current role as Vice President of Marketing at FreshBooks, his insights about the small business market, and how brands can win in today&#039;s rapidly changing increasingly-mobile world."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"FreshBooks VP of Marketing on How Small Businesses Can Win | Fundbox Blog"},{"property":"og:description","content":"Bart Molenda discusses his current role as Vice President of Marketing at FreshBooks, his insights about the small business market, and how brands can win in today&#039;s rapidly changing increasingly-mobile world."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/freshbooks-vp-of-marketing-on-how-small-businesses-can-win\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/05\/shutterstock_458395282.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/05\/shutterstock_458395282.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Bart Molenda discusses his current role as Vice President of Marketing at FreshBooks, his insights about the small business market, and how brands can win in today&#039;s rapidly changing increasingly-mobile world."},{"name":"twitter:title","content":"FreshBooks VP of Marketing on How Small Businesses Can Win | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/05\/shutterstock_458395282.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/freshbooks-vp-of-marketing-on-how-small-businesses-can-win\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9201"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=9201"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9201\/revisions"}],"predecessor-version":[{"id":10445,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9201\/revisions\/10445"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9211"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=9201"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=9201"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=9201"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=9201"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}