{"id":9372,"date":"2018-06-08T08:29:00","date_gmt":"2018-06-08T15:29:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=9372"},"modified":"2022-06-24T08:14:18","modified_gmt":"2022-06-24T15:14:18","slug":"technology-transforming-lending-marketplaces","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/technology-transforming-lending-marketplaces\/","title":{"rendered":"How Technology is Transforming Lending Marketplaces"},"content":{"rendered":"<h2><em>The State of Small Business Lending: Q&amp;A with Lending Express’s CEO<\/em><\/h2>\n<p>The lending landscape has shifted significantly in the past several years, with new players entering the fray all the time. Eden Amirav, the cofounder and CEO of <span style=\"text-decoration: underline;\">Lending Express<\/span>, is a serial entrepreneur with a background in marketing and technology. Like many savvy entrepreneurs he spotted the opportunity in the market, tested it in Australia and launched Lending Express in the U.S. about 18 months ago.<\/p>\n<p>Lending Express, born in Israel, touts its innovative technology as its market differentiator. As part of our interview series on <span style=\"font-style: italic;\">The State of Small Business Lending<\/span>, we talked to Amirav about how lending marketplaces operate and why alternative financing can be a savior to small businesses.<\/p>\n<figure id=\"attachment_9374\" aria-describedby=\"caption-attachment-9374\" style=\"width: 300px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-9374 size-medium\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/Eden-Amirav-1000px.jpg\" alt=\"Eden Amirov, CEO of Lending Express\" width=\"300\" height=\"300\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/Eden-Amirav-1000px.jpg 800w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/Eden-Amirav-1000px-150x150.jpg 150w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><figcaption id=\"caption-attachment-9374\" class=\"wp-caption-text\"><em>Eden Amirov, CEO of Lending Express<\/em><\/figcaption><\/figure>\n<hr \/>\n<p><em>Fundbox: What is it like to be a Fintech company founded in Israel?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: It’s great. Fintech is growing globally—last year it was a $31 billion industry in the U.S. alone. And Israel is leading the way, even though many in the world of alternative lenders, don’t even have operations in Israel. They’re mostly in the States.<\/p>\n<p style=\"padding-left: 30px;\">Our Fintech ecosystem includes some of the now leading alternative lenders in the U.S., like <a href=\"http:\/\/fundbox.com\/blog\/\">Fundbox<\/a> and Behalf. It’s amazing how well the Israeli model lends itself to operations overseas—but not so surprising.<\/p>\n<p style=\"padding-left: 30px;\">What sets Israel apart from other fintech hubs around the world is the sense of partnership within the ecosystem here. At the end of the day, we all want to help our customers and users, and the best way to do it is by working together—knowledge sharing, collaborating, helping each other and more.<\/p>\n<p><em>How did you notice there was a need in the U.S.?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: We have many years of experience in online marketing and were aware of the lending vertical. We understood the lending landscape was a bit broken, and thought we could fix it.<\/p>\n<p><em>Is your approach to building technology different than what we find in the U.S.?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: Absolutely. We are the only marketplace that uses advanced AI and machine learning for user acquisition and matching businesses to lenders.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">One of our key company values, which is also part of pretty much any Israel company’s DNA, is to build innovative technology and think outside the box to disrupt traditional, dinosaur industries. When we founded Lending Express, we didn’t want to simply plug a hole; we wanted to fundamentally change the industry for the better.<\/p>\n<\/blockquote>\n<p style=\"padding-left: 30px;\">It’s why we developed our proprietary MatchScore&#x2122; technology, which is redefining how lending is qualified, and gives lenders and loan seekers the best chance at a favorable outcome. MatchScore looks at each company differently. Our filters allow us to match the business with the lenders most qualified for them. It’s similar to online dating—it’s about matching the right business with the optimum lender.<\/p>\n<p><em>What motivated you to build a marketplace for lending?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: There is a huge disconnect between the demand for business loans and the processes in place to meet it—the industry is broken. Even when we take traditional lending out of the equation, alternative lending may be the most accessible solution, but it is certainly not perfect.<\/p>\n<p style=\"padding-left: 30px;\">With<a href=\"https:\/\/www.denverpost.com\/2017\/05\/21\/alternative-online-lenders-small-business\/\"> <\/a><span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.denverpost.com\/2017\/05\/21\/alternative-online-lenders-small-business\/\">1,300 alternative lenders<\/a><\/span> competing for 1% of the overall credit market (versus 6,500 traditional banks competing for the remaining 99%), the market is growing rapidly<span style=\"font-weight: bold;\"> <\/span>and is now virtually saturated with options, many of which are indistinguishable from each other. How do loan seekers know who is the best and most legitimate lender? And how do alternative lenders, each with their niche, target audiences, find the most qualified candidates?<\/p>\n<p style=\"padding-left: 30px;\">For instance, lenders look for different business types. We created the Lending Express marketplace to employ our cutting-edge, innovative trademarked MatchScore&#x2122; algorithm to find the perfect match between borrowers and lenders. And it’s free.<\/p>\n<p style=\"padding-left: 30px;\">At the end of the day, innovation is about figuring out your strengths. Lenders should be able to focus on their core business of providing financing to SMBs, while Lending Express should focus on programming and bridging market gaps between SMB loan seekers and loan lenders.<\/p>\n<p><em>With many other marketplaces out there, what makes yours different?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: Lending Express uses superior technology and deeper data that make it faster and more accurate than other marketplaces.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">As computer programmers by trade, we were able to develop a program that uses AI to collect and evaluate data about loan seekers’ banking activity and credit history. And it does that so much faster than the competition and offers greater ease to the customer.<\/p>\n<\/blockquote>\n<p style=\"padding-left: 30px;\">That data is then plugged into two custom algorithms—also developed and trademarked by our team—that are able to predict a customer’s desirability as a loan candidate, and match them with a lender interested in customers that fit that profile.<\/p>\n<p style=\"padding-left: 30px;\">This system also protects both loan lenders and loan seekers by using data to glean a deeper understanding of each party’s legitimacy. Our approach supports the development of an automated, smart marketplace for loans and operates in tandem with the future of banking and finance as an instant and easy process.<\/p>\n<p style=\"padding-left: 30px;\">We use all data points, leveraging the AI. Technology gives an objective view, and [delivers a great] user experience. You get a response immediately; you don’t need to wait.<\/p>\n<p style=\"padding-left: 30px;\">We can look at a company’s credit history and all information about that business—and it all happens online digitally. Other places use call centers, we use technology and data. [In a world of] dinosaurs, Lending Express is the 2.0 of loan matching.<\/p>\n<p><em>There seem to be a number of marketplaces like yours emerging. Do you have to contend with credibility issues?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: Everyone is concerned, [wonders] how can I know I can trust you? We get great feedback from Trust Pilot and from our loan partners and small business owners.<\/p>\n<p style=\"padding-left: 30px;\">In addition to our technology, which alone proves our credibility in developing smart and automated financial solutions, our numbers speak for themselves. Since we began operations in the last quarter of 2016, we have facilitated close to 2,000 loans totaling $45 million. The average loan size [on our platform] is $30,000. The largest loan funded was for $350,000.<\/p>\n<p style=\"padding-left: 30px;\">Almost every quarter, we doubled the number of loans we facilitated the previous quarter, showing increasing demand for our services on both the loan-seeking and loan-lending end of the sector.<\/p>\n<p style=\"padding-left: 30px;\">And it’s more than just numbers—the feedback we have received from customers and lending partners has been amazing, with 10 new lending partners registering to be listed on our marketplace this year.<\/p>\n<p><em>How are you reaching business owners?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA:<\/strong> We’re focused on online advertising on Google and Facebook. Targeting who might need loans and getting engagement from those businesses.<\/p>\n<p><em>Some say, “Alternative lending is pricey. Try to avoid it” —as if traditional lenders were welcoming small businesses. How do you overcome this positioning?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: It is inaccurate to say that alternative lending as a whole is pricey. But, rather than getting into a weird area of alternative lenders business practices, let’s focus on why the industry exists in the first place and the service it provides. Because, pricey or not, alternative lending is often the last stop for many SMBs—a lifeline for their businesses, which may not have been “welcomed” by traditional lenders. Alternative lending can be a business’s last stop—if they don’t get money right away , they will shut down.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">It’s extremely rewarding to interact with business owners and help them find the lenders that will support their business ventures after traditional lenders have turned their backs on them. We are providing a gateway to companies that offer these businesses hope for solvency. That&#8217;s very exciting.<\/p>\n<\/blockquote>\n<p><em>What are some of the biggest challenges facing services like yours?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: Financial regulation is a major stumbling block for many fintech startups. Many of the parameters we deal with were developed with traditional financing in mind, during a time when digital banking, lending, and trading wasn’t as widespread as it was today.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">Some regulations are important for protecting banks and the value of the dollar, others exist to protect the everyday person from being exploited. But some exist simply because they are part of an “Old World Order” that rejects the way the financial landscape is changing.<\/p>\n<\/blockquote>\n<p style=\"padding-left: 30px;\">Even in Israel, where one of our offices is based, people have to pay in order to withdraw their own money from their bank accounts…regulation is a serious and daunting challenge. Many alternative lenders are participating in the SBFA—Small Business Financing Association—which plans to present suggested changes to Congress. We might join.<\/p>\n<p><em>What is the future of marketplaces like yours?<\/em><\/p>\n<p style=\"padding-left: 30px;\"><strong>EA<\/strong>: We believe there is room for a leading marketplace to become the brand that every small business knows, rather than having to know the name of every online lender in the market—of which there are thousands.<\/p>\n<p style=\"padding-left: 30px;\">As a start-up, we very much identify with SMB challenges and hope in the future to make Lending Express users priority customers for alternative lenders, meaning if you use our marketplace, your chances of getting a loan increase or you get to cut the line, whether or not you’ve been approved for a loan. We also hope for the same in the opposite direction, that our lending partners will somehow get better treatment because they have registered on our platform.<\/p>\n<p style=\"padding-left: 30px;\">We want to help small business owners find a [lending] match in a quick and easy way. In the future, we hope to use data to provide more financial products and solutions. To help business owners with high-rate credit cards, purchase insurance and reduce fees.<\/p>\n<p style=\"padding-left: 30px;\">We hope to leverage a position of trust. What additional service can we offer to help SMBs expand, [because] we understand the market and challenges.<\/p>\n<h3><\/h3>\n<hr \/>\n<h3> <strong>Hear from more industry leaders on the state of small business lending:<br \/>\n<\/strong><\/h3>\n<ul>\n<li><a href=\"https:\/\/fundbox.com\/blog\/the-state-of-small-business-lending-qa-with-varos-ceo\/\">Building the Future of Banking with Varo’s CEO Colin Walsh<\/a><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/jared-hecht-mission-change-face-small-business-lending\/\">Fundera&#8217;s Jared Hecht is on a Mission to Change the Face of Small Business Lending<\/a><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/state-small-business-lending-fundbox-qa-lendio-ceo-brock-blake\/\">The State of Small Business Lending: Q&amp;A with Lendio CEO Brock Blake<\/a><\/li>\n<li><a href=\"https:\/\/fundbox.com\/blog\/freshbooks-vp-of-marketing-on-how-small-businesses-can-win\/\">FreshBooks VP of Marketing Bart Molenda on How Small Businesses Can Win<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The State of Small Business Lending: Q&amp;A with Lending Express’s CEO The lending landscape has shifted significantly in the past &#8230;<\/p>\n","protected":false},"author":18,"featured_media":9376,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,11547,426],"yst_prominent_words":[3388,2555,8884,723,3283,8891,719,8888,848,8882,2654,8881,8885,3030,8883,712,3279,8890,3027,3024],"post-meta-fields":{"stripe_selected":"","preview_color":"blue","bw_feature":"no","category_color":null},"yoast_title":"How Technology is Transforming Lending Marketplaces | Fundbox Blog","yoast_meta":[{"name":"description","content":"Lending Express, born in Israel, touts its innovative technology as its market differentiator. As part of our interview series on The State of Small Business Lending, we talked to Amirav about how lending marketplaces operate and why alternative financing can be a savior to small businesses."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"How Technology is Transforming Lending Marketplaces | Fundbox Blog"},{"property":"og:description","content":"Lending Express, born in Israel, touts its innovative technology as its market differentiator. As part of our interview series on The State of Small Business Lending, we talked to Amirav about how lending marketplaces operate and why alternative financing can be a savior to small businesses."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/technology-transforming-lending-marketplaces\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/shutterstock_1028363893.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/shutterstock_1028363893.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"668"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Lending Express, born in Israel, touts its innovative technology as its market differentiator. As part of our interview series on The State of Small Business Lending, we talked to Amirav about how lending marketplaces operate and why alternative financing can be a savior to small businesses."},{"name":"twitter:title","content":"How Technology is Transforming Lending Marketplaces | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/shutterstock_1028363893.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/technology-transforming-lending-marketplaces\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9372"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=9372"}],"version-history":[{"count":6,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9372\/revisions"}],"predecessor-version":[{"id":16272,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9372\/revisions\/16272"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9376"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=9372"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=9372"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=9372"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=9372"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}