{"id":9383,"date":"2018-06-11T11:10:00","date_gmt":"2018-06-11T18:10:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=9383"},"modified":"2019-01-28T16:57:47","modified_gmt":"2019-01-29T00:57:47","slug":"irina-martin-consultative-approach-working-capital-financing","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/irina-martin-consultative-approach-working-capital-financing\/","title":{"rendered":"Irina Martin on Her Consultative Approach to Working Capital Financing"},"content":{"rendered":"<p>Today we’re pleased to share a conversation we had with Irina Martin, one half of the hardworking husband and wife team behind <a href=\"https:\/\/expressbusinessloans.com\/\">Express Business Loans<\/a>.<\/p>\n<p>A Fundbox partner and certified women-owned business, Express Business Loans has been around since 2008. In that time, they’ve helped thousands of small businesses across the U.S. get access to capital, offering funding options up to $5MM.<\/p>\n<p>Irina shared her seasoned perspective on the challenges small business owners face when trying to grow, and why she takes a long-term, consultative, and multi-pronged approach to connecting clients with working capital.<\/p>\n<figure id=\"attachment_9387\" aria-describedby=\"caption-attachment-9387\" style=\"width: 500px\" class=\"wp-caption alignnone\"><img class=\"wp-image-9387\" src=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/Irina-Martin-EBL.jpg\" alt=\"Irina Martin, Co-Founder of Express Business Loans\" width=\"500\" srcset=\"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/Irina-Martin-EBL.jpg 800w, https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/Irina-Martin-EBL-768x598.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><figcaption id=\"caption-attachment-9387\" class=\"wp-caption-text\"><em>Irina Martin, Co-Founder of Express Business Loans.<\/em><\/figcaption><\/figure>\n<hr \/>\n<p><b><i>Fundbox:<\/i><\/b><i> Let’s begin with you, Irina: would you introduce yourself and what you do?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>Irina Martin:<\/b> My husband, Michael, and I started ExpressBusinessLoans.com over 10 years ago. I am from Kazakhstan and immigrated here in 2005. My main role is overseeing operations and finance of our firm. Aside from these responsibilities, I also work with small business owners on a daily basis.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">We  see ourselves as small business consultants, and we try to help them grow their business. It&#8217;s a much more personal relationship. Just this week, I’m closing over $100,000 in loans.<\/p>\n<\/blockquote>\n<p><i>What are the challenges you typically face when you&#8217;re working with small business owners? What are some of the biggest challenges that they&#8217;re facing, that you&#8217;re helping them overcome?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Setting expectations. Business owners by their nature are passionate about their business. Many have invested their life savings and have not seen a return. While they may be experts in their field, they may not have the financial tools to achieve sustainable cash flow in the long run. A 4% bank loan or SBA loan is not an option yet. We prefer to take a consultative process to learn the ins-and-outs of their business model and analyze their cash flow. Only then can we see what options are available.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">Running a business can feel like a nonstop sprint. I like to ask clients, “How much did you originally invest to start this business?” And, “Have you paid yourself back? In what time frame do you anticipate seeing a return?”<\/p>\n<\/blockquote>\n<p><i> And how about challenges that you face, doing what you do?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> As one of the principals I can empathize with our clients more strongly than a salesman or client representative at a bank.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">Our firm was bootstrapped from the beginning. I know what it’s like to spend business hours working with clients and then put on my HR, payroll, or finance hat.<\/p>\n<\/blockquote>\n<p style=\"padding-left: 30px;\">In some ways we are dinosaurs in the alternative lending space. When we started in 2007 it was still somewhat of a cottage industry. The relationships ran deeper with our investors and funding partners. The space has seen rapid change, both good and bad, as VC and institutional investors entered the space. We’ve always stayed tried to stay one step ahead by making investments in technology and marketing.<\/p>\n<p><i> One thing that we hear a lot from SMBs is that reducing the time to getting their funds is really important to them, as well as getting access to smaller amounts of funding depending on what they need. If you go to a bank looking for a traditional loan, only certain amounts are available. Sometimes, those amounts are just too large. That&#8217;s where a service like Fundbox would come in. How do you approach helping SMBs overcome those challenges?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b>  Some business owners are wary of even applying for funding because they’re uncertain if they can be approved. I really think Fundbox is a great program. The customers really love it. We deal with a variety of business owners with revenues ranging from $100,000 to $15,000,000. Fundbox is useful to so many because the process is so smooth.<\/p>\n<p><i>It sounds like there&#8217;s a coaching process that goes on to help customers understand how they can get that re-evaluation or how they can get their credit limits raised. Do you do this for all of your customers and lenders?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Yes. A business may be in a totally different situation 2 or 3 years from now. I have clients from 2007 that we still work with. One of the most important parts of our initial consultation is being somewhat brutally honest with them about their business. There is always a next step on the credit ladder.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">Using technology, we can monitor our clients’ cash flow and try to advise them before there any issues that could prevent them from accessing a better option in the future.<\/p>\n<\/blockquote>\n<p style=\"padding-left: 30px;\">If we introduce a client to Fundbox and they are approved for a credit line of $4-5,000, they typically come back to see what the next steps are to increase their limit. It’s also a great complement to some of our other working capital programs. The approvals are priced correctly, so we feel comfortable knowing that we are not putting a client into a program that could leave them overleveraged.<\/p>\n<p><i>Absolutely. It is a new product, it&#8217;s a hybrid product, and I think that a little bit of coaching to help people get the most out of it is really helpful. We believe that education helps customers, who can then be more successful using all the tools available in their toolbox.<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Absolutely, yes. It&#8217;s a little thing, but once you get them on the phone and explain to them what they can do and how it all works, their perspective changes completely. That&#8217;s why we do take our time.<\/p>\n<p><i>When SMBs come to you and they&#8217;re looking to apply for working capital, do you talk to them about how they plan to use the funds?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Our advisers know that this should be the second or third question they ask. We actually get pitched by other working capital providers all the time. It’s funny that the emphasis is always on what the salesman can do, and not what the business needs.<\/p>\n<p style=\"padding-left: 30px;\">We mostly handle inbound requests for working capital. It’s important to understand the use—for example, paying for Christmas inventory with a 5-year term loan program does not make sense. We break down the math so they can see how to use outside capital to effectively grow their business.<\/p>\n<p><i>It sounds like you spend a lot of time giving them personal attention. What kind of trends have you noticed among the clients that you meet?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM: <\/b>We see all types of industries. This week I spoke with several restaurant owners, healthcare firms, auto sales, a garden center, the whole gamut. They are all looking to make an investment in their business and their community. They want to have a cushion and support so as not to overextend themselves while they tackle new projects.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">We started at the beginning of the 2008 recession. For years we heard from business owners that the economy was terrible. That is starting to change. It’s exciting to hear optimism from our clients and what they are doing to improve their business.<\/p>\n<\/blockquote>\n<p><i>What about similarities among the types of customers that end up being a good fit for an alternative lender like Fundbox? Is there a type of customer that you&#8217;ve noticed who benefits the most?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM: <\/b>I think businesses in transportation or trucking, because trucking is a high-risk industry for our space. Their receivables are often delayed and they may only receive payments three or four times a month. They need that cushion of working capital in between work. Smaller construction businesses as well. That can be a cash intensive business for a company that is less than 10 people.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">Business owners love that they can access the Fundbox platform from their pocket. It allows them to take on more jobs and grow their revenue without wondering how they are going to purchase supplies and inventory.<\/p>\n<\/blockquote>\n<p><i>At Fundbox, we are very interested in big data and automation. We believe it has the potential to really help remove barriers in the system that may be holding business owners back. Do you have any thoughts about how AI and big data are changing the lending landscape?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> We are big believers in technology. When we first started we were kind of old school. Ledgers, notebooks, folders.  We have built out our business processes and automated some of the data analysis on our end so we can save our clients time and align their needs with our partners quickly. They can apply with us on their phone, computer, iPad. I have funded clients that were not even in the country!<\/p>\n<p style=\"padding-left: 30px;\">As a woman business owner, I know that securing working capital can be difficult. I think big data can help show that women are just as savvy as entrepreneurs and should have the same access to credit without paying more.<\/p>\n<p style=\"padding-left: 30px;\">We have been using technology to prevent fraud as well. We will verify bank information prior to packaging an application. Our funding partners trust us because we have made these investments and want to do right by them.<\/p>\n<p><i>What advice would you give to small business owners right now about seeking financing? What should they know about choosing a partner to help them?<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Deciding who to work with can be tough. Retail banks are closing branches at an increasing rate as more banking is done online. So it can be difficult to build that trust over the phone or internet.<\/p>\n<p style=\"padding-left: 30px;\">Right now, I’m working with a client from two years ago. She came back to me after working with a broker that put her into a few products that did not match the seasonality of her retail store. It is killing her cash flow. She just took two more in the month of May and one more in March. From three different companies!<\/p>\n<p style=\"padding-left: 30px;\">We don’t mind telling our clients no. I told her, &#8220;I funded you in the past, you only had one loan, but right now you&#8217;re way overleveraged.&#8221;  We do not want to put their business or our investors into a less than desirable position.<\/p>\n<blockquote>\n<p style=\"padding-left: 30px;\">Business owners should to have a trust level with their adviser and not just sign off [on a loan] just because you need to make payroll. Really understand whether you can afford options presented before moving forward.<\/p>\n<\/blockquote>\n<p><i>You&#8217;re talking about a client who had taken out three, four, five different loans with different companies, and so she was stuck in a debt spiral, taking out loans to pay off the other loans? That sounds really tough.<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Yes. Whomever she was working with was not looking to build a long-term successful relationship with her. That&#8217;s the challenge I&#8217;ve been facing lately, and why I try to <i>keep<\/i> all my clients. That’s why we were are successful 10 years on.<\/p>\n<p style=\"padding-left: 30px;\">We&#8217;re family-operated so it&#8217;s not like I&#8217;m going anywhere. We&#8217;re here to answer the questions and help them. I&#8217;d rather guide my clients through what needs to be done than do a one-time deal that kills their business. It is just not worth it.<\/p>\n<p><i>It sounds like there&#8217;s a lot of trust missing in the industry, and it’s very important for small business owners to decide who to trust.<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Correct. When looking for funding, [business owners should] pay attention to how the salesperson or the rep is talking to them. If the rep is transparent and they are there to provide guidance, that’s good. They should be trying to educate and build a relationship. An adviser that just says yes, yes, yes, send me the paperwork, is not going to fully understand your situation.<\/p>\n<p><i>That makes sense. If you&#8217;re talking to someone about a loan and they don&#8217;t seem to care what you&#8217;re trying to achieve long-term with your business, that should be a red flag.<\/i><\/p>\n<p style=\"padding-left: 30px;\"><b>IM:<\/b> Exactly. Ask how long they have worked for the firm they are with. Ask if they have had clients in a similar industry or situation. If they aren’t asking questions they are most likely just presenting paperwork—not what makes your business great—to an underwriter.<\/p>\n<p><i>We agree! Thanks Irina, for sharing your experience and advice.<\/i><\/p>\n<p>&nbsp;<\/p>\n<hr \/>\n<p><i>About Irina Martin<\/i><\/p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"https:\/\/www.linkedin.com\/in\/irina-martin-459936139\/\">Irina Martin<\/a><\/strong> started <strong><a href=\"https:\/\/expressbusinessloans.com\/\">Express Business Loans<\/a><\/strong> (EBL) with her husband Michael in 2008, and has been working to help small business owners grow, get funding, and achieve their dreams ever since. As one of the earliest firms in the space, the EBL team has developed strong relationships in the rapidly-expanding small business alternative finance industry. Today, they work with a number of fintech lenders to help connect business owners with the capital they need. EBL has been featured in publications such as TheStreet.com and Entrepreneur Magazine, and maintains an “A+” rating with the Better Business Bureau.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today we’re pleased to share a conversation we had with Irina Martin, one half of the hardworking husband and wife &#8230;<\/p>\n","protected":false},"author":61,"featured_media":9388,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[11504,11547,426],"yst_prominent_words":[723,1808,719,1844,713,773,8894,8892,838,8901,8899,3037,8900,8898,8897,1157,712,709,1522,1682],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"Irina Martin on Her Consultative Approach to Working Capital Financing | Fundbox Blog","yoast_meta":[{"name":"description","content":"Today we’re pleased to share a conversation we had with Irina Martin, one half of the hardworking husband and wife team behind Express Business Loans. A Fundbox partner and certified women-owned business, Express Business Loans has been around since 2008. In that time, they’ve helped thousands of small businesses"},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"Irina Martin on Her Consultative Approach to Working Capital Financing | Fundbox Blog"},{"property":"og:description","content":"Today we’re pleased to share a conversation we had with Irina Martin, one half of the hardworking husband and wife team behind Express Business Loans. A Fundbox partner and certified women-owned business, Express Business Loans has been around since 2008. In that time, they’ve helped thousands of small businesses"},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/irina-martin-consultative-approach-working-capital-financing\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/shutterstock_561017920.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/shutterstock_561017920.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Today we’re pleased to share a conversation we had with Irina Martin, one half of the hardworking husband and wife team behind Express Business Loans. A Fundbox partner and certified women-owned business, Express Business Loans has been around since 2008. In that time, they’ve helped thousands of small businesses"},{"name":"twitter:title","content":"Irina Martin on Her Consultative Approach to Working Capital Financing | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/06\/shutterstock_561017920.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/irina-martin-consultative-approach-working-capital-financing\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9383"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/61"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=9383"}],"version-history":[{"count":7,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9383\/revisions"}],"predecessor-version":[{"id":9852,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9383\/revisions\/9852"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9388"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=9383"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=9383"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=9383"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=9383"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}