{"id":9703,"date":"2018-08-28T08:20:00","date_gmt":"2018-08-28T15:20:00","guid":{"rendered":"https:\/\/fundbox.com\/blog\/?p=9703"},"modified":"2020-11-03T07:31:14","modified_gmt":"2020-11-03T15:31:14","slug":"12-accounting-terms-every-small-business-owner-should-know","status":"publish","type":"post","link":"https:\/\/fundbox.com\/blog\/12-accounting-terms-every-small-business-owner-should-know\/","title":{"rendered":"12 Accounting Terms Every Small Business Owner Should Know"},"content":{"rendered":"<p>Starting and running a business means wearing many hats, some that you may never have worn before. Perhaps one of the biggest leaps for business owners is into the field of accounting. Some of the biggest challenges small business face fall under the financial umbrella: managing accounts receivable, cash flow, paperwork, bookkeeping, payroll, and tax preparation. There are a ton of accounting terms and concepts to know, and if you&#8217;re not a financial expert, it can feel daunting.<\/p>\n<p>We’re here to help you navigate. In our <strong>Guide to Accounting<\/strong> series, we’ll highlight some of the key accounting terms and concepts you need to be aware of, how to find and work with an accountant, and beginning with this article, some of the key accounting terms you need to know.<\/p>\n<p>Not all business owners enjoy talking finance. But, understanding the fundamental terms and concepts (and knowing when and where to seek help wrapping your arms around them) is critical to your success. It will also help educate you, so you’re not flummoxed when you meet with an accountant or financial advisor.<\/p>\n<h2>12 Top Accounting Terms for SMBs<\/h2>\n<p>Without further ado, below are some of the top accounting terms every small business owner should know.<\/p>\n<h2>1.  Accounts Receivable and Accounts Payable<\/h2>\n<p>These are perhaps the first terms you’ll need to understand as a business owner, especially if you want to get paid on time. Accounts receivable is money that is owed to you (for example, unpaid invoices and trade credit all fall into this bucket). Managing accounts receivable and your collections process is essential to maintaining healthy cash flow.<\/p>\n<p>Accounts payable is the exact opposite; it’s the money a business owes. For example, if your chasing payment from a customer, you’ll call their accounts payable department.<\/p>\n<h2>2.  Assets<\/h2>\n<p>Business assets are the property that the business owns that can be easily transferred into cash. Assets are also used as collateral when applying for a business loan. They can be tangible assets (equipment, accounts receivable, vehicles) or intangible (intellectual property). Assets are shown on the balance sheet. For tax purposes, the cost of assets (excluding property assets such as land or buildings) can sometimes be depreciated over time.<\/p>\n<p>An accountant can help you accurately assess your assets, the ramifications of selling them, and understand your tax position.<\/p>\n<h2>3.  Balance Sheet<\/h2>\n<p>The balance sheet provides a big picture into your business’ fiscal health. It summarizes key financial data (assets, liabilities, and the owner’s equity) at a given time. The balance sheet can be used to understand the net value of the business, current and long-term debt, asset management, and comparative data pertaining to cash, accounts receivable\/payable, equity, inventory, earnings, etc.<\/p>\n<p>It can seem like an overwhelming financial statement, but it&#8217;s important to understand. Business owners can benefit from the help of an accountant to create and interpret one.<\/p>\n<h2>4.  Break-Even Point<\/h2>\n<p>Different industries have different profit margins, but a break-even analysis can help you determine at what point you’ll reach a cash flow positive situation and make a profit – your breakeven point. You’ve broken even when your revenue equals all your business costs or overheads (fixed and variable). This exercise can take time, so don’t rush it. Make sure you’ve captured all the costs that your business incurs, everything from payroll to paper clips.<\/p>\n<h2>5.  Cash Flow<\/h2>\n<p>According to the latest<a href=\"http:\/\/www.waspbarcode.com\/small-business-report\"> Small Business Accounting Report<\/a> survey by Wasp Barcode Technologies, cash flow was one of the top challenges facing U.S. small businesses in 2017. Simply put, cash flow is the movement of cash in (via accounts receivables) and out of your business (via accounts payable). It’s a delicate balancing act that is easily disrupted by late paying customers, unexpected expenses, a lack of access to capital, etc.<\/p>\n<p>To stay on top of cash flow it’s essential that your business develop and maintain a<a href=\"https:\/\/fundbox.com\/blog\/how-to-create-and-analyze-your-cash-flow-forecast\/\"> cash flow forecast<\/a> and<a href=\"https:\/\/fundbox.com\/blog\/your-small-business-needs-a-cash-flow-statement\/\"> cash flow statement<\/a>. Seek help from an accountant to help you spot warning signs, develop strategies to mitigate problems, etc.<\/p>\n<h2>6.  Cash Conversion Cycle<\/h2>\n<p>Knowing your cash conversion cycle is an important part of managing cash flow. The cash conversion cycle is the time it takes for a business to sell inventory, collect receivables, and pay its bills. In an ideal world, this cycle should be as short as possible so that your money isn’t tied up in inventory or accounts receivable for too long and is free to invest in assets or activities that contribute to income return.<a href=\"https:\/\/fundbox.com\/blog\/how-to-improve-your-small-business-cash-conversion-cycle\/\"> Calculating your cash conversion cycle<\/a> (CCC) is something you should do to support any cash flow analysis exercise and is a key indicator of how your company is managing its working capital.<\/p>\n<h2>7.  Cost of Goods Sold<\/h2>\n<p>Cost of goods sold (COGS) or cost of sales (COS) is a calculation of all the costs involved in manufacturing or selling a product. It’s a required part of your business tax return and can reduce your taxable income. Knowing your COGS can also help you determine how to price your products profitability and help you ensure you’re maintaining sustainable margins. It will also help you identify which product lines may be killing your profitability. COGS is reported on your profit and loss statement.<\/p>\n<h2>8.  Credit<\/h2>\n<p>From<a href=\"https:\/\/fundbox.com\/trade-credit\/\"> trade credit<\/a> (the net terms you extend to a customer), to<a href=\"https:\/\/fundbox.com\/blog\/what-is-a-business-line-of-credit-and-how-does-this-popular-financing-option-work\/\"> a line of credit<\/a>, to your<a href=\"https:\/\/fundbox.com\/blog\/5-cs-of-credit\/\"> personal and business credit score<\/a>, to credit cards – accessing and extending credit is a big part of being in business. Educate yourself on why credit matters to your business, the importance of healthy credit, and what your financing options are if you’d prefer not to intermingle your personal credit with your business credit (many small businesses are boxed into a system that is heavily dependent on personal credit). But<a href=\"https:\/\/fundbox.com\/blog\/direct-draw-newest-member-fundbox-family\/\"> it doesn’t have to be that way<\/a>.<\/p>\n<h2>9.  Expenses<\/h2>\n<p>Expenses are the costs incurred in the daily running of your business – from rent to marketing, training to vehicle mileage. They can be variable (the cost of labor, materials, supplies, wages), fixed (rent), and accrued (expenses that are incurred but not yet billed for). Some but not all expenses are tax deductible. The IRS has<a href=\"https:\/\/www.irs.gov\/businesses\/small-businesses-self-employed\/deducting-business-expenses\"> guidance<\/a> on what you can deduct.<\/p>\n<h2>10.  Liabilities<\/h2>\n<p>Liabilities are the legal or financial debts that your company carries, such as loan repayments, credit card debt, accounts payable, taxes owed, wages, etc. These are all shown on your balance sheet.<\/p>\n<h2>11.  Profit (and how it differs from cash flow)<\/h2>\n<p>When you see that your company is cash flow-positive, you might be quick to assume that your business is profitable, but don’t pop the champagne just yet! While the cash flow and profits of your business are closely related, they are not technically the same thing.<\/p>\n<p>When your company is cash flow-positive, it means your cash inflows exceed your cash outflows. Profit is similar: For a company to be profitable, it needs to have more money coming in than it does going out. When you see that you have more receivables than you do payables, it can be easy to assume that your business is making a profit. But that’s not always the case.<\/p>\n<p>Your business can be profitable without being cash flow-positive—and you can have a positive cash flow without making a profit.<\/p>\n<p><a href=\"https:\/\/fundbox.com\/blog\/cash-flow-positive-vs-profitability-whats-difference\/\">Read more about the difference between being cash-flow positive and being profitable here<\/a>.<\/p>\n<h2>12.  Profit and Loss Statement<\/h2>\n<p>Finally, we arrive at the P&amp;L statement or income statement. This accounting term refers to a key financial tool which provides an overview of how your business is performing over time. A profit and loss statement will break down revenue generated and expenses incurred. It helps you see how profitable your business is and how much cash is left over after your losses are accounted for to grow your business, pay off debt, or contribute to your salary as business owner.<\/p>\n<p>&#8212;<\/p>\n<p><b>In the next post in this series, we’ll discuss which accounting method is best for your business – the accrual method or the cash method. It’s an important decision that can have a big impact on your taxes, time spent on admin, and the big picture view of your finances.<\/b><\/p>\n<blockquote class=\"wp-embedded-content\" data-secret=\"G3HSYL4Wa1\"><p><a href=\"https:\/\/fundbox.com\/blog\/financial-indicators-review-accountant\/\">5 Financial Indicators to Review with Your Accountant<\/a><\/p><\/blockquote>\n<p><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"&#8220;5 Financial Indicators to Review with Your Accountant&#8221; &#8212; Fundbox\" src=\"https:\/\/fundbox.com\/blog\/financial-indicators-review-accountant\/embed\/#?secret=G3HSYL4Wa1\" data-secret=\"G3HSYL4Wa1\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Starting and running a business means wearing many hats, some that you may never have worn before. Perhaps one of &#8230;<\/p>\n","protected":false},"author":7,"featured_media":9706,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[21],"tags":[232,11532],"yst_prominent_words":[9232,9234,2672,2701,1683,1349,2305,723,3202,1673,1671,713,1672,2416,3198,9233,9230,2298,9229,9235],"post-meta-fields":{"stripe_selected":null,"preview_color":null,"bw_feature":null,"category_color":null},"yoast_title":"12 Accounting Terms Every Small Business Owner Should Know | Fundbox Blog","yoast_meta":[{"name":"description","content":"Not all business owners enjoy talking finance. But, understanding the fundamental terms and concepts is critical to your success. In our Guide to Accounting series, we’ll highlight some of the key accounting terms and concepts you need to know."},{"property":"og:locale","content":"en_US"},{"property":"og:type","content":"article"},{"property":"og:title","content":"12 Accounting Terms Every Small Business Owner Should Know | Fundbox Blog"},{"property":"og:description","content":"Not all business owners enjoy talking finance. But, understanding the fundamental terms and concepts is critical to your success. In our Guide to Accounting series, we’ll highlight some of the key accounting terms and concepts you need to know."},{"property":"og:url","content":"https:\/\/fundbox.com\/blog\/12-accounting-terms-every-small-business-owner-should-know\/"},{"property":"og:site_name","content":"Fundbox"},{"property":"article:publisher","content":"https:\/\/www.facebook.com\/Fundbox\/"},{"property":"og:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/08\/shutterstock_1062059858.jpg"},{"property":"og:image:secure_url","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/08\/shutterstock_1062059858.jpg"},{"property":"og:image:width","content":"1000"},{"property":"og:image:height","content":"667"},{"name":"twitter:card","content":"summary"},{"name":"twitter:description","content":"Not all business owners enjoy talking finance. But, understanding the fundamental terms and concepts is critical to your success. In our Guide to Accounting series, we’ll highlight some of the key accounting terms and concepts you need to know."},{"name":"twitter:title","content":"12 Accounting Terms Every Small Business Owner Should Know | Fundbox Blog"},{"name":"twitter:site","content":"@fundbox"},{"name":"twitter:image","content":"https:\/\/fundbox.com\/blog\/wp-content\/uploads\/2018\/08\/shutterstock_1062059858.jpg"},{"name":"twitter:creator","content":"@fundbox"}],"yoast_json_ld":[{"@context":"http:\/\/schema.org","@type":"WebSite","@id":"#website","url":"https:\/\/fundbox.com\/blog\/","name":"Fundbox Blog","potentialAction":{"@type":"SearchAction","target":"https:\/\/fundbox.com\/blog\/?s={search_term_string}","query-input":"required name=search_term_string"}},{"@context":"http:\/\/schema.org","@type":"Organization","url":"https:\/\/fundbox.com\/blog\/12-accounting-terms-every-small-business-owner-should-know\/","sameAs":["https:\/\/www.facebook.com\/Fundbox\/","https:\/\/www.linkedin.com\/company\/fundbox\/","https:\/\/twitter.com\/fundbox"],"@id":"#organization","name":"Fundbox","logo":"https:\/\/fundbox.com\/img\/brand-logo.png"}],"_links":{"self":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9703"}],"collection":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/comments?post=9703"}],"version-history":[{"count":5,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9703\/revisions"}],"predecessor-version":[{"id":13866,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/posts\/9703\/revisions\/13866"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media\/9706"}],"wp:attachment":[{"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/media?parent=9703"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/categories?post=9703"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/tags?post=9703"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/fundbox.com\/blog\/wp-json\/wp\/v2\/yst_prominent_words?post=9703"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}